#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AndroidGoodies

#include "Basic.hpp"

#include "AndroidGoodies_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AndroidGoodies.AGAlarmClock.CanSetAlarm
// 0x0001 (0x0001 - 0x0000)
struct AGAlarmClock_CanSetAlarm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGAlarmClock_CanSetAlarm) == 0x000001, "Wrong alignment on AGAlarmClock_CanSetAlarm");
static_assert(sizeof(AGAlarmClock_CanSetAlarm) == 0x000001, "Wrong size on AGAlarmClock_CanSetAlarm");
static_assert(offsetof(AGAlarmClock_CanSetAlarm, ReturnValue) == 0x000000, "Member 'AGAlarmClock_CanSetAlarm::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGAlarmClock.CanSetTimer
// 0x0001 (0x0001 - 0x0000)
struct AGAlarmClock_CanSetTimer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGAlarmClock_CanSetTimer) == 0x000001, "Wrong alignment on AGAlarmClock_CanSetTimer");
static_assert(sizeof(AGAlarmClock_CanSetTimer) == 0x000001, "Wrong size on AGAlarmClock_CanSetTimer");
static_assert(offsetof(AGAlarmClock_CanSetTimer, ReturnValue) == 0x000000, "Member 'AGAlarmClock_CanSetTimer::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGAlarmClock.SetAlarm
// 0x0028 (0x0028 - 0x0000)
struct AGAlarmClock_SetAlarm final
{
public:
	int32                                         Hour;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Minute;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Message;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAGAlarmDaysData                       Days;                                              // 0x0018(0x0007)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          Vibrate;                                           // 0x001F(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SkipUi;                                            // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AGAlarmClock_SetAlarm) == 0x000008, "Wrong alignment on AGAlarmClock_SetAlarm");
static_assert(sizeof(AGAlarmClock_SetAlarm) == 0x000028, "Wrong size on AGAlarmClock_SetAlarm");
static_assert(offsetof(AGAlarmClock_SetAlarm, Hour) == 0x000000, "Member 'AGAlarmClock_SetAlarm::Hour' has a wrong offset!");
static_assert(offsetof(AGAlarmClock_SetAlarm, Minute) == 0x000004, "Member 'AGAlarmClock_SetAlarm::Minute' has a wrong offset!");
static_assert(offsetof(AGAlarmClock_SetAlarm, Message) == 0x000008, "Member 'AGAlarmClock_SetAlarm::Message' has a wrong offset!");
static_assert(offsetof(AGAlarmClock_SetAlarm, Days) == 0x000018, "Member 'AGAlarmClock_SetAlarm::Days' has a wrong offset!");
static_assert(offsetof(AGAlarmClock_SetAlarm, Vibrate) == 0x00001F, "Member 'AGAlarmClock_SetAlarm::Vibrate' has a wrong offset!");
static_assert(offsetof(AGAlarmClock_SetAlarm, SkipUi) == 0x000020, "Member 'AGAlarmClock_SetAlarm::SkipUi' has a wrong offset!");

// Function AndroidGoodies.AGAlarmClock.SetTimer
// 0x0020 (0x0020 - 0x0000)
struct AGAlarmClock_SetTimer final
{
public:
	int32                                         LengthSeconds;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SkipUi;                                            // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AGAlarmClock_SetTimer) == 0x000008, "Wrong alignment on AGAlarmClock_SetTimer");
static_assert(sizeof(AGAlarmClock_SetTimer) == 0x000020, "Wrong size on AGAlarmClock_SetTimer");
static_assert(offsetof(AGAlarmClock_SetTimer, LengthSeconds) == 0x000000, "Member 'AGAlarmClock_SetTimer::LengthSeconds' has a wrong offset!");
static_assert(offsetof(AGAlarmClock_SetTimer, Message) == 0x000008, "Member 'AGAlarmClock_SetTimer::Message' has a wrong offset!");
static_assert(offsetof(AGAlarmClock_SetTimer, SkipUi) == 0x000018, "Member 'AGAlarmClock_SetTimer::SkipUi' has a wrong offset!");

// Function AndroidGoodies.AGAlarmClock.SnoozeAlarm
// 0x0004 (0x0004 - 0x0000)
struct AGAlarmClock_SnoozeAlarm final
{
public:
	int32                                         SnoozeDurationMinutes;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGAlarmClock_SnoozeAlarm) == 0x000004, "Wrong alignment on AGAlarmClock_SnoozeAlarm");
static_assert(sizeof(AGAlarmClock_SnoozeAlarm) == 0x000004, "Wrong size on AGAlarmClock_SnoozeAlarm");
static_assert(offsetof(AGAlarmClock_SnoozeAlarm, SnoozeDurationMinutes) == 0x000000, "Member 'AGAlarmClock_SnoozeAlarm::SnoozeDurationMinutes' has a wrong offset!");

// Function AndroidGoodies.AGApps.CallPhoneNumber
// 0x0010 (0x0010 - 0x0000)
struct AGApps_CallPhoneNumber final
{
public:
	class FString                                 Number;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGApps_CallPhoneNumber) == 0x000008, "Wrong alignment on AGApps_CallPhoneNumber");
static_assert(sizeof(AGApps_CallPhoneNumber) == 0x000010, "Wrong size on AGApps_CallPhoneNumber");
static_assert(offsetof(AGApps_CallPhoneNumber, Number) == 0x000000, "Member 'AGApps_CallPhoneNumber::Number' has a wrong offset!");

// Function AndroidGoodies.AGApps.DialPhoneNumber
// 0x0010 (0x0010 - 0x0000)
struct AGApps_DialPhoneNumber final
{
public:
	class FString                                 Number;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGApps_DialPhoneNumber) == 0x000008, "Wrong alignment on AGApps_DialPhoneNumber");
static_assert(sizeof(AGApps_DialPhoneNumber) == 0x000010, "Wrong size on AGApps_DialPhoneNumber");
static_assert(offsetof(AGApps_DialPhoneNumber, Number) == 0x000000, "Member 'AGApps_DialPhoneNumber::Number' has a wrong offset!");

// Function AndroidGoodies.AGApps.DownloadAndInstallApk
// 0x0040 (0x0040 - 0x0000)
struct AGApps_DownloadAndInstallApk final
{
public:
	class FString                                 DownloadUrl;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DownloadTitle;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DownloadDescription;                               // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& Error)>   OnError;                                           // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGApps_DownloadAndInstallApk) == 0x000008, "Wrong alignment on AGApps_DownloadAndInstallApk");
static_assert(sizeof(AGApps_DownloadAndInstallApk) == 0x000040, "Wrong size on AGApps_DownloadAndInstallApk");
static_assert(offsetof(AGApps_DownloadAndInstallApk, DownloadUrl) == 0x000000, "Member 'AGApps_DownloadAndInstallApk::DownloadUrl' has a wrong offset!");
static_assert(offsetof(AGApps_DownloadAndInstallApk, DownloadTitle) == 0x000010, "Member 'AGApps_DownloadAndInstallApk::DownloadTitle' has a wrong offset!");
static_assert(offsetof(AGApps_DownloadAndInstallApk, DownloadDescription) == 0x000020, "Member 'AGApps_DownloadAndInstallApk::DownloadDescription' has a wrong offset!");
static_assert(offsetof(AGApps_DownloadAndInstallApk, OnError) == 0x000030, "Member 'AGApps_DownloadAndInstallApk::OnError' has a wrong offset!");

// Function AndroidGoodies.AGApps.HasPhoneApp
// 0x0001 (0x0001 - 0x0000)
struct AGApps_HasPhoneApp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGApps_HasPhoneApp) == 0x000001, "Wrong alignment on AGApps_HasPhoneApp");
static_assert(sizeof(AGApps_HasPhoneApp) == 0x000001, "Wrong size on AGApps_HasPhoneApp");
static_assert(offsetof(AGApps_HasPhoneApp, ReturnValue) == 0x000000, "Member 'AGApps_HasPhoneApp::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGApps.InstallApkFromFile
// 0x0020 (0x0020 - 0x0000)
struct AGApps_InstallApkFromFile final
{
public:
	class FString                                 FilePath;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& Error)>   OnError;                                           // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGApps_InstallApkFromFile) == 0x000008, "Wrong alignment on AGApps_InstallApkFromFile");
static_assert(sizeof(AGApps_InstallApkFromFile) == 0x000020, "Wrong size on AGApps_InstallApkFromFile");
static_assert(offsetof(AGApps_InstallApkFromFile, FilePath) == 0x000000, "Member 'AGApps_InstallApkFromFile::FilePath' has a wrong offset!");
static_assert(offsetof(AGApps_InstallApkFromFile, OnError) == 0x000010, "Member 'AGApps_InstallApkFromFile::OnError' has a wrong offset!");

// Function AndroidGoodies.AGApps.OpenAnotherApplication
// 0x0010 (0x0010 - 0x0000)
struct AGApps_OpenAnotherApplication final
{
public:
	class FString                                 PackageName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGApps_OpenAnotherApplication) == 0x000008, "Wrong alignment on AGApps_OpenAnotherApplication");
static_assert(sizeof(AGApps_OpenAnotherApplication) == 0x000010, "Wrong size on AGApps_OpenAnotherApplication");
static_assert(offsetof(AGApps_OpenAnotherApplication, PackageName) == 0x000000, "Member 'AGApps_OpenAnotherApplication::PackageName' has a wrong offset!");

// Function AndroidGoodies.AGApps.OpenFacebookProfile
// 0x0010 (0x0010 - 0x0000)
struct AGApps_OpenFacebookProfile final
{
public:
	class FString                                 ProfileId;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGApps_OpenFacebookProfile) == 0x000008, "Wrong alignment on AGApps_OpenFacebookProfile");
static_assert(sizeof(AGApps_OpenFacebookProfile) == 0x000010, "Wrong size on AGApps_OpenFacebookProfile");
static_assert(offsetof(AGApps_OpenFacebookProfile, ProfileId) == 0x000000, "Member 'AGApps_OpenFacebookProfile::ProfileId' has a wrong offset!");

// Function AndroidGoodies.AGApps.OpenInstagramProfile
// 0x0010 (0x0010 - 0x0000)
struct AGApps_OpenInstagramProfile final
{
public:
	class FString                                 ProfileId;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGApps_OpenInstagramProfile) == 0x000008, "Wrong alignment on AGApps_OpenInstagramProfile");
static_assert(sizeof(AGApps_OpenInstagramProfile) == 0x000010, "Wrong size on AGApps_OpenInstagramProfile");
static_assert(offsetof(AGApps_OpenInstagramProfile, ProfileId) == 0x000000, "Member 'AGApps_OpenInstagramProfile::ProfileId' has a wrong offset!");

// Function AndroidGoodies.AGApps.OpenTwitterProfile
// 0x0010 (0x0010 - 0x0000)
struct AGApps_OpenTwitterProfile final
{
public:
	class FString                                 ProfileId;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGApps_OpenTwitterProfile) == 0x000008, "Wrong alignment on AGApps_OpenTwitterProfile");
static_assert(sizeof(AGApps_OpenTwitterProfile) == 0x000010, "Wrong size on AGApps_OpenTwitterProfile");
static_assert(offsetof(AGApps_OpenTwitterProfile, ProfileId) == 0x000000, "Member 'AGApps_OpenTwitterProfile::ProfileId' has a wrong offset!");

// Function AndroidGoodies.AGApps.OpenYoutubeVideo
// 0x0010 (0x0010 - 0x0000)
struct AGApps_OpenYoutubeVideo final
{
public:
	class FString                                 VideoId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGApps_OpenYoutubeVideo) == 0x000008, "Wrong alignment on AGApps_OpenYoutubeVideo");
static_assert(sizeof(AGApps_OpenYoutubeVideo) == 0x000010, "Wrong size on AGApps_OpenYoutubeVideo");
static_assert(offsetof(AGApps_OpenYoutubeVideo, VideoId) == 0x000000, "Member 'AGApps_OpenYoutubeVideo::VideoId' has a wrong offset!");

// Function AndroidGoodies.AGApps.UninstallPackage
// 0x0010 (0x0010 - 0x0000)
struct AGApps_UninstallPackage final
{
public:
	class FString                                 PackageName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGApps_UninstallPackage) == 0x000008, "Wrong alignment on AGApps_UninstallPackage");
static_assert(sizeof(AGApps_UninstallPackage) == 0x000010, "Wrong size on AGApps_UninstallPackage");
static_assert(offsetof(AGApps_UninstallPackage, PackageName) == 0x000000, "Member 'AGApps_UninstallPackage::PackageName' has a wrong offset!");

// Function AndroidGoodies.AGChosenFile.GetCreatedAt
// 0x0008 (0x0008 - 0x0000)
struct AGChosenFile_GetCreatedAt final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGChosenFile_GetCreatedAt) == 0x000008, "Wrong alignment on AGChosenFile_GetCreatedAt");
static_assert(sizeof(AGChosenFile_GetCreatedAt) == 0x000008, "Wrong size on AGChosenFile_GetCreatedAt");
static_assert(offsetof(AGChosenFile_GetCreatedAt, ReturnValue) == 0x000000, "Member 'AGChosenFile_GetCreatedAt::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGChosenFile.GetDisplayName
// 0x0010 (0x0010 - 0x0000)
struct AGChosenFile_GetDisplayName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGChosenFile_GetDisplayName) == 0x000008, "Wrong alignment on AGChosenFile_GetDisplayName");
static_assert(sizeof(AGChosenFile_GetDisplayName) == 0x000010, "Wrong size on AGChosenFile_GetDisplayName");
static_assert(offsetof(AGChosenFile_GetDisplayName, ReturnValue) == 0x000000, "Member 'AGChosenFile_GetDisplayName::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGChosenFile.GetFileExtensionFromMimeType
// 0x0010 (0x0010 - 0x0000)
struct AGChosenFile_GetFileExtensionFromMimeType final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGChosenFile_GetFileExtensionFromMimeType) == 0x000008, "Wrong alignment on AGChosenFile_GetFileExtensionFromMimeType");
static_assert(sizeof(AGChosenFile_GetFileExtensionFromMimeType) == 0x000010, "Wrong size on AGChosenFile_GetFileExtensionFromMimeType");
static_assert(offsetof(AGChosenFile_GetFileExtensionFromMimeType, ReturnValue) == 0x000000, "Member 'AGChosenFile_GetFileExtensionFromMimeType::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGChosenFile.GetFileExtensionFromMimeTypeWithoutDot
// 0x0010 (0x0010 - 0x0000)
struct AGChosenFile_GetFileExtensionFromMimeTypeWithoutDot final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGChosenFile_GetFileExtensionFromMimeTypeWithoutDot) == 0x000008, "Wrong alignment on AGChosenFile_GetFileExtensionFromMimeTypeWithoutDot");
static_assert(sizeof(AGChosenFile_GetFileExtensionFromMimeTypeWithoutDot) == 0x000010, "Wrong size on AGChosenFile_GetFileExtensionFromMimeTypeWithoutDot");
static_assert(offsetof(AGChosenFile_GetFileExtensionFromMimeTypeWithoutDot, ReturnValue) == 0x000000, "Member 'AGChosenFile_GetFileExtensionFromMimeTypeWithoutDot::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGChosenFile.GetHumanReadableSize
// 0x0018 (0x0018 - 0x0000)
struct AGChosenFile_GetHumanReadableSize final
{
public:
	bool                                          bytesRounded;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGChosenFile_GetHumanReadableSize) == 0x000008, "Wrong alignment on AGChosenFile_GetHumanReadableSize");
static_assert(sizeof(AGChosenFile_GetHumanReadableSize) == 0x000018, "Wrong size on AGChosenFile_GetHumanReadableSize");
static_assert(offsetof(AGChosenFile_GetHumanReadableSize, bytesRounded) == 0x000000, "Member 'AGChosenFile_GetHumanReadableSize::bytesRounded' has a wrong offset!");
static_assert(offsetof(AGChosenFile_GetHumanReadableSize, ReturnValue) == 0x000008, "Member 'AGChosenFile_GetHumanReadableSize::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGChosenFile.GetMimeType
// 0x0010 (0x0010 - 0x0000)
struct AGChosenFile_GetMimeType final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGChosenFile_GetMimeType) == 0x000008, "Wrong alignment on AGChosenFile_GetMimeType");
static_assert(sizeof(AGChosenFile_GetMimeType) == 0x000010, "Wrong size on AGChosenFile_GetMimeType");
static_assert(offsetof(AGChosenFile_GetMimeType, ReturnValue) == 0x000000, "Member 'AGChosenFile_GetMimeType::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGChosenFile.GetOriginalPath
// 0x0010 (0x0010 - 0x0000)
struct AGChosenFile_GetOriginalPath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGChosenFile_GetOriginalPath) == 0x000008, "Wrong alignment on AGChosenFile_GetOriginalPath");
static_assert(sizeof(AGChosenFile_GetOriginalPath) == 0x000010, "Wrong size on AGChosenFile_GetOriginalPath");
static_assert(offsetof(AGChosenFile_GetOriginalPath, ReturnValue) == 0x000000, "Member 'AGChosenFile_GetOriginalPath::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGChosenFile.GetSize
// 0x0008 (0x0008 - 0x0000)
struct AGChosenFile_GetSize final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGChosenFile_GetSize) == 0x000008, "Wrong alignment on AGChosenFile_GetSize");
static_assert(sizeof(AGChosenFile_GetSize) == 0x000008, "Wrong size on AGChosenFile_GetSize");
static_assert(offsetof(AGChosenFile_GetSize, ReturnValue) == 0x000000, "Member 'AGChosenFile_GetSize::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGChosenFile.IsSuccess
// 0x0001 (0x0001 - 0x0000)
struct AGChosenFile_IsSuccess final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGChosenFile_IsSuccess) == 0x000001, "Wrong alignment on AGChosenFile_IsSuccess");
static_assert(sizeof(AGChosenFile_IsSuccess) == 0x000001, "Wrong size on AGChosenFile_IsSuccess");
static_assert(offsetof(AGChosenFile_IsSuccess, ReturnValue) == 0x000000, "Member 'AGChosenFile_IsSuccess::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGChosenImage.GetHeight
// 0x0004 (0x0004 - 0x0000)
struct AGChosenImage_GetHeight final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGChosenImage_GetHeight) == 0x000004, "Wrong alignment on AGChosenImage_GetHeight");
static_assert(sizeof(AGChosenImage_GetHeight) == 0x000004, "Wrong size on AGChosenImage_GetHeight");
static_assert(offsetof(AGChosenImage_GetHeight, ReturnValue) == 0x000000, "Member 'AGChosenImage_GetHeight::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGChosenImage.GetOrientation
// 0x0004 (0x0004 - 0x0000)
struct AGChosenImage_GetOrientation final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGChosenImage_GetOrientation) == 0x000004, "Wrong alignment on AGChosenImage_GetOrientation");
static_assert(sizeof(AGChosenImage_GetOrientation) == 0x000004, "Wrong size on AGChosenImage_GetOrientation");
static_assert(offsetof(AGChosenImage_GetOrientation, ReturnValue) == 0x000000, "Member 'AGChosenImage_GetOrientation::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGChosenImage.GetOrientationName
// 0x0010 (0x0010 - 0x0000)
struct AGChosenImage_GetOrientationName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGChosenImage_GetOrientationName) == 0x000008, "Wrong alignment on AGChosenImage_GetOrientationName");
static_assert(sizeof(AGChosenImage_GetOrientationName) == 0x000010, "Wrong size on AGChosenImage_GetOrientationName");
static_assert(offsetof(AGChosenImage_GetOrientationName, ReturnValue) == 0x000000, "Member 'AGChosenImage_GetOrientationName::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGChosenImage.GetThumbnailPath
// 0x0010 (0x0010 - 0x0000)
struct AGChosenImage_GetThumbnailPath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGChosenImage_GetThumbnailPath) == 0x000008, "Wrong alignment on AGChosenImage_GetThumbnailPath");
static_assert(sizeof(AGChosenImage_GetThumbnailPath) == 0x000010, "Wrong size on AGChosenImage_GetThumbnailPath");
static_assert(offsetof(AGChosenImage_GetThumbnailPath, ReturnValue) == 0x000000, "Member 'AGChosenImage_GetThumbnailPath::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGChosenImage.GetThumbnailSmallPath
// 0x0010 (0x0010 - 0x0000)
struct AGChosenImage_GetThumbnailSmallPath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGChosenImage_GetThumbnailSmallPath) == 0x000008, "Wrong alignment on AGChosenImage_GetThumbnailSmallPath");
static_assert(sizeof(AGChosenImage_GetThumbnailSmallPath) == 0x000010, "Wrong size on AGChosenImage_GetThumbnailSmallPath");
static_assert(offsetof(AGChosenImage_GetThumbnailSmallPath, ReturnValue) == 0x000000, "Member 'AGChosenImage_GetThumbnailSmallPath::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGChosenImage.GetWidth
// 0x0004 (0x0004 - 0x0000)
struct AGChosenImage_GetWidth final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGChosenImage_GetWidth) == 0x000004, "Wrong alignment on AGChosenImage_GetWidth");
static_assert(sizeof(AGChosenImage_GetWidth) == 0x000004, "Wrong size on AGChosenImage_GetWidth");
static_assert(offsetof(AGChosenImage_GetWidth, ReturnValue) == 0x000000, "Member 'AGChosenImage_GetWidth::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGContactsBPL.AddContact
// 0x0028 (0x0028 - 0x0000)
struct AGContactsBPL_AddContact final
{
public:
	struct FAGContact                             Contact;                                           // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AGContactsBPL_AddContact) == 0x000008, "Wrong alignment on AGContactsBPL_AddContact");
static_assert(sizeof(AGContactsBPL_AddContact) == 0x000028, "Wrong size on AGContactsBPL_AddContact");
static_assert(offsetof(AGContactsBPL_AddContact, Contact) == 0x000000, "Member 'AGContactsBPL_AddContact::Contact' has a wrong offset!");
static_assert(offsetof(AGContactsBPL_AddContact, ReturnValue) == 0x000020, "Member 'AGContactsBPL_AddContact::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGContactsBPL.GetAllContacts
// 0x0010 (0x0010 - 0x0000)
struct AGContactsBPL_GetAllContacts final
{
public:
	TArray<struct FAGContact>                     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGContactsBPL_GetAllContacts) == 0x000008, "Wrong alignment on AGContactsBPL_GetAllContacts");
static_assert(sizeof(AGContactsBPL_GetAllContacts) == 0x000010, "Wrong size on AGContactsBPL_GetAllContacts");
static_assert(offsetof(AGContactsBPL_GetAllContacts, ReturnValue) == 0x000000, "Member 'AGContactsBPL_GetAllContacts::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGContactsBPL.GetContactsWithName
// 0x0020 (0x0020 - 0x0000)
struct AGContactsBPL_GetContactsWithName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAGContact>                     ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGContactsBPL_GetContactsWithName) == 0x000008, "Wrong alignment on AGContactsBPL_GetContactsWithName");
static_assert(sizeof(AGContactsBPL_GetContactsWithName) == 0x000020, "Wrong size on AGContactsBPL_GetContactsWithName");
static_assert(offsetof(AGContactsBPL_GetContactsWithName, Name_0) == 0x000000, "Member 'AGContactsBPL_GetContactsWithName::Name_0' has a wrong offset!");
static_assert(offsetof(AGContactsBPL_GetContactsWithName, ReturnValue) == 0x000010, "Member 'AGContactsBPL_GetContactsWithName::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGContactsBPL.GetContactsWithNumber
// 0x0020 (0x0020 - 0x0000)
struct AGContactsBPL_GetContactsWithNumber final
{
public:
	class FString                                 Number;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAGContact>                     ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGContactsBPL_GetContactsWithNumber) == 0x000008, "Wrong alignment on AGContactsBPL_GetContactsWithNumber");
static_assert(sizeof(AGContactsBPL_GetContactsWithNumber) == 0x000020, "Wrong size on AGContactsBPL_GetContactsWithNumber");
static_assert(offsetof(AGContactsBPL_GetContactsWithNumber, Number) == 0x000000, "Member 'AGContactsBPL_GetContactsWithNumber::Number' has a wrong offset!");
static_assert(offsetof(AGContactsBPL_GetContactsWithNumber, ReturnValue) == 0x000010, "Member 'AGContactsBPL_GetContactsWithNumber::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGContactsBPL.GetUserPhoneNumber
// 0x0010 (0x0010 - 0x0000)
struct AGContactsBPL_GetUserPhoneNumber final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGContactsBPL_GetUserPhoneNumber) == 0x000008, "Wrong alignment on AGContactsBPL_GetUserPhoneNumber");
static_assert(sizeof(AGContactsBPL_GetUserPhoneNumber) == 0x000010, "Wrong size on AGContactsBPL_GetUserPhoneNumber");
static_assert(offsetof(AGContactsBPL_GetUserPhoneNumber, ReturnValue) == 0x000000, "Member 'AGContactsBPL_GetUserPhoneNumber::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDateTimePickerBPL.ShowDatePicker
// 0x0030 (0x0030 - 0x0000)
struct AGDateTimePickerBPL_ShowDatePicker final
{
public:
	struct FDateTime                              InitialDate;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 Year, int32 Month, int32 Day)> OnDateSetCallback;                                 // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnCancelCallback;                                  // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EDialogTheme                                  Theme;                                             // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AGDateTimePickerBPL_ShowDatePicker) == 0x000008, "Wrong alignment on AGDateTimePickerBPL_ShowDatePicker");
static_assert(sizeof(AGDateTimePickerBPL_ShowDatePicker) == 0x000030, "Wrong size on AGDateTimePickerBPL_ShowDatePicker");
static_assert(offsetof(AGDateTimePickerBPL_ShowDatePicker, InitialDate) == 0x000000, "Member 'AGDateTimePickerBPL_ShowDatePicker::InitialDate' has a wrong offset!");
static_assert(offsetof(AGDateTimePickerBPL_ShowDatePicker, OnDateSetCallback) == 0x000008, "Member 'AGDateTimePickerBPL_ShowDatePicker::OnDateSetCallback' has a wrong offset!");
static_assert(offsetof(AGDateTimePickerBPL_ShowDatePicker, OnCancelCallback) == 0x000018, "Member 'AGDateTimePickerBPL_ShowDatePicker::OnCancelCallback' has a wrong offset!");
static_assert(offsetof(AGDateTimePickerBPL_ShowDatePicker, Theme) == 0x000028, "Member 'AGDateTimePickerBPL_ShowDatePicker::Theme' has a wrong offset!");

// Function AndroidGoodies.AGDateTimePickerBPL.ShowDatePickerWithLimits
// 0x0040 (0x0040 - 0x0000)
struct AGDateTimePickerBPL_ShowDatePickerWithLimits final
{
public:
	struct FDateTime                              InitialDate;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 Year, int32 Month, int32 Day)> OnDateSetCallback;                                 // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnCancelCallback;                                  // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FDateTime                              FromDate;                                          // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ToDate;                                            // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDialogTheme                                  Theme;                                             // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AGDateTimePickerBPL_ShowDatePickerWithLimits) == 0x000008, "Wrong alignment on AGDateTimePickerBPL_ShowDatePickerWithLimits");
static_assert(sizeof(AGDateTimePickerBPL_ShowDatePickerWithLimits) == 0x000040, "Wrong size on AGDateTimePickerBPL_ShowDatePickerWithLimits");
static_assert(offsetof(AGDateTimePickerBPL_ShowDatePickerWithLimits, InitialDate) == 0x000000, "Member 'AGDateTimePickerBPL_ShowDatePickerWithLimits::InitialDate' has a wrong offset!");
static_assert(offsetof(AGDateTimePickerBPL_ShowDatePickerWithLimits, OnDateSetCallback) == 0x000008, "Member 'AGDateTimePickerBPL_ShowDatePickerWithLimits::OnDateSetCallback' has a wrong offset!");
static_assert(offsetof(AGDateTimePickerBPL_ShowDatePickerWithLimits, OnCancelCallback) == 0x000018, "Member 'AGDateTimePickerBPL_ShowDatePickerWithLimits::OnCancelCallback' has a wrong offset!");
static_assert(offsetof(AGDateTimePickerBPL_ShowDatePickerWithLimits, FromDate) == 0x000028, "Member 'AGDateTimePickerBPL_ShowDatePickerWithLimits::FromDate' has a wrong offset!");
static_assert(offsetof(AGDateTimePickerBPL_ShowDatePickerWithLimits, ToDate) == 0x000030, "Member 'AGDateTimePickerBPL_ShowDatePickerWithLimits::ToDate' has a wrong offset!");
static_assert(offsetof(AGDateTimePickerBPL_ShowDatePickerWithLimits, Theme) == 0x000038, "Member 'AGDateTimePickerBPL_ShowDatePickerWithLimits::Theme' has a wrong offset!");

// Function AndroidGoodies.AGDateTimePickerBPL.ShowTimePicker
// 0x002C (0x002C - 0x0000)
struct AGDateTimePickerBPL_ShowTimePicker final
{
public:
	int32                                         Hour;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Minute;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 Hour, int32 Minute)>     OnTimeSetCallback;                                 // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnCancelCallback;                                  // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EDialogTheme                                  Theme;                                             // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Is24HourView;                                      // 0x0029(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AGDateTimePickerBPL_ShowTimePicker) == 0x000004, "Wrong alignment on AGDateTimePickerBPL_ShowTimePicker");
static_assert(sizeof(AGDateTimePickerBPL_ShowTimePicker) == 0x00002C, "Wrong size on AGDateTimePickerBPL_ShowTimePicker");
static_assert(offsetof(AGDateTimePickerBPL_ShowTimePicker, Hour) == 0x000000, "Member 'AGDateTimePickerBPL_ShowTimePicker::Hour' has a wrong offset!");
static_assert(offsetof(AGDateTimePickerBPL_ShowTimePicker, Minute) == 0x000004, "Member 'AGDateTimePickerBPL_ShowTimePicker::Minute' has a wrong offset!");
static_assert(offsetof(AGDateTimePickerBPL_ShowTimePicker, OnTimeSetCallback) == 0x000008, "Member 'AGDateTimePickerBPL_ShowTimePicker::OnTimeSetCallback' has a wrong offset!");
static_assert(offsetof(AGDateTimePickerBPL_ShowTimePicker, OnCancelCallback) == 0x000018, "Member 'AGDateTimePickerBPL_ShowTimePicker::OnCancelCallback' has a wrong offset!");
static_assert(offsetof(AGDateTimePickerBPL_ShowTimePicker, Theme) == 0x000028, "Member 'AGDateTimePickerBPL_ShowTimePicker::Theme' has a wrong offset!");
static_assert(offsetof(AGDateTimePickerBPL_ShowTimePicker, Is24HourView) == 0x000029, "Member 'AGDateTimePickerBPL_ShowTimePicker::Is24HourView' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetAndroidId
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetAndroidId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetAndroidId) == 0x000008, "Wrong alignment on AGDeviceInfo_GetAndroidId");
static_assert(sizeof(AGDeviceInfo_GetAndroidId) == 0x000010, "Wrong size on AGDeviceInfo_GetAndroidId");
static_assert(offsetof(AGDeviceInfo_GetAndroidId, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetAndroidId::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetApplicationPackageName
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetApplicationPackageName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetApplicationPackageName) == 0x000008, "Wrong alignment on AGDeviceInfo_GetApplicationPackageName");
static_assert(sizeof(AGDeviceInfo_GetApplicationPackageName) == 0x000010, "Wrong size on AGDeviceInfo_GetApplicationPackageName");
static_assert(offsetof(AGDeviceInfo_GetApplicationPackageName, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetApplicationPackageName::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetBaseOs
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetBaseOs final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetBaseOs) == 0x000008, "Wrong alignment on AGDeviceInfo_GetBaseOs");
static_assert(sizeof(AGDeviceInfo_GetBaseOs) == 0x000010, "Wrong size on AGDeviceInfo_GetBaseOs");
static_assert(offsetof(AGDeviceInfo_GetBaseOs, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetBaseOs::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetBoard
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetBoard final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetBoard) == 0x000008, "Wrong alignment on AGDeviceInfo_GetBoard");
static_assert(sizeof(AGDeviceInfo_GetBoard) == 0x000010, "Wrong size on AGDeviceInfo_GetBoard");
static_assert(offsetof(AGDeviceInfo_GetBoard, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetBoard::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetBootloader
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetBootloader final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetBootloader) == 0x000008, "Wrong alignment on AGDeviceInfo_GetBootloader");
static_assert(sizeof(AGDeviceInfo_GetBootloader) == 0x000010, "Wrong size on AGDeviceInfo_GetBootloader");
static_assert(offsetof(AGDeviceInfo_GetBootloader, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetBootloader::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetBrand
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetBrand final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetBrand) == 0x000008, "Wrong alignment on AGDeviceInfo_GetBrand");
static_assert(sizeof(AGDeviceInfo_GetBrand) == 0x000010, "Wrong size on AGDeviceInfo_GetBrand");
static_assert(offsetof(AGDeviceInfo_GetBrand, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetBrand::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetCodeName
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetCodeName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetCodeName) == 0x000008, "Wrong alignment on AGDeviceInfo_GetCodeName");
static_assert(sizeof(AGDeviceInfo_GetCodeName) == 0x000010, "Wrong size on AGDeviceInfo_GetCodeName");
static_assert(offsetof(AGDeviceInfo_GetCodeName, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetCodeName::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetDevice
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetDevice final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetDevice) == 0x000008, "Wrong alignment on AGDeviceInfo_GetDevice");
static_assert(sizeof(AGDeviceInfo_GetDevice) == 0x000010, "Wrong size on AGDeviceInfo_GetDevice");
static_assert(offsetof(AGDeviceInfo_GetDevice, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetDevice::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetDisplay
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetDisplay final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetDisplay) == 0x000008, "Wrong alignment on AGDeviceInfo_GetDisplay");
static_assert(sizeof(AGDeviceInfo_GetDisplay) == 0x000010, "Wrong size on AGDeviceInfo_GetDisplay");
static_assert(offsetof(AGDeviceInfo_GetDisplay, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetDisplay::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetHardware
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetHardware final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetHardware) == 0x000008, "Wrong alignment on AGDeviceInfo_GetHardware");
static_assert(sizeof(AGDeviceInfo_GetHardware) == 0x000010, "Wrong size on AGDeviceInfo_GetHardware");
static_assert(offsetof(AGDeviceInfo_GetHardware, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetHardware::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetManufacturer
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetManufacturer final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetManufacturer) == 0x000008, "Wrong alignment on AGDeviceInfo_GetManufacturer");
static_assert(sizeof(AGDeviceInfo_GetManufacturer) == 0x000010, "Wrong size on AGDeviceInfo_GetManufacturer");
static_assert(offsetof(AGDeviceInfo_GetManufacturer, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetManufacturer::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetModel
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetModel final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetModel) == 0x000008, "Wrong alignment on AGDeviceInfo_GetModel");
static_assert(sizeof(AGDeviceInfo_GetModel) == 0x000010, "Wrong size on AGDeviceInfo_GetModel");
static_assert(offsetof(AGDeviceInfo_GetModel, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetModel::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetProduct
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetProduct final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetProduct) == 0x000008, "Wrong alignment on AGDeviceInfo_GetProduct");
static_assert(sizeof(AGDeviceInfo_GetProduct) == 0x000010, "Wrong size on AGDeviceInfo_GetProduct");
static_assert(offsetof(AGDeviceInfo_GetProduct, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetProduct::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetRadio
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetRadio final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetRadio) == 0x000008, "Wrong alignment on AGDeviceInfo_GetRadio");
static_assert(sizeof(AGDeviceInfo_GetRadio) == 0x000010, "Wrong size on AGDeviceInfo_GetRadio");
static_assert(offsetof(AGDeviceInfo_GetRadio, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetRadio::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetRelease
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetRelease final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetRelease) == 0x000008, "Wrong alignment on AGDeviceInfo_GetRelease");
static_assert(sizeof(AGDeviceInfo_GetRelease) == 0x000010, "Wrong size on AGDeviceInfo_GetRelease");
static_assert(offsetof(AGDeviceInfo_GetRelease, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetRelease::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetSdkInt
// 0x0004 (0x0004 - 0x0000)
struct AGDeviceInfo_GetSdkInt final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetSdkInt) == 0x000004, "Wrong alignment on AGDeviceInfo_GetSdkInt");
static_assert(sizeof(AGDeviceInfo_GetSdkInt) == 0x000004, "Wrong size on AGDeviceInfo_GetSdkInt");
static_assert(offsetof(AGDeviceInfo_GetSdkInt, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetSdkInt::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetSerial
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetSerial final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetSerial) == 0x000008, "Wrong alignment on AGDeviceInfo_GetSerial");
static_assert(sizeof(AGDeviceInfo_GetSerial) == 0x000010, "Wrong size on AGDeviceInfo_GetSerial");
static_assert(offsetof(AGDeviceInfo_GetSerial, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetSerial::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetTags
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetTags final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetTags) == 0x000008, "Wrong alignment on AGDeviceInfo_GetTags");
static_assert(sizeof(AGDeviceInfo_GetTags) == 0x000010, "Wrong size on AGDeviceInfo_GetTags");
static_assert(offsetof(AGDeviceInfo_GetTags, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetTags::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.GetType
// 0x0010 (0x0010 - 0x0000)
struct AGDeviceInfo_GetType final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_GetType) == 0x000008, "Wrong alignment on AGDeviceInfo_GetType");
static_assert(sizeof(AGDeviceInfo_GetType) == 0x000010, "Wrong size on AGDeviceInfo_GetType");
static_assert(offsetof(AGDeviceInfo_GetType, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_GetType::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.HasCamera
// 0x0001 (0x0001 - 0x0000)
struct AGDeviceInfo_HasCamera final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_HasCamera) == 0x000001, "Wrong alignment on AGDeviceInfo_HasCamera");
static_assert(sizeof(AGDeviceInfo_HasCamera) == 0x000001, "Wrong size on AGDeviceInfo_HasCamera");
static_assert(offsetof(AGDeviceInfo_HasCamera, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_HasCamera::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.HasCameraAny
// 0x0001 (0x0001 - 0x0000)
struct AGDeviceInfo_HasCameraAny final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_HasCameraAny) == 0x000001, "Wrong alignment on AGDeviceInfo_HasCameraAny");
static_assert(sizeof(AGDeviceInfo_HasCameraAny) == 0x000001, "Wrong size on AGDeviceInfo_HasCameraAny");
static_assert(offsetof(AGDeviceInfo_HasCameraAny, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_HasCameraAny::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.HasCameraAr
// 0x0001 (0x0001 - 0x0000)
struct AGDeviceInfo_HasCameraAr final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_HasCameraAr) == 0x000001, "Wrong alignment on AGDeviceInfo_HasCameraAr");
static_assert(sizeof(AGDeviceInfo_HasCameraAr) == 0x000001, "Wrong size on AGDeviceInfo_HasCameraAr");
static_assert(offsetof(AGDeviceInfo_HasCameraAr, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_HasCameraAr::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.HasCameraAutofocus
// 0x0001 (0x0001 - 0x0000)
struct AGDeviceInfo_HasCameraAutofocus final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_HasCameraAutofocus) == 0x000001, "Wrong alignment on AGDeviceInfo_HasCameraAutofocus");
static_assert(sizeof(AGDeviceInfo_HasCameraAutofocus) == 0x000001, "Wrong size on AGDeviceInfo_HasCameraAutofocus");
static_assert(offsetof(AGDeviceInfo_HasCameraAutofocus, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_HasCameraAutofocus::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.HasCameraCapabilityManualPostprocessing
// 0x0001 (0x0001 - 0x0000)
struct AGDeviceInfo_HasCameraCapabilityManualPostprocessing final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_HasCameraCapabilityManualPostprocessing) == 0x000001, "Wrong alignment on AGDeviceInfo_HasCameraCapabilityManualPostprocessing");
static_assert(sizeof(AGDeviceInfo_HasCameraCapabilityManualPostprocessing) == 0x000001, "Wrong size on AGDeviceInfo_HasCameraCapabilityManualPostprocessing");
static_assert(offsetof(AGDeviceInfo_HasCameraCapabilityManualPostprocessing, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_HasCameraCapabilityManualPostprocessing::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.HasCameraCapabilityManualSensor
// 0x0001 (0x0001 - 0x0000)
struct AGDeviceInfo_HasCameraCapabilityManualSensor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_HasCameraCapabilityManualSensor) == 0x000001, "Wrong alignment on AGDeviceInfo_HasCameraCapabilityManualSensor");
static_assert(sizeof(AGDeviceInfo_HasCameraCapabilityManualSensor) == 0x000001, "Wrong size on AGDeviceInfo_HasCameraCapabilityManualSensor");
static_assert(offsetof(AGDeviceInfo_HasCameraCapabilityManualSensor, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_HasCameraCapabilityManualSensor::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.HasCameraCapabilityRaw
// 0x0001 (0x0001 - 0x0000)
struct AGDeviceInfo_HasCameraCapabilityRaw final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_HasCameraCapabilityRaw) == 0x000001, "Wrong alignment on AGDeviceInfo_HasCameraCapabilityRaw");
static_assert(sizeof(AGDeviceInfo_HasCameraCapabilityRaw) == 0x000001, "Wrong size on AGDeviceInfo_HasCameraCapabilityRaw");
static_assert(offsetof(AGDeviceInfo_HasCameraCapabilityRaw, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_HasCameraCapabilityRaw::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.HasCameraExternal
// 0x0001 (0x0001 - 0x0000)
struct AGDeviceInfo_HasCameraExternal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AGDeviceInfo_HasCameraExternal) == 0x000001, "Wrong alignment on AGDeviceInfo_HasCameraExternal");
static_assert(sizeof(AGDeviceInfo_HasCameraExternal) == 0x000001, "Wrong size on AGDeviceInfo_HasCameraExternal");
static_assert(offsetof(AGDeviceInfo_HasCameraExternal, ReturnValue) == 0x000000, "Member 'AGDeviceInfo_HasCameraExternal::ReturnValue' has a wrong offset!");

// Function AndroidGoodies.AGDeviceInfo.HasCameraFlash
