#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Character_Select

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_Character_Select.B_Character_Select_C.ExecuteUbergraph_B_Character_Select
// 0x0028 (0x0028 - 0x0000)
struct B_Character_Select_C_ExecuteUbergraph_B_Character_Select final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Character_Select_C_ExecuteUbergraph_B_Character_Select) == 0x000008, "Wrong alignment on B_Character_Select_C_ExecuteUbergraph_B_Character_Select");
static_assert(sizeof(B_Character_Select_C_ExecuteUbergraph_B_Character_Select) == 0x000028, "Wrong size on B_Character_Select_C_ExecuteUbergraph_B_Character_Select");
static_assert(offsetof(B_Character_Select_C_ExecuteUbergraph_B_Character_Select, EntryPoint) == 0x000000, "Member 'B_Character_Select_C_ExecuteUbergraph_B_Character_Select::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Character_Select_C_ExecuteUbergraph_B_Character_Select, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'B_Character_Select_C_ExecuteUbergraph_B_Character_Select::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Character_Select_C_ExecuteUbergraph_B_Character_Select, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'B_Character_Select_C_ExecuteUbergraph_B_Character_Select::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Character_Select_C_ExecuteUbergraph_B_Character_Select, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'B_Character_Select_C_ExecuteUbergraph_B_Character_Select::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

