#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Login

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_Login.B_Login_C.ExecuteUbergraph_B_Login
// 0x0068 (0x0068 - 0x0000)
struct B_Login_C_ExecuteUbergraph_B_Login final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_2;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_3;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Login_C_ExecuteUbergraph_B_Login) == 0x000008, "Wrong alignment on B_Login_C_ExecuteUbergraph_B_Login");
static_assert(sizeof(B_Login_C_ExecuteUbergraph_B_Login) == 0x000068, "Wrong size on B_Login_C_ExecuteUbergraph_B_Login");
static_assert(offsetof(B_Login_C_ExecuteUbergraph_B_Login, EntryPoint) == 0x000000, "Member 'B_Login_C_ExecuteUbergraph_B_Login::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Login_C_ExecuteUbergraph_B_Login, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'B_Login_C_ExecuteUbergraph_B_Login::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Login_C_ExecuteUbergraph_B_Login, CallFunc_MakeLiteralByte_ReturnValue) == 0x000010, "Member 'B_Login_C_ExecuteUbergraph_B_Login::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Login_C_ExecuteUbergraph_B_Login, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000011, "Member 'B_Login_C_ExecuteUbergraph_B_Login::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Login_C_ExecuteUbergraph_B_Login, CallFunc_GetEndTime_ReturnValue) == 0x000014, "Member 'B_Login_C_ExecuteUbergraph_B_Login::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Login_C_ExecuteUbergraph_B_Login, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'B_Login_C_ExecuteUbergraph_B_Login::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Login_C_ExecuteUbergraph_B_Login, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000020, "Member 'B_Login_C_ExecuteUbergraph_B_Login::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Login_C_ExecuteUbergraph_B_Login, CallFunc_PlayAnimation_ReturnValue_2) == 0x000028, "Member 'B_Login_C_ExecuteUbergraph_B_Login::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Login_C_ExecuteUbergraph_B_Login, CallFunc_GetEndTime_ReturnValue_1) == 0x000030, "Member 'B_Login_C_ExecuteUbergraph_B_Login::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Login_C_ExecuteUbergraph_B_Login, CallFunc_PlayAnimation_ReturnValue_3) == 0x000038, "Member 'B_Login_C_ExecuteUbergraph_B_Login::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Login_C_ExecuteUbergraph_B_Login, CallFunc_GetEndTime_ReturnValue_2) == 0x000040, "Member 'B_Login_C_ExecuteUbergraph_B_Login::CallFunc_GetEndTime_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Login_C_ExecuteUbergraph_B_Login, CallFunc_PlayAnimation_ReturnValue_4) == 0x000048, "Member 'B_Login_C_ExecuteUbergraph_B_Login::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Login_C_ExecuteUbergraph_B_Login, CallFunc_GetEndTime_ReturnValue_3) == 0x000050, "Member 'B_Login_C_ExecuteUbergraph_B_Login::CallFunc_GetEndTime_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Login_C_ExecuteUbergraph_B_Login, CallFunc_PlayAnimation_ReturnValue_5) == 0x000058, "Member 'B_Login_C_ExecuteUbergraph_B_Login::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_Login_C_ExecuteUbergraph_B_Login, CallFunc_PlayAnimation_ReturnValue_6) == 0x000060, "Member 'B_Login_C_ExecuteUbergraph_B_Login::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");

}

