#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Login

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MirMobile_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass B_Login.B_Login_C
// 0x00B0 (0x04A8 - 0x03F8)
class UB_Login_C final : public UMM_B_Login
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_LoadingThrobber;                               // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_HideLoginInfo;                                 // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_TouchLoop;                                     // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_ShowLoginInfo;                                 // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_LoadingLoop;                                   // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_OpenWidget;                                    // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UMirCanvasPanel*                        Can_Logout;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Can_MirMobile;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirCanvasPanel*                        Can_Option;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirCanvasPanel*                        Can_Security;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Grid_Loading;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirCanvasPanel*                        Grid_ServerChange;                                 // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Grid_TouchNotice;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             Grid_Version;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirImage*                              MirImage_1162;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirImage*                              MirImage_All_Bg;                                   // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirImage*                              MirImage_Bottom_Line_1;                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirImage*                              MirImage_Bottom_Line_2;                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirImage*                              MirImage_Top_Line;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirImage*                              MirImage_Top_Line_2;                               // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_GameStart;                                 // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Login(int32 EntryPoint);
	void Display_OpenWidget();
	void Display_ClearAll();
	void Display_ShowLoading();
	void Display_EndLoading();
	void Display_ShowLoginInfo();
	void Display_ShowTouchNotice();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Login_C">();
	}
	static class UB_Login_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UB_Login_C>();
	}
};
static_assert(alignof(UB_Login_C) == 0x000008, "Wrong alignment on UB_Login_C");
static_assert(sizeof(UB_Login_C) == 0x0004A8, "Wrong size on UB_Login_C");
static_assert(offsetof(UB_Login_C, UberGraphFrame) == 0x0003F8, "Member 'UB_Login_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UB_Login_C, Ani_LoadingThrobber) == 0x000400, "Member 'UB_Login_C::Ani_LoadingThrobber' has a wrong offset!");
static_assert(offsetof(UB_Login_C, Ani_HideLoginInfo) == 0x000408, "Member 'UB_Login_C::Ani_HideLoginInfo' has a wrong offset!");
static_assert(offsetof(UB_Login_C, Ani_TouchLoop) == 0x000410, "Member 'UB_Login_C::Ani_TouchLoop' has a wrong offset!");
static_assert(offsetof(UB_Login_C, Ani_ShowLoginInfo) == 0x000418, "Member 'UB_Login_C::Ani_ShowLoginInfo' has a wrong offset!");
static_assert(offsetof(UB_Login_C, Ani_LoadingLoop) == 0x000420, "Member 'UB_Login_C::Ani_LoadingLoop' has a wrong offset!");
static_assert(offsetof(UB_Login_C, Ani_OpenWidget) == 0x000428, "Member 'UB_Login_C::Ani_OpenWidget' has a wrong offset!");
static_assert(offsetof(UB_Login_C, Can_Logout) == 0x000430, "Member 'UB_Login_C::Can_Logout' has a wrong offset!");
static_assert(offsetof(UB_Login_C, Can_MirMobile) == 0x000438, "Member 'UB_Login_C::Can_MirMobile' has a wrong offset!");
static_assert(offsetof(UB_Login_C, Can_Option) == 0x000440, "Member 'UB_Login_C::Can_Option' has a wrong offset!");
static_assert(offsetof(UB_Login_C, Can_Security) == 0x000448, "Member 'UB_Login_C::Can_Security' has a wrong offset!");
static_assert(offsetof(UB_Login_C, Grid_Loading) == 0x000450, "Member 'UB_Login_C::Grid_Loading' has a wrong offset!");
static_assert(offsetof(UB_Login_C, Grid_ServerChange) == 0x000458, "Member 'UB_Login_C::Grid_ServerChange' has a wrong offset!");
static_assert(offsetof(UB_Login_C, Grid_TouchNotice) == 0x000460, "Member 'UB_Login_C::Grid_TouchNotice' has a wrong offset!");
static_assert(offsetof(UB_Login_C, Grid_Version) == 0x000468, "Member 'UB_Login_C::Grid_Version' has a wrong offset!");
static_assert(offsetof(UB_Login_C, MirImage_1162) == 0x000470, "Member 'UB_Login_C::MirImage_1162' has a wrong offset!");
static_assert(offsetof(UB_Login_C, MirImage_All_Bg) == 0x000478, "Member 'UB_Login_C::MirImage_All_Bg' has a wrong offset!");
static_assert(offsetof(UB_Login_C, MirImage_Bottom_Line_1) == 0x000480, "Member 'UB_Login_C::MirImage_Bottom_Line_1' has a wrong offset!");
static_assert(offsetof(UB_Login_C, MirImage_Bottom_Line_2) == 0x000488, "Member 'UB_Login_C::MirImage_Bottom_Line_2' has a wrong offset!");
static_assert(offsetof(UB_Login_C, MirImage_Top_Line) == 0x000490, "Member 'UB_Login_C::MirImage_Top_Line' has a wrong offset!");
static_assert(offsetof(UB_Login_C, MirImage_Top_Line_2) == 0x000498, "Member 'UB_Login_C::MirImage_Top_Line_2' has a wrong offset!");
static_assert(offsetof(UB_Login_C, Overlay_GameStart) == 0x0004A0, "Member 'UB_Login_C::Overlay_GameStart' has a wrong offset!");

}

