#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClassSelect_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MirMobile_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ClassSelect_Slot.ClassSelect_Slot_C
// 0x0018 (0x0328 - 0x0310)
class UClassSelect_Slot_C final : public UMM_ClassSelect_Slot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirImage*                              SelectImage;                                       // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ClassSelect_Slot(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ClassSelect_Slot_C">();
	}
	static class UClassSelect_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClassSelect_Slot_C>();
	}
};
static_assert(alignof(UClassSelect_Slot_C) == 0x000008, "Wrong alignment on UClassSelect_Slot_C");
static_assert(sizeof(UClassSelect_Slot_C) == 0x000328, "Wrong size on UClassSelect_Slot_C");
static_assert(offsetof(UClassSelect_Slot_C, UberGraphFrame) == 0x000310, "Member 'UClassSelect_Slot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UClassSelect_Slot_C, Image_0) == 0x000318, "Member 'UClassSelect_Slot_C::Image_0' has a wrong offset!");
static_assert(offsetof(UClassSelect_Slot_C, SelectImage) == 0x000320, "Member 'UClassSelect_Slot_C::SelectImage' has a wrong offset!");

}

