#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClassSelect_Slot

#include "Basic.hpp"


namespace SDK::Params
{

// Function ClassSelect_Slot.ClassSelect_Slot_C.ExecuteUbergraph_ClassSelect_Slot
// 0x0008 (0x0008 - 0x0000)
struct ClassSelect_Slot_C_ExecuteUbergraph_ClassSelect_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ClassSelect_Slot_C_ExecuteUbergraph_ClassSelect_Slot) == 0x000004, "Wrong alignment on ClassSelect_Slot_C_ExecuteUbergraph_ClassSelect_Slot");
static_assert(sizeof(ClassSelect_Slot_C_ExecuteUbergraph_ClassSelect_Slot) == 0x000008, "Wrong size on ClassSelect_Slot_C_ExecuteUbergraph_ClassSelect_Slot");
static_assert(offsetof(ClassSelect_Slot_C_ExecuteUbergraph_ClassSelect_Slot, EntryPoint) == 0x000000, "Member 'ClassSelect_Slot_C_ExecuteUbergraph_ClassSelect_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(ClassSelect_Slot_C_ExecuteUbergraph_ClassSelect_Slot, K2Node_Event_IsDesignTime) == 0x000004, "Member 'ClassSelect_Slot_C_ExecuteUbergraph_ClassSelect_Slot::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function ClassSelect_Slot.ClassSelect_Slot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ClassSelect_Slot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ClassSelect_Slot_C_PreConstruct) == 0x000001, "Wrong alignment on ClassSelect_Slot_C_PreConstruct");
static_assert(sizeof(ClassSelect_Slot_C_PreConstruct) == 0x000001, "Wrong size on ClassSelect_Slot_C_PreConstruct");
static_assert(offsetof(ClassSelect_Slot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ClassSelect_Slot_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

