#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Common_Btn_Cost

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "MirMobile_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Common_Btn_Cost.Common_Btn_Cost_C
// 0x0048 (0x04C8 - 0x0480)
class UCommon_Btn_Cost_C final : public UMM_Common_Btn_Cost
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Click;                                         // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         C_Hrz_Cost;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirImage*                              Img_CostIcon;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                SizeSpacer;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spc_0;                                             // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirTextBlock*                          Txt_Main;                                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Spacer_0;                                          // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Cost_Alignment;                                    // 0x04C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Text_Alignment;                                    // 0x04C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Common_Btn_Cost(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Common_Btn_Cost_C">();
	}
	static class UCommon_Btn_Cost_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommon_Btn_Cost_C>();
	}
};
static_assert(alignof(UCommon_Btn_Cost_C) == 0x000008, "Wrong alignment on UCommon_Btn_Cost_C");
static_assert(sizeof(UCommon_Btn_Cost_C) == 0x0004C8, "Wrong size on UCommon_Btn_Cost_C");
static_assert(offsetof(UCommon_Btn_Cost_C, UberGraphFrame) == 0x000480, "Member 'UCommon_Btn_Cost_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_Cost_C, Ani_Click) == 0x000488, "Member 'UCommon_Btn_Cost_C::Ani_Click' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_Cost_C, C_Hrz_Cost) == 0x000490, "Member 'UCommon_Btn_Cost_C::C_Hrz_Cost' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_Cost_C, Img_CostIcon) == 0x000498, "Member 'UCommon_Btn_Cost_C::Img_CostIcon' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_Cost_C, SizeSpacer) == 0x0004A0, "Member 'UCommon_Btn_Cost_C::SizeSpacer' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_Cost_C, Spc_0) == 0x0004A8, "Member 'UCommon_Btn_Cost_C::Spc_0' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_Cost_C, Txt_Main) == 0x0004B0, "Member 'UCommon_Btn_Cost_C::Txt_Main' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_Cost_C, Size) == 0x0004B8, "Member 'UCommon_Btn_Cost_C::Size' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_Cost_C, Spacer_0) == 0x0004C0, "Member 'UCommon_Btn_Cost_C::Spacer_0' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_Cost_C, Cost_Alignment) == 0x0004C4, "Member 'UCommon_Btn_Cost_C::Cost_Alignment' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_Cost_C, Text_Alignment) == 0x0004C5, "Member 'UCommon_Btn_Cost_C::Text_Alignment' has a wrong offset!");

}

