#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Common_Btn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Common_Btn.Common_Btn_C.ExecuteUbergraph_Common_Btn
// 0x0018 (0x0018 - 0x0000)
struct Common_Btn_C_ExecuteUbergraph_Common_Btn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Common_Btn_C_ExecuteUbergraph_Common_Btn) == 0x000004, "Wrong alignment on Common_Btn_C_ExecuteUbergraph_Common_Btn");
static_assert(sizeof(Common_Btn_C_ExecuteUbergraph_Common_Btn) == 0x000018, "Wrong size on Common_Btn_C_ExecuteUbergraph_Common_Btn");
static_assert(offsetof(Common_Btn_C_ExecuteUbergraph_Common_Btn, EntryPoint) == 0x000000, "Member 'Common_Btn_C_ExecuteUbergraph_Common_Btn::EntryPoint' has a wrong offset!");
static_assert(offsetof(Common_Btn_C_ExecuteUbergraph_Common_Btn, CallFunc_MakeVector2D_ReturnValue) == 0x000004, "Member 'Common_Btn_C_ExecuteUbergraph_Common_Btn::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Common_Btn_C_ExecuteUbergraph_Common_Btn, CallFunc_MakeVector2D_ReturnValue_1) == 0x00000C, "Member 'Common_Btn_C_ExecuteUbergraph_Common_Btn::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Common_Btn_C_ExecuteUbergraph_Common_Btn, K2Node_Event_IsDesignTime) == 0x000014, "Member 'Common_Btn_C_ExecuteUbergraph_Common_Btn::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function Common_Btn.Common_Btn_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Common_Btn_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Common_Btn_C_PreConstruct) == 0x000001, "Wrong alignment on Common_Btn_C_PreConstruct");
static_assert(sizeof(Common_Btn_C_PreConstruct) == 0x000001, "Wrong size on Common_Btn_C_PreConstruct");
static_assert(offsetof(Common_Btn_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Common_Btn_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

