#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Common_Btn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "MirMobile_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Common_Btn.Common_Btn_C
// 0x0038 (0x0438 - 0x0400)
class UCommon_Btn_C final : public UMM_Common_Btn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Click;                                         // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USpacer*                                SizeSpacer;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spc_Content_0;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spc_Content_1;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ContentSpacer_Width;                               // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Common_Btn(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Common_Btn_C">();
	}
	static class UCommon_Btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommon_Btn_C>();
	}
};
static_assert(alignof(UCommon_Btn_C) == 0x000008, "Wrong alignment on UCommon_Btn_C");
static_assert(sizeof(UCommon_Btn_C) == 0x000438, "Wrong size on UCommon_Btn_C");
static_assert(offsetof(UCommon_Btn_C, UberGraphFrame) == 0x000400, "Member 'UCommon_Btn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_C, Ani_Click) == 0x000408, "Member 'UCommon_Btn_C::Ani_Click' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_C, SizeSpacer) == 0x000410, "Member 'UCommon_Btn_C::SizeSpacer' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_C, Spc_Content_0) == 0x000418, "Member 'UCommon_Btn_C::Spc_Content_0' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_C, Spc_Content_1) == 0x000420, "Member 'UCommon_Btn_C::Spc_Content_1' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_C, Size) == 0x000428, "Member 'UCommon_Btn_C::Size' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_C, ContentSpacer_Width) == 0x000430, "Member 'UCommon_Btn_C::ContentSpacer_Width' has a wrong offset!");

}

