#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Common_Btn_IconText

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "MirMobile_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Common_Btn_IconText.Common_Btn_IconText_C
// 0x0088 (0x04A8 - 0x0420)
class UCommon_Btn_IconText_C final : public UMM_Common_Btn_IconText
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Click;                                         // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGridPanel*                             Grid_Content;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Hrz_Content;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirScaleBox*                           Scl_Txt_Main;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                SizeSpacer;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spc_Content_0;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spc_Content_1;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseVerticalType;                                   // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x3];                                      // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       RenderScale;                                       // 0x0474(0x001C)(Edit, BlueprintVisible, NoDestructor)
	bool                                          IsLeftSideIcon;                                    // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x3];                                      // 0x0491(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                LeftSideIcon_Padding;                              // 0x0494(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         ContentSpacer_Width;                               // 0x04A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Common_Btn_IconText(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Common_Btn_IconText_C">();
	}
	static class UCommon_Btn_IconText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommon_Btn_IconText_C>();
	}
};
static_assert(alignof(UCommon_Btn_IconText_C) == 0x000008, "Wrong alignment on UCommon_Btn_IconText_C");
static_assert(sizeof(UCommon_Btn_IconText_C) == 0x0004A8, "Wrong size on UCommon_Btn_IconText_C");
static_assert(offsetof(UCommon_Btn_IconText_C, UberGraphFrame) == 0x000420, "Member 'UCommon_Btn_IconText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_IconText_C, Ani_Click) == 0x000428, "Member 'UCommon_Btn_IconText_C::Ani_Click' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_IconText_C, Grid_Content) == 0x000430, "Member 'UCommon_Btn_IconText_C::Grid_Content' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_IconText_C, Hrz_Content) == 0x000438, "Member 'UCommon_Btn_IconText_C::Hrz_Content' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_IconText_C, Img_Icon) == 0x000440, "Member 'UCommon_Btn_IconText_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_IconText_C, Scl_Txt_Main) == 0x000448, "Member 'UCommon_Btn_IconText_C::Scl_Txt_Main' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_IconText_C, SizeSpacer) == 0x000450, "Member 'UCommon_Btn_IconText_C::SizeSpacer' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_IconText_C, Spc_Content_0) == 0x000458, "Member 'UCommon_Btn_IconText_C::Spc_Content_0' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_IconText_C, Spc_Content_1) == 0x000460, "Member 'UCommon_Btn_IconText_C::Spc_Content_1' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_IconText_C, Size) == 0x000468, "Member 'UCommon_Btn_IconText_C::Size' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_IconText_C, UseVerticalType) == 0x000470, "Member 'UCommon_Btn_IconText_C::UseVerticalType' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_IconText_C, RenderScale) == 0x000474, "Member 'UCommon_Btn_IconText_C::RenderScale' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_IconText_C, IsLeftSideIcon) == 0x000490, "Member 'UCommon_Btn_IconText_C::IsLeftSideIcon' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_IconText_C, LeftSideIcon_Padding) == 0x000494, "Member 'UCommon_Btn_IconText_C::LeftSideIcon_Padding' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_IconText_C, ContentSpacer_Width) == 0x0004A4, "Member 'UCommon_Btn_IconText_C::ContentSpacer_Width' has a wrong offset!");

}

