#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Common_Btn_Symbol

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "MirMobile_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Common_Btn_Symbol.Common_Btn_Symbol_C
// 0x0020 (0x0398 - 0x0378)
class UCommon_Btn_Symbol_C final : public UMM_Common_Btn_Symbol
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Click;                                         // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USpacer*                                SizeSpacer;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Common_Btn_Symbol(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Common_Btn_Symbol_C">();
	}
	static class UCommon_Btn_Symbol_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommon_Btn_Symbol_C>();
	}
};
static_assert(alignof(UCommon_Btn_Symbol_C) == 0x000008, "Wrong alignment on UCommon_Btn_Symbol_C");
static_assert(sizeof(UCommon_Btn_Symbol_C) == 0x000398, "Wrong size on UCommon_Btn_Symbol_C");
static_assert(offsetof(UCommon_Btn_Symbol_C, UberGraphFrame) == 0x000378, "Member 'UCommon_Btn_Symbol_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_Symbol_C, Ani_Click) == 0x000380, "Member 'UCommon_Btn_Symbol_C::Ani_Click' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_Symbol_C, SizeSpacer) == 0x000388, "Member 'UCommon_Btn_Symbol_C::SizeSpacer' has a wrong offset!");
static_assert(offsetof(UCommon_Btn_Symbol_C, Size) == 0x000390, "Member 'UCommon_Btn_Symbol_C::Size' has a wrong offset!");

}

