#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Common_Btn_Cost

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Common_Btn_Cost.Common_Btn_Cost_C.ExecuteUbergraph_Common_Btn_Cost
// 0x0030 (0x0030 - 0x0000)
struct Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     K2Node_DynamicCast_AsHorizontal_Box_Slot;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     K2Node_DynamicCast_AsHorizontal_Box_Slot_1;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost) == 0x000008, "Wrong alignment on Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost");
static_assert(sizeof(Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost) == 0x000030, "Wrong size on Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost");
static_assert(offsetof(Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost, EntryPoint) == 0x000000, "Member 'Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost::EntryPoint' has a wrong offset!");
static_assert(offsetof(Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost, K2Node_DynamicCast_AsHorizontal_Box_Slot) == 0x000008, "Member 'Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost::K2Node_DynamicCast_AsHorizontal_Box_Slot' has a wrong offset!");
static_assert(offsetof(Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost, K2Node_Event_IsDesignTime) == 0x000011, "Member 'Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost, CallFunc_MakeVector2D_ReturnValue) == 0x000014, "Member 'Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost, K2Node_DynamicCast_AsHorizontal_Box_Slot_1) == 0x000020, "Member 'Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost::K2Node_DynamicCast_AsHorizontal_Box_Slot_1' has a wrong offset!");
static_assert(offsetof(Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'Common_Btn_Cost_C_ExecuteUbergraph_Common_Btn_Cost::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function Common_Btn_Cost.Common_Btn_Cost_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Common_Btn_Cost_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Common_Btn_Cost_C_PreConstruct) == 0x000001, "Wrong alignment on Common_Btn_Cost_C_PreConstruct");
static_assert(sizeof(Common_Btn_Cost_C_PreConstruct) == 0x000001, "Wrong size on Common_Btn_Cost_C_PreConstruct");
static_assert(offsetof(Common_Btn_Cost_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Common_Btn_Cost_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

