#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Customizing

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Customizing.Customizing_C.ExecuteUbergraph_Customizing
// 0x0098 (0x0098 - 0x0000)
struct Customizing_C_ExecuteUbergraph_Customizing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WITH_EDITOR_BP_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable;                                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMM_CostumeDyeingCheat_C*               CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShow_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPresetMode;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable_1;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bShow;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0028(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustReleased_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable_2;                                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_2;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Customizing_C_ExecuteUbergraph_Customizing) == 0x000008, "Wrong alignment on Customizing_C_ExecuteUbergraph_Customizing");
static_assert(sizeof(Customizing_C_ExecuteUbergraph_Customizing) == 0x000098, "Wrong size on Customizing_C_ExecuteUbergraph_Customizing");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, EntryPoint) == 0x000000, "Member 'Customizing_C_ExecuteUbergraph_Customizing::EntryPoint' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, CallFunc_WITH_EDITOR_BP_ReturnValue) == 0x000004, "Member 'Customizing_C_ExecuteUbergraph_Customizing::CallFunc_WITH_EDITOR_BP_ReturnValue' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, ___bool_Variable) == 0x000005, "Member 'Customizing_C_ExecuteUbergraph_Customizing::___bool_Variable' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, CallFunc_Create_ReturnValue) == 0x000008, "Member 'Customizing_C_ExecuteUbergraph_Customizing::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, K2Node_Event_bShow_1) == 0x000010, "Member 'Customizing_C_ExecuteUbergraph_Customizing::K2Node_Event_bShow_1' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, K2Node_Event_bPresetMode) == 0x000011, "Member 'Customizing_C_ExecuteUbergraph_Customizing::K2Node_Event_bPresetMode' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, CallFunc_GetEndTime_ReturnValue) == 0x000014, "Member 'Customizing_C_ExecuteUbergraph_Customizing::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, ___bool_Variable_1) == 0x000018, "Member 'Customizing_C_ExecuteUbergraph_Customizing::___bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, K2Node_Event_bShow) == 0x000019, "Member 'Customizing_C_ExecuteUbergraph_Customizing::K2Node_Event_bShow' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, K2Node_Select_Default) == 0x000020, "Member 'Customizing_C_ExecuteUbergraph_Customizing::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, K2Node_Event_MyGeometry) == 0x000028, "Member 'Customizing_C_ExecuteUbergraph_Customizing::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, K2Node_Event_InDeltaTime) == 0x000060, "Member 'Customizing_C_ExecuteUbergraph_Customizing::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, K2Node_Select_Default_1) == 0x000068, "Member 'Customizing_C_ExecuteUbergraph_Customizing::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, CallFunc_GetPlayerController_ReturnValue) == 0x000070, "Member 'Customizing_C_ExecuteUbergraph_Customizing::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, CallFunc_WasInputKeyJustReleased_ReturnValue) == 0x000078, "Member 'Customizing_C_ExecuteUbergraph_Customizing::CallFunc_WasInputKeyJustReleased_ReturnValue' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, ___bool_Variable_2) == 0x000079, "Member 'Customizing_C_ExecuteUbergraph_Customizing::___bool_Variable_2' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, K2Node_Select_Default_2) == 0x000080, "Member 'Customizing_C_ExecuteUbergraph_Customizing::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'Customizing_C_ExecuteUbergraph_Customizing::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, CallFunc_GetEndTime_ReturnValue_1) == 0x00008C, "Member 'Customizing_C_ExecuteUbergraph_Customizing::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Customizing_C_ExecuteUbergraph_Customizing, CallFunc_IsValid_ReturnValue_1) == 0x000090, "Member 'Customizing_C_ExecuteUbergraph_Customizing::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function Customizing.Customizing_C.PlayAnimTo
// 0x0018 (0x0018 - 0x0000)
struct Customizing_C_PlayAnimTo final
{
public:
	class UWidgetAnimation*                       InAnimation;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Customizing_C_PlayAnimTo) == 0x000008, "Wrong alignment on Customizing_C_PlayAnimTo");
static_assert(sizeof(Customizing_C_PlayAnimTo) == 0x000018, "Wrong size on Customizing_C_PlayAnimTo");
static_assert(offsetof(Customizing_C_PlayAnimTo, InAnimation) == 0x000000, "Member 'Customizing_C_PlayAnimTo::InAnimation' has a wrong offset!");
static_assert(offsetof(Customizing_C_PlayAnimTo, CallFunc_GetEndTime_ReturnValue) == 0x000008, "Member 'Customizing_C_PlayAnimTo::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(Customizing_C_PlayAnimTo, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000010, "Member 'Customizing_C_PlayAnimTo::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");

// Function Customizing.Customizing_C.PlayPresetShowAnimation
// 0x0001 (0x0001 - 0x0000)
struct Customizing_C_PlayPresetShowAnimation final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Customizing_C_PlayPresetShowAnimation) == 0x000001, "Wrong alignment on Customizing_C_PlayPresetShowAnimation");
static_assert(sizeof(Customizing_C_PlayPresetShowAnimation) == 0x000001, "Wrong size on Customizing_C_PlayPresetShowAnimation");
static_assert(offsetof(Customizing_C_PlayPresetShowAnimation, bShow) == 0x000000, "Member 'Customizing_C_PlayPresetShowAnimation::bShow' has a wrong offset!");

// Function Customizing.Customizing_C.MoveToCharacterSelectEvent
// 0x0001 (0x0001 - 0x0000)
struct Customizing_C_MoveToCharacterSelectEvent final
{
public:
	bool                                          bPresetMode;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Customizing_C_MoveToCharacterSelectEvent) == 0x000001, "Wrong alignment on Customizing_C_MoveToCharacterSelectEvent");
static_assert(sizeof(Customizing_C_MoveToCharacterSelectEvent) == 0x000001, "Wrong size on Customizing_C_MoveToCharacterSelectEvent");
static_assert(offsetof(Customizing_C_MoveToCharacterSelectEvent, bPresetMode) == 0x000000, "Member 'Customizing_C_MoveToCharacterSelectEvent::bPresetMode' has a wrong offset!");

// Function Customizing.Customizing_C.PlayDetailComponentShowAnimation
// 0x0001 (0x0001 - 0x0000)
struct Customizing_C_PlayDetailComponentShowAnimation final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Customizing_C_PlayDetailComponentShowAnimation) == 0x000001, "Wrong alignment on Customizing_C_PlayDetailComponentShowAnimation");
static_assert(sizeof(Customizing_C_PlayDetailComponentShowAnimation) == 0x000001, "Wrong size on Customizing_C_PlayDetailComponentShowAnimation");
static_assert(offsetof(Customizing_C_PlayDetailComponentShowAnimation, bShow) == 0x000000, "Member 'Customizing_C_PlayDetailComponentShowAnimation::bShow' has a wrong offset!");

// Function Customizing.Customizing_C.Tick
// 0x003C (0x003C - 0x0000)
struct Customizing_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Customizing_C_Tick) == 0x000004, "Wrong alignment on Customizing_C_Tick");
static_assert(sizeof(Customizing_C_Tick) == 0x00003C, "Wrong size on Customizing_C_Tick");
static_assert(offsetof(Customizing_C_Tick, MyGeometry) == 0x000000, "Member 'Customizing_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Customizing_C_Tick, InDeltaTime) == 0x000038, "Member 'Customizing_C_Tick::InDeltaTime' has a wrong offset!");

}

