#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Customizing_Slider_ControlBar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Customizing_Slider_ControlBar.Customizing_Slider_ControlBar_C.ExecuteUbergraph_Customizing_Slider_ControlBar
// 0x0018 (0x0018 - 0x0000)
struct Customizing_Slider_ControlBar_C_ExecuteUbergraph_Customizing_Slider_ControlBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_PosX;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Customizing_Slider_ControlBar_C_ExecuteUbergraph_Customizing_Slider_ControlBar) == 0x000004, "Wrong alignment on Customizing_Slider_ControlBar_C_ExecuteUbergraph_Customizing_Slider_ControlBar");
static_assert(sizeof(Customizing_Slider_ControlBar_C_ExecuteUbergraph_Customizing_Slider_ControlBar) == 0x000018, "Wrong size on Customizing_Slider_ControlBar_C_ExecuteUbergraph_Customizing_Slider_ControlBar");
static_assert(offsetof(Customizing_Slider_ControlBar_C_ExecuteUbergraph_Customizing_Slider_ControlBar, EntryPoint) == 0x000000, "Member 'Customizing_Slider_ControlBar_C_ExecuteUbergraph_Customizing_Slider_ControlBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(Customizing_Slider_ControlBar_C_ExecuteUbergraph_Customizing_Slider_ControlBar, K2Node_Event_PosX) == 0x000004, "Member 'Customizing_Slider_ControlBar_C_ExecuteUbergraph_Customizing_Slider_ControlBar::K2Node_Event_PosX' has a wrong offset!");
static_assert(offsetof(Customizing_Slider_ControlBar_C_ExecuteUbergraph_Customizing_Slider_ControlBar, CallFunc_MakeVector2D_ReturnValue) == 0x000008, "Member 'Customizing_Slider_ControlBar_C_ExecuteUbergraph_Customizing_Slider_ControlBar::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Customizing_Slider_ControlBar_C_ExecuteUbergraph_Customizing_Slider_ControlBar, K2Node_ComponentBoundEvent_Value) == 0x000010, "Member 'Customizing_Slider_ControlBar_C_ExecuteUbergraph_Customizing_Slider_ControlBar::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(Customizing_Slider_ControlBar_C_ExecuteUbergraph_Customizing_Slider_ControlBar, K2Node_CustomEvent_Value) == 0x000014, "Member 'Customizing_Slider_ControlBar_C_ExecuteUbergraph_Customizing_Slider_ControlBar::K2Node_CustomEvent_Value' has a wrong offset!");

// Function Customizing_Slider_ControlBar.Customizing_Slider_ControlBar_C.BndEvt__ValueSlide_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Customizing_Slider_ControlBar_C_BndEvt__ValueSlide_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Customizing_Slider_ControlBar_C_BndEvt__ValueSlide_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on Customizing_Slider_ControlBar_C_BndEvt__ValueSlide_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(Customizing_Slider_ControlBar_C_BndEvt__ValueSlide_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on Customizing_Slider_ControlBar_C_BndEvt__ValueSlide_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(Customizing_Slider_ControlBar_C_BndEvt__ValueSlide_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'Customizing_Slider_ControlBar_C_BndEvt__ValueSlide_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function Customizing_Slider_ControlBar.Customizing_Slider_ControlBar_C.SetSliderValue
// 0x0004 (0x0004 - 0x0000)
struct Customizing_Slider_ControlBar_C_SetSliderValue final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Customizing_Slider_ControlBar_C_SetSliderValue) == 0x000004, "Wrong alignment on Customizing_Slider_ControlBar_C_SetSliderValue");
static_assert(sizeof(Customizing_Slider_ControlBar_C_SetSliderValue) == 0x000004, "Wrong size on Customizing_Slider_ControlBar_C_SetSliderValue");
static_assert(offsetof(Customizing_Slider_ControlBar_C_SetSliderValue, Value) == 0x000000, "Member 'Customizing_Slider_ControlBar_C_SetSliderValue::Value' has a wrong offset!");

// Function Customizing_Slider_ControlBar.Customizing_Slider_ControlBar_C.SetControlSlider
// 0x0004 (0x0004 - 0x0000)
struct Customizing_Slider_ControlBar_C_SetControlSlider final
{
public:
	float                                         PosX;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Customizing_Slider_ControlBar_C_SetControlSlider) == 0x000004, "Wrong alignment on Customizing_Slider_ControlBar_C_SetControlSlider");
static_assert(sizeof(Customizing_Slider_ControlBar_C_SetControlSlider) == 0x000004, "Wrong size on Customizing_Slider_ControlBar_C_SetControlSlider");
static_assert(offsetof(Customizing_Slider_ControlBar_C_SetControlSlider, PosX) == 0x000000, "Member 'Customizing_Slider_ControlBar_C_SetControlSlider::PosX' has a wrong offset!");

// Function Customizing_Slider_ControlBar.Customizing_Slider_ControlBar_C.ChangeValueEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Customizing_Slider_ControlBar_C_ChangeValueEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Customizing_Slider_ControlBar_C_ChangeValueEvent__DelegateSignature) == 0x000004, "Wrong alignment on Customizing_Slider_ControlBar_C_ChangeValueEvent__DelegateSignature");
static_assert(sizeof(Customizing_Slider_ControlBar_C_ChangeValueEvent__DelegateSignature) == 0x000004, "Wrong size on Customizing_Slider_ControlBar_C_ChangeValueEvent__DelegateSignature");
static_assert(offsetof(Customizing_Slider_ControlBar_C_ChangeValueEvent__DelegateSignature, Value) == 0x000000, "Member 'Customizing_Slider_ControlBar_C_ChangeValueEvent__DelegateSignature::Value' has a wrong offset!");

}

