#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Customizing

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MirMobile_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Customizing.Customizing_C
// 0x00C0 (0x0550 - 0x0490)
class UCustomizing_C final : public UMM_Customizing
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SaveLoadShow;                                      // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SaveLoadHide;                                      // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DetailComponentShow;                               // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DetailComponentHide;                               // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ButtonHide;                                        // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ButtonShow;                                        // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DetailControlHide;                                 // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DetailControlShow;                                 // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PresetHide;                                        // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PresetShow;                                        // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Btn_StyleBook;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                C_SaveLoadButton;                                  // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_3;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_4;                                     // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_5;                                     // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizing_CreatePopup_C*             Customizing_CreatePopup;                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomizing_Preset_C*                  Customizing_Preset_2;                              // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HideUIButton;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirImage*                              MirImage_134;                                      // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TempProcess;                                       // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMM_CostumeDyeingCheat_C*               TestWidget;                                        // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Customizing(int32 EntryPoint);
	void PlayAnimTo(class UWidgetAnimation* InAnimation);
	void PlayPresetShowAnimation(bool bShow);
	void PlayOpenCustomizingAnimation();
	void OnClickMoveToClassSelectEvent();
	void MoveToCharacterSelectEvent(bool bPresetMode);
	void PlayDetailComponentShowAnimation(bool bShow);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Destruct();
	void BndEvt__Btn_StyleBook_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Customizing_C">();
	}
	static class UCustomizing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizing_C>();
	}
};
static_assert(alignof(UCustomizing_C) == 0x000008, "Wrong alignment on UCustomizing_C");
static_assert(sizeof(UCustomizing_C) == 0x000550, "Wrong size on UCustomizing_C");
static_assert(offsetof(UCustomizing_C, UberGraphFrame) == 0x000490, "Member 'UCustomizing_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, SaveLoadShow) == 0x000498, "Member 'UCustomizing_C::SaveLoadShow' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, SaveLoadHide) == 0x0004A0, "Member 'UCustomizing_C::SaveLoadHide' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, DetailComponentShow) == 0x0004A8, "Member 'UCustomizing_C::DetailComponentShow' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, DetailComponentHide) == 0x0004B0, "Member 'UCustomizing_C::DetailComponentHide' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, ButtonHide) == 0x0004B8, "Member 'UCustomizing_C::ButtonHide' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, ButtonShow) == 0x0004C0, "Member 'UCustomizing_C::ButtonShow' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, DetailControlHide) == 0x0004C8, "Member 'UCustomizing_C::DetailControlHide' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, DetailControlShow) == 0x0004D0, "Member 'UCustomizing_C::DetailControlShow' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, PresetHide) == 0x0004D8, "Member 'UCustomizing_C::PresetHide' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, PresetShow) == 0x0004E0, "Member 'UCustomizing_C::PresetShow' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, Btn_StyleBook) == 0x0004E8, "Member 'UCustomizing_C::Btn_StyleBook' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, C_SaveLoadButton) == 0x0004F0, "Member 'UCustomizing_C::C_SaveLoadButton' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, CanvasPanel) == 0x0004F8, "Member 'UCustomizing_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, CanvasPanel_3) == 0x000500, "Member 'UCustomizing_C::CanvasPanel_3' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, CanvasPanel_4) == 0x000508, "Member 'UCustomizing_C::CanvasPanel_4' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, CanvasPanel_5) == 0x000510, "Member 'UCustomizing_C::CanvasPanel_5' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, Customizing_CreatePopup) == 0x000518, "Member 'UCustomizing_C::Customizing_CreatePopup' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, Customizing_Preset_2) == 0x000520, "Member 'UCustomizing_C::Customizing_Preset_2' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, HideUIButton) == 0x000528, "Member 'UCustomizing_C::HideUIButton' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, MirImage_134) == 0x000530, "Member 'UCustomizing_C::MirImage_134' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, SafeZone_0) == 0x000538, "Member 'UCustomizing_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, TempProcess) == 0x000540, "Member 'UCustomizing_C::TempProcess' has a wrong offset!");
static_assert(offsetof(UCustomizing_C, TestWidget) == 0x000548, "Member 'UCustomizing_C::TestWidget' has a wrong offset!");

}

