#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Customizing_Slider_ControlBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MirMobile_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Customizing_Slider_ControlBar.Customizing_Slider_ControlBar_C
// 0x0060 (0x0400 - 0x03A0)
class UCustomizing_Slider_ControlBar_C final : public UMM_Customizing_Slider_ControlBar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMirImage*                              MirImage_0;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirImage*                              Slider_Bg;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirImage*                              Slider_Bg_02;                                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Drag_C*                             UI_Drag;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirSlider*                             ValueSlider;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastInlineDelegateProperty_             CaptureEndEvent;                                   // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastInlineDelegateProperty_             ChangeValueEvent;                                  // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastInlineDelegateProperty_             ResetEvent;                                        // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_Customizing_Slider_ControlBar(int32 EntryPoint);
	void BndEvt__ValueSlide_K2Node_ComponentBoundEvent_1_OnMouseCaptureEndEvent__DelegateSignature();
	void BndEvt__ValueSlide_K2Node_ComponentBoundEvent_4_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void SetSliderValue(float Value);
	void SetControlSlider(float PosX);
	void ResetEvent__DelegateSignature();
	void ChangeValueEvent__DelegateSignature(float Value);
	void CaptureEndEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Customizing_Slider_ControlBar_C">();
	}
	static class UCustomizing_Slider_ControlBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizing_Slider_ControlBar_C>();
	}
};
static_assert(alignof(UCustomizing_Slider_ControlBar_C) == 0x000008, "Wrong alignment on UCustomizing_Slider_ControlBar_C");
static_assert(sizeof(UCustomizing_Slider_ControlBar_C) == 0x000400, "Wrong size on UCustomizing_Slider_ControlBar_C");
static_assert(offsetof(UCustomizing_Slider_ControlBar_C, UberGraphFrame) == 0x0003A0, "Member 'UCustomizing_Slider_ControlBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCustomizing_Slider_ControlBar_C, MirImage_0) == 0x0003A8, "Member 'UCustomizing_Slider_ControlBar_C::MirImage_0' has a wrong offset!");
static_assert(offsetof(UCustomizing_Slider_ControlBar_C, Slider_Bg) == 0x0003B0, "Member 'UCustomizing_Slider_ControlBar_C::Slider_Bg' has a wrong offset!");
static_assert(offsetof(UCustomizing_Slider_ControlBar_C, Slider_Bg_02) == 0x0003B8, "Member 'UCustomizing_Slider_ControlBar_C::Slider_Bg_02' has a wrong offset!");
static_assert(offsetof(UCustomizing_Slider_ControlBar_C, UI_Drag) == 0x0003C0, "Member 'UCustomizing_Slider_ControlBar_C::UI_Drag' has a wrong offset!");
static_assert(offsetof(UCustomizing_Slider_ControlBar_C, ValueSlider) == 0x0003C8, "Member 'UCustomizing_Slider_ControlBar_C::ValueSlider' has a wrong offset!");
static_assert(offsetof(UCustomizing_Slider_ControlBar_C, CaptureEndEvent) == 0x0003D0, "Member 'UCustomizing_Slider_ControlBar_C::CaptureEndEvent' has a wrong offset!");
static_assert(offsetof(UCustomizing_Slider_ControlBar_C, ChangeValueEvent) == 0x0003E0, "Member 'UCustomizing_Slider_ControlBar_C::ChangeValueEvent' has a wrong offset!");
static_assert(offsetof(UCustomizing_Slider_ControlBar_C, ResetEvent) == 0x0003F0, "Member 'UCustomizing_Slider_ControlBar_C::ResetEvent' has a wrong offset!");

}

