#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Customizing_CreatePopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MirMobile_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Customizing_CreatePopup.Customizing_CreatePopup_C
// 0x0058 (0x0360 - 0x0308)
class UCustomizing_CreatePopup_C final : public UMM_Customizing_CreatePopup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_end;                                           // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_start;                                         // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UMirImage*                              BG;                                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMirImage*                              MirImage_29;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RandomButton;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Customizing_CreatePopup(int32 EntryPoint);
	void PlayOpenAnim();
	void PlayCloseAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Customizing_CreatePopup_C">();
	}
	static class UCustomizing_CreatePopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizing_CreatePopup_C>();
	}
};
static_assert(alignof(UCustomizing_CreatePopup_C) == 0x000008, "Wrong alignment on UCustomizing_CreatePopup_C");
static_assert(sizeof(UCustomizing_CreatePopup_C) == 0x000360, "Wrong size on UCustomizing_CreatePopup_C");
static_assert(offsetof(UCustomizing_CreatePopup_C, UberGraphFrame) == 0x000308, "Member 'UCustomizing_CreatePopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCustomizing_CreatePopup_C, Ani_end) == 0x000310, "Member 'UCustomizing_CreatePopup_C::Ani_end' has a wrong offset!");
static_assert(offsetof(UCustomizing_CreatePopup_C, Ani_start) == 0x000318, "Member 'UCustomizing_CreatePopup_C::Ani_start' has a wrong offset!");
static_assert(offsetof(UCustomizing_CreatePopup_C, BG) == 0x000320, "Member 'UCustomizing_CreatePopup_C::BG' has a wrong offset!");
static_assert(offsetof(UCustomizing_CreatePopup_C, Image) == 0x000328, "Member 'UCustomizing_CreatePopup_C::Image' has a wrong offset!");
static_assert(offsetof(UCustomizing_CreatePopup_C, Image_1) == 0x000330, "Member 'UCustomizing_CreatePopup_C::Image_1' has a wrong offset!");
static_assert(offsetof(UCustomizing_CreatePopup_C, Image_2) == 0x000338, "Member 'UCustomizing_CreatePopup_C::Image_2' has a wrong offset!");
static_assert(offsetof(UCustomizing_CreatePopup_C, Image_7) == 0x000340, "Member 'UCustomizing_CreatePopup_C::Image_7' has a wrong offset!");
static_assert(offsetof(UCustomizing_CreatePopup_C, MirImage_29) == 0x000348, "Member 'UCustomizing_CreatePopup_C::MirImage_29' has a wrong offset!");
static_assert(offsetof(UCustomizing_CreatePopup_C, RandomButton) == 0x000350, "Member 'UCustomizing_CreatePopup_C::RandomButton' has a wrong offset!");
static_assert(offsetof(UCustomizing_CreatePopup_C, SafeZone_0) == 0x000358, "Member 'UCustomizing_CreatePopup_C::SafeZone_0' has a wrong offset!");

}

