#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EasyFirebase

#include "Basic.hpp"

#include "EasyFirebase_structs.hpp"


namespace SDK::Params
{

// Function EasyFirebase.FirebaseAppleCredential.RequestAppleCredential
// 0x0008 (0x0008 - 0x0000)
struct FirebaseAppleCredential_RequestAppleCredential final
{
public:
	class UFirebaseAppleCredential*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAppleCredential_RequestAppleCredential) == 0x000008, "Wrong alignment on FirebaseAppleCredential_RequestAppleCredential");
static_assert(sizeof(FirebaseAppleCredential_RequestAppleCredential) == 0x000008, "Wrong size on FirebaseAppleCredential_RequestAppleCredential");
static_assert(offsetof(FirebaseAppleCredential_RequestAppleCredential, ReturnValue) == 0x000000, "Member 'FirebaseAppleCredential_RequestAppleCredential::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.GetFirebaseAuth
// 0x0008 (0x0008 - 0x0000)
struct FirebaseAuth_GetFirebaseAuth final
{
public:
	class UFirebaseAuth*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_GetFirebaseAuth) == 0x000008, "Wrong alignment on FirebaseAuth_GetFirebaseAuth");
static_assert(sizeof(FirebaseAuth_GetFirebaseAuth) == 0x000008, "Wrong size on FirebaseAuth_GetFirebaseAuth");
static_assert(offsetof(FirebaseAuth_GetFirebaseAuth, ReturnValue) == 0x000000, "Member 'FirebaseAuth_GetFirebaseAuth::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.AddAuthStateListener
// 0x0008 (0x0008 - 0x0000)
struct FirebaseAuth_AddAuthStateListener final
{
public:
	class UFirebaseAuthStateListener*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_AddAuthStateListener) == 0x000008, "Wrong alignment on FirebaseAuth_AddAuthStateListener");
static_assert(sizeof(FirebaseAuth_AddAuthStateListener) == 0x000008, "Wrong size on FirebaseAuth_AddAuthStateListener");
static_assert(offsetof(FirebaseAuth_AddAuthStateListener, ReturnValue) == 0x000000, "Member 'FirebaseAuth_AddAuthStateListener::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.CreateUserWithEmailAndPassword
// 0x0028 (0x0028 - 0x0000)
struct FirebaseAuth_CreateUserWithEmailAndPassword final
{
public:
	class FString                                 Email;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Passwd;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseFutureUser*                    ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_CreateUserWithEmailAndPassword) == 0x000008, "Wrong alignment on FirebaseAuth_CreateUserWithEmailAndPassword");
static_assert(sizeof(FirebaseAuth_CreateUserWithEmailAndPassword) == 0x000028, "Wrong size on FirebaseAuth_CreateUserWithEmailAndPassword");
static_assert(offsetof(FirebaseAuth_CreateUserWithEmailAndPassword, Email) == 0x000000, "Member 'FirebaseAuth_CreateUserWithEmailAndPassword::Email' has a wrong offset!");
static_assert(offsetof(FirebaseAuth_CreateUserWithEmailAndPassword, Passwd) == 0x000010, "Member 'FirebaseAuth_CreateUserWithEmailAndPassword::Passwd' has a wrong offset!");
static_assert(offsetof(FirebaseAuth_CreateUserWithEmailAndPassword, ReturnValue) == 0x000020, "Member 'FirebaseAuth_CreateUserWithEmailAndPassword::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.CreateUserWithEmailAndPasswordLastResult
// 0x0008 (0x0008 - 0x0000)
struct FirebaseAuth_CreateUserWithEmailAndPasswordLastResult final
{
public:
	class UFirebaseFutureUser*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_CreateUserWithEmailAndPasswordLastResult) == 0x000008, "Wrong alignment on FirebaseAuth_CreateUserWithEmailAndPasswordLastResult");
static_assert(sizeof(FirebaseAuth_CreateUserWithEmailAndPasswordLastResult) == 0x000008, "Wrong size on FirebaseAuth_CreateUserWithEmailAndPasswordLastResult");
static_assert(offsetof(FirebaseAuth_CreateUserWithEmailAndPasswordLastResult, ReturnValue) == 0x000000, "Member 'FirebaseAuth_CreateUserWithEmailAndPasswordLastResult::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.current_user
// 0x0008 (0x0008 - 0x0000)
struct FirebaseAuth_Current_user final
{
public:
	class UFirebaseUser*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_Current_user) == 0x000008, "Wrong alignment on FirebaseAuth_Current_user");
static_assert(sizeof(FirebaseAuth_Current_user) == 0x000008, "Wrong size on FirebaseAuth_Current_user");
static_assert(offsetof(FirebaseAuth_Current_user, ReturnValue) == 0x000000, "Member 'FirebaseAuth_Current_user::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.FetchProvidersForEmail
// 0x0018 (0x0018 - 0x0000)
struct FirebaseAuth_FetchProvidersForEmail final
{
public:
	class FString                                 Email;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseFutureFetchProvideResult*      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_FetchProvidersForEmail) == 0x000008, "Wrong alignment on FirebaseAuth_FetchProvidersForEmail");
static_assert(sizeof(FirebaseAuth_FetchProvidersForEmail) == 0x000018, "Wrong size on FirebaseAuth_FetchProvidersForEmail");
static_assert(offsetof(FirebaseAuth_FetchProvidersForEmail, Email) == 0x000000, "Member 'FirebaseAuth_FetchProvidersForEmail::Email' has a wrong offset!");
static_assert(offsetof(FirebaseAuth_FetchProvidersForEmail, ReturnValue) == 0x000010, "Member 'FirebaseAuth_FetchProvidersForEmail::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.FetchProvidersForEmailLastResult
// 0x0008 (0x0008 - 0x0000)
struct FirebaseAuth_FetchProvidersForEmailLastResult final
{
public:
	class UFirebaseFutureFetchProvideResult*      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_FetchProvidersForEmailLastResult) == 0x000008, "Wrong alignment on FirebaseAuth_FetchProvidersForEmailLastResult");
static_assert(sizeof(FirebaseAuth_FetchProvidersForEmailLastResult) == 0x000008, "Wrong size on FirebaseAuth_FetchProvidersForEmailLastResult");
static_assert(offsetof(FirebaseAuth_FetchProvidersForEmailLastResult, ReturnValue) == 0x000000, "Member 'FirebaseAuth_FetchProvidersForEmailLastResult::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.GetPlayServiceCredential
// 0x0018 (0x0018 - 0x0000)
struct FirebaseAuth_GetPlayServiceCredential final
{
public:
	class FString                                 ServerAuthCode;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseCredential*                    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_GetPlayServiceCredential) == 0x000008, "Wrong alignment on FirebaseAuth_GetPlayServiceCredential");
static_assert(sizeof(FirebaseAuth_GetPlayServiceCredential) == 0x000018, "Wrong size on FirebaseAuth_GetPlayServiceCredential");
static_assert(offsetof(FirebaseAuth_GetPlayServiceCredential, ServerAuthCode) == 0x000000, "Member 'FirebaseAuth_GetPlayServiceCredential::ServerAuthCode' has a wrong offset!");
static_assert(offsetof(FirebaseAuth_GetPlayServiceCredential, ReturnValue) == 0x000010, "Member 'FirebaseAuth_GetPlayServiceCredential::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.RemoveAuthStateListener
// 0x0008 (0x0008 - 0x0000)
struct FirebaseAuth_RemoveAuthStateListener final
{
public:
	class UFirebaseAuthStateListener*             Listener;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_RemoveAuthStateListener) == 0x000008, "Wrong alignment on FirebaseAuth_RemoveAuthStateListener");
static_assert(sizeof(FirebaseAuth_RemoveAuthStateListener) == 0x000008, "Wrong size on FirebaseAuth_RemoveAuthStateListener");
static_assert(offsetof(FirebaseAuth_RemoveAuthStateListener, Listener) == 0x000000, "Member 'FirebaseAuth_RemoveAuthStateListener::Listener' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.SendPasswordResetEmail
// 0x0018 (0x0018 - 0x0000)
struct FirebaseAuth_SendPasswordResetEmail final
{
public:
	class FString                                 Email;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseFutureVoid*                    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_SendPasswordResetEmail) == 0x000008, "Wrong alignment on FirebaseAuth_SendPasswordResetEmail");
static_assert(sizeof(FirebaseAuth_SendPasswordResetEmail) == 0x000018, "Wrong size on FirebaseAuth_SendPasswordResetEmail");
static_assert(offsetof(FirebaseAuth_SendPasswordResetEmail, Email) == 0x000000, "Member 'FirebaseAuth_SendPasswordResetEmail::Email' has a wrong offset!");
static_assert(offsetof(FirebaseAuth_SendPasswordResetEmail, ReturnValue) == 0x000010, "Member 'FirebaseAuth_SendPasswordResetEmail::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.SendPasswordResetEmailLastResult
// 0x0008 (0x0008 - 0x0000)
struct FirebaseAuth_SendPasswordResetEmailLastResult final
{
public:
	class UFirebaseFutureVoid*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_SendPasswordResetEmailLastResult) == 0x000008, "Wrong alignment on FirebaseAuth_SendPasswordResetEmailLastResult");
static_assert(sizeof(FirebaseAuth_SendPasswordResetEmailLastResult) == 0x000008, "Wrong size on FirebaseAuth_SendPasswordResetEmailLastResult");
static_assert(offsetof(FirebaseAuth_SendPasswordResetEmailLastResult, ReturnValue) == 0x000000, "Member 'FirebaseAuth_SendPasswordResetEmailLastResult::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.SignInAndRetrieveDataWithCredential
// 0x0010 (0x0010 - 0x0000)
struct FirebaseAuth_SignInAndRetrieveDataWithCredential final
{
public:
	class UFirebaseCredential*                    Credential;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseFutureSignInResult*            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_SignInAndRetrieveDataWithCredential) == 0x000008, "Wrong alignment on FirebaseAuth_SignInAndRetrieveDataWithCredential");
static_assert(sizeof(FirebaseAuth_SignInAndRetrieveDataWithCredential) == 0x000010, "Wrong size on FirebaseAuth_SignInAndRetrieveDataWithCredential");
static_assert(offsetof(FirebaseAuth_SignInAndRetrieveDataWithCredential, Credential) == 0x000000, "Member 'FirebaseAuth_SignInAndRetrieveDataWithCredential::Credential' has a wrong offset!");
static_assert(offsetof(FirebaseAuth_SignInAndRetrieveDataWithCredential, ReturnValue) == 0x000008, "Member 'FirebaseAuth_SignInAndRetrieveDataWithCredential::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.SignInAndRetrieveDataWithCredentialLastResult
// 0x0008 (0x0008 - 0x0000)
struct FirebaseAuth_SignInAndRetrieveDataWithCredentialLastResult final
{
public:
	class UFirebaseFutureSignInResult*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_SignInAndRetrieveDataWithCredentialLastResult) == 0x000008, "Wrong alignment on FirebaseAuth_SignInAndRetrieveDataWithCredentialLastResult");
static_assert(sizeof(FirebaseAuth_SignInAndRetrieveDataWithCredentialLastResult) == 0x000008, "Wrong size on FirebaseAuth_SignInAndRetrieveDataWithCredentialLastResult");
static_assert(offsetof(FirebaseAuth_SignInAndRetrieveDataWithCredentialLastResult, ReturnValue) == 0x000000, "Member 'FirebaseAuth_SignInAndRetrieveDataWithCredentialLastResult::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.SignInAnonymously
// 0x0008 (0x0008 - 0x0000)
struct FirebaseAuth_SignInAnonymously final
{
public:
	class UFirebaseFutureUser*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_SignInAnonymously) == 0x000008, "Wrong alignment on FirebaseAuth_SignInAnonymously");
static_assert(sizeof(FirebaseAuth_SignInAnonymously) == 0x000008, "Wrong size on FirebaseAuth_SignInAnonymously");
static_assert(offsetof(FirebaseAuth_SignInAnonymously, ReturnValue) == 0x000000, "Member 'FirebaseAuth_SignInAnonymously::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.SignInWithCredential
// 0x0010 (0x0010 - 0x0000)
struct FirebaseAuth_SignInWithCredential final
{
public:
	class UFirebaseCredential*                    Credential;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseFutureUser*                    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_SignInWithCredential) == 0x000008, "Wrong alignment on FirebaseAuth_SignInWithCredential");
static_assert(sizeof(FirebaseAuth_SignInWithCredential) == 0x000010, "Wrong size on FirebaseAuth_SignInWithCredential");
static_assert(offsetof(FirebaseAuth_SignInWithCredential, Credential) == 0x000000, "Member 'FirebaseAuth_SignInWithCredential::Credential' has a wrong offset!");
static_assert(offsetof(FirebaseAuth_SignInWithCredential, ReturnValue) == 0x000008, "Member 'FirebaseAuth_SignInWithCredential::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.SignInWithCredentialLastResult
// 0x0008 (0x0008 - 0x0000)
struct FirebaseAuth_SignInWithCredentialLastResult final
{
public:
	class UFirebaseFutureUser*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_SignInWithCredentialLastResult) == 0x000008, "Wrong alignment on FirebaseAuth_SignInWithCredentialLastResult");
static_assert(sizeof(FirebaseAuth_SignInWithCredentialLastResult) == 0x000008, "Wrong size on FirebaseAuth_SignInWithCredentialLastResult");
static_assert(offsetof(FirebaseAuth_SignInWithCredentialLastResult, ReturnValue) == 0x000000, "Member 'FirebaseAuth_SignInWithCredentialLastResult::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.SignInWithCustomToken
// 0x0018 (0x0018 - 0x0000)
struct FirebaseAuth_SignInWithCustomToken final
{
public:
	class FString                                 Token;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseFutureUser*                    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_SignInWithCustomToken) == 0x000008, "Wrong alignment on FirebaseAuth_SignInWithCustomToken");
static_assert(sizeof(FirebaseAuth_SignInWithCustomToken) == 0x000018, "Wrong size on FirebaseAuth_SignInWithCustomToken");
static_assert(offsetof(FirebaseAuth_SignInWithCustomToken, Token) == 0x000000, "Member 'FirebaseAuth_SignInWithCustomToken::Token' has a wrong offset!");
static_assert(offsetof(FirebaseAuth_SignInWithCustomToken, ReturnValue) == 0x000010, "Member 'FirebaseAuth_SignInWithCustomToken::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.SignInWithCustomTokenLastResult
// 0x0008 (0x0008 - 0x0000)
struct FirebaseAuth_SignInWithCustomTokenLastResult final
{
public:
	class UFirebaseFutureUser*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_SignInWithCustomTokenLastResult) == 0x000008, "Wrong alignment on FirebaseAuth_SignInWithCustomTokenLastResult");
static_assert(sizeof(FirebaseAuth_SignInWithCustomTokenLastResult) == 0x000008, "Wrong size on FirebaseAuth_SignInWithCustomTokenLastResult");
static_assert(offsetof(FirebaseAuth_SignInWithCustomTokenLastResult, ReturnValue) == 0x000000, "Member 'FirebaseAuth_SignInWithCustomTokenLastResult::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.SignInWithEmailAndPassword
// 0x0028 (0x0028 - 0x0000)
struct FirebaseAuth_SignInWithEmailAndPassword final
{
public:
	class FString                                 Email;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Passwd;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseFutureUser*                    ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_SignInWithEmailAndPassword) == 0x000008, "Wrong alignment on FirebaseAuth_SignInWithEmailAndPassword");
static_assert(sizeof(FirebaseAuth_SignInWithEmailAndPassword) == 0x000028, "Wrong size on FirebaseAuth_SignInWithEmailAndPassword");
static_assert(offsetof(FirebaseAuth_SignInWithEmailAndPassword, Email) == 0x000000, "Member 'FirebaseAuth_SignInWithEmailAndPassword::Email' has a wrong offset!");
static_assert(offsetof(FirebaseAuth_SignInWithEmailAndPassword, Passwd) == 0x000010, "Member 'FirebaseAuth_SignInWithEmailAndPassword::Passwd' has a wrong offset!");
static_assert(offsetof(FirebaseAuth_SignInWithEmailAndPassword, ReturnValue) == 0x000020, "Member 'FirebaseAuth_SignInWithEmailAndPassword::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuth.SignInWithEmailAndPasswordLastResult
// 0x0008 (0x0008 - 0x0000)
struct FirebaseAuth_SignInWithEmailAndPasswordLastResult final
{
public:
	class UFirebaseFutureUser*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuth_SignInWithEmailAndPasswordLastResult) == 0x000008, "Wrong alignment on FirebaseAuth_SignInWithEmailAndPasswordLastResult");
static_assert(sizeof(FirebaseAuth_SignInWithEmailAndPasswordLastResult) == 0x000008, "Wrong size on FirebaseAuth_SignInWithEmailAndPasswordLastResult");
static_assert(offsetof(FirebaseAuth_SignInWithEmailAndPasswordLastResult, ReturnValue) == 0x000000, "Member 'FirebaseAuth_SignInWithEmailAndPasswordLastResult::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseAuthStateListener.RunValueListener
// 0x0010 (0x0010 - 0x0000)
struct FirebaseAuthStateListener_RunValueListener final
{
public:
	class UFirebaseAuthStateListener*             Listener;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseAuthStateListener*             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseAuthStateListener_RunValueListener) == 0x000008, "Wrong alignment on FirebaseAuthStateListener_RunValueListener");
static_assert(sizeof(FirebaseAuthStateListener_RunValueListener) == 0x000010, "Wrong size on FirebaseAuthStateListener_RunValueListener");
static_assert(offsetof(FirebaseAuthStateListener_RunValueListener, Listener) == 0x000000, "Member 'FirebaseAuthStateListener_RunValueListener::Listener' has a wrong offset!");
static_assert(offsetof(FirebaseAuthStateListener_RunValueListener, ReturnValue) == 0x000008, "Member 'FirebaseAuthStateListener_RunValueListener::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseChildListener.RunChildListener
// 0x0010 (0x0010 - 0x0000)
struct FirebaseChildListener_RunChildListener final
{
public:
	class UFirebaseChildListener*                 Listener;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseChildListener*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseChildListener_RunChildListener) == 0x000008, "Wrong alignment on FirebaseChildListener_RunChildListener");
static_assert(sizeof(FirebaseChildListener_RunChildListener) == 0x000010, "Wrong size on FirebaseChildListener_RunChildListener");
static_assert(offsetof(FirebaseChildListener_RunChildListener, Listener) == 0x000000, "Member 'FirebaseChildListener_RunChildListener::Listener' has a wrong offset!");
static_assert(offsetof(FirebaseChildListener_RunChildListener, ReturnValue) == 0x000008, "Member 'FirebaseChildListener_RunChildListener::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseCredential.is_valid
// 0x0001 (0x0001 - 0x0000)
struct FirebaseCredential_Is_valid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseCredential_Is_valid) == 0x000001, "Wrong alignment on FirebaseCredential_Is_valid");
static_assert(sizeof(FirebaseCredential_Is_valid) == 0x000001, "Wrong size on FirebaseCredential_Is_valid");
static_assert(offsetof(FirebaseCredential_Is_valid, ReturnValue) == 0x000000, "Member 'FirebaseCredential_Is_valid::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseCredential.provider
// 0x0010 (0x0010 - 0x0000)
struct FirebaseCredential_Provider final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseCredential_Provider) == 0x000008, "Wrong alignment on FirebaseCredential_Provider");
static_assert(sizeof(FirebaseCredential_Provider) == 0x000010, "Wrong size on FirebaseCredential_Provider");
static_assert(offsetof(FirebaseCredential_Provider, ReturnValue) == 0x000000, "Member 'FirebaseCredential_Provider::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.AddChildListener
// 0x0008 (0x0008 - 0x0000)
struct FirebaseQuery_AddChildListener final
{
public:
	class UFirebaseChildListener*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_AddChildListener) == 0x000008, "Wrong alignment on FirebaseQuery_AddChildListener");
static_assert(sizeof(FirebaseQuery_AddChildListener) == 0x000008, "Wrong size on FirebaseQuery_AddChildListener");
static_assert(offsetof(FirebaseQuery_AddChildListener, ReturnValue) == 0x000000, "Member 'FirebaseQuery_AddChildListener::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.AddValueListener
// 0x0008 (0x0008 - 0x0000)
struct FirebaseQuery_AddValueListener final
{
public:
	class UFirebaseValueListener*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_AddValueListener) == 0x000008, "Wrong alignment on FirebaseQuery_AddValueListener");
static_assert(sizeof(FirebaseQuery_AddValueListener) == 0x000008, "Wrong size on FirebaseQuery_AddValueListener");
static_assert(offsetof(FirebaseQuery_AddValueListener, ReturnValue) == 0x000000, "Member 'FirebaseQuery_AddValueListener::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.EndAt
// 0x0010 (0x0010 - 0x0000)
struct FirebaseQuery_EndAt final
{
public:
	class UFirebaseVariant*                       OrderValue;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseQuery*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_EndAt) == 0x000008, "Wrong alignment on FirebaseQuery_EndAt");
static_assert(sizeof(FirebaseQuery_EndAt) == 0x000010, "Wrong size on FirebaseQuery_EndAt");
static_assert(offsetof(FirebaseQuery_EndAt, OrderValue) == 0x000000, "Member 'FirebaseQuery_EndAt::OrderValue' has a wrong offset!");
static_assert(offsetof(FirebaseQuery_EndAt, ReturnValue) == 0x000008, "Member 'FirebaseQuery_EndAt::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.EndWithKeyAt
// 0x0020 (0x0020 - 0x0000)
struct FirebaseQuery_EndWithKeyAt final
{
public:
	class UFirebaseVariant*                       OrderValue;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseQuery*                         ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_EndWithKeyAt) == 0x000008, "Wrong alignment on FirebaseQuery_EndWithKeyAt");
static_assert(sizeof(FirebaseQuery_EndWithKeyAt) == 0x000020, "Wrong size on FirebaseQuery_EndWithKeyAt");
static_assert(offsetof(FirebaseQuery_EndWithKeyAt, OrderValue) == 0x000000, "Member 'FirebaseQuery_EndWithKeyAt::OrderValue' has a wrong offset!");
static_assert(offsetof(FirebaseQuery_EndWithKeyAt, Key) == 0x000008, "Member 'FirebaseQuery_EndWithKeyAt::Key' has a wrong offset!");
static_assert(offsetof(FirebaseQuery_EndWithKeyAt, ReturnValue) == 0x000018, "Member 'FirebaseQuery_EndWithKeyAt::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.EqualTo
// 0x0010 (0x0010 - 0x0000)
struct FirebaseQuery_EqualTo final
{
public:
	class UFirebaseVariant*                       OrderValue;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseQuery*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_EqualTo) == 0x000008, "Wrong alignment on FirebaseQuery_EqualTo");
static_assert(sizeof(FirebaseQuery_EqualTo) == 0x000010, "Wrong size on FirebaseQuery_EqualTo");
static_assert(offsetof(FirebaseQuery_EqualTo, OrderValue) == 0x000000, "Member 'FirebaseQuery_EqualTo::OrderValue' has a wrong offset!");
static_assert(offsetof(FirebaseQuery_EqualTo, ReturnValue) == 0x000008, "Member 'FirebaseQuery_EqualTo::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.EqualWithKeyTo
// 0x0020 (0x0020 - 0x0000)
struct FirebaseQuery_EqualWithKeyTo final
{
public:
	class UFirebaseVariant*                       OrderValue;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseQuery*                         ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_EqualWithKeyTo) == 0x000008, "Wrong alignment on FirebaseQuery_EqualWithKeyTo");
static_assert(sizeof(FirebaseQuery_EqualWithKeyTo) == 0x000020, "Wrong size on FirebaseQuery_EqualWithKeyTo");
static_assert(offsetof(FirebaseQuery_EqualWithKeyTo, OrderValue) == 0x000000, "Member 'FirebaseQuery_EqualWithKeyTo::OrderValue' has a wrong offset!");
static_assert(offsetof(FirebaseQuery_EqualWithKeyTo, Key) == 0x000008, "Member 'FirebaseQuery_EqualWithKeyTo::Key' has a wrong offset!");
static_assert(offsetof(FirebaseQuery_EqualWithKeyTo, ReturnValue) == 0x000018, "Member 'FirebaseQuery_EqualWithKeyTo::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.GetReference
// 0x0008 (0x0008 - 0x0000)
struct FirebaseQuery_GetReference final
{
public:
	class UFirebaseDatabaseRef*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_GetReference) == 0x000008, "Wrong alignment on FirebaseQuery_GetReference");
static_assert(sizeof(FirebaseQuery_GetReference) == 0x000008, "Wrong size on FirebaseQuery_GetReference");
static_assert(offsetof(FirebaseQuery_GetReference, ReturnValue) == 0x000000, "Member 'FirebaseQuery_GetReference::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.GetValue
// 0x0008 (0x0008 - 0x0000)
struct FirebaseQuery_GetValue final
{
public:
	class UFirebaseFutureDataSnapshot*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_GetValue) == 0x000008, "Wrong alignment on FirebaseQuery_GetValue");
static_assert(sizeof(FirebaseQuery_GetValue) == 0x000008, "Wrong size on FirebaseQuery_GetValue");
static_assert(offsetof(FirebaseQuery_GetValue, ReturnValue) == 0x000000, "Member 'FirebaseQuery_GetValue::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.GetValueLastResult
// 0x0008 (0x0008 - 0x0000)
struct FirebaseQuery_GetValueLastResult final
{
public:
	class UFirebaseFutureDataSnapshot*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_GetValueLastResult) == 0x000008, "Wrong alignment on FirebaseQuery_GetValueLastResult");
static_assert(sizeof(FirebaseQuery_GetValueLastResult) == 0x000008, "Wrong size on FirebaseQuery_GetValueLastResult");
static_assert(offsetof(FirebaseQuery_GetValueLastResult, ReturnValue) == 0x000000, "Member 'FirebaseQuery_GetValueLastResult::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.isValid
// 0x0001 (0x0001 - 0x0000)
struct FirebaseQuery_IsValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_IsValid) == 0x000001, "Wrong alignment on FirebaseQuery_IsValid");
static_assert(sizeof(FirebaseQuery_IsValid) == 0x000001, "Wrong size on FirebaseQuery_IsValid");
static_assert(offsetof(FirebaseQuery_IsValid, ReturnValue) == 0x000000, "Member 'FirebaseQuery_IsValid::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.LimitToFirst
// 0x0010 (0x0010 - 0x0000)
struct FirebaseQuery_LimitToFirst final
{
public:
	int64                                         Limit;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseQuery*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_LimitToFirst) == 0x000008, "Wrong alignment on FirebaseQuery_LimitToFirst");
static_assert(sizeof(FirebaseQuery_LimitToFirst) == 0x000010, "Wrong size on FirebaseQuery_LimitToFirst");
static_assert(offsetof(FirebaseQuery_LimitToFirst, Limit) == 0x000000, "Member 'FirebaseQuery_LimitToFirst::Limit' has a wrong offset!");
static_assert(offsetof(FirebaseQuery_LimitToFirst, ReturnValue) == 0x000008, "Member 'FirebaseQuery_LimitToFirst::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.LimitToLast
// 0x0010 (0x0010 - 0x0000)
struct FirebaseQuery_LimitToLast final
{
public:
	int64                                         Limit;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseQuery*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_LimitToLast) == 0x000008, "Wrong alignment on FirebaseQuery_LimitToLast");
static_assert(sizeof(FirebaseQuery_LimitToLast) == 0x000010, "Wrong size on FirebaseQuery_LimitToLast");
static_assert(offsetof(FirebaseQuery_LimitToLast, Limit) == 0x000000, "Member 'FirebaseQuery_LimitToLast::Limit' has a wrong offset!");
static_assert(offsetof(FirebaseQuery_LimitToLast, ReturnValue) == 0x000008, "Member 'FirebaseQuery_LimitToLast::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.OrderByChild
// 0x0018 (0x0018 - 0x0000)
struct FirebaseQuery_OrderByChild final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseQuery*                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_OrderByChild) == 0x000008, "Wrong alignment on FirebaseQuery_OrderByChild");
static_assert(sizeof(FirebaseQuery_OrderByChild) == 0x000018, "Wrong size on FirebaseQuery_OrderByChild");
static_assert(offsetof(FirebaseQuery_OrderByChild, Path) == 0x000000, "Member 'FirebaseQuery_OrderByChild::Path' has a wrong offset!");
static_assert(offsetof(FirebaseQuery_OrderByChild, ReturnValue) == 0x000010, "Member 'FirebaseQuery_OrderByChild::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.OrderByKey
// 0x0008 (0x0008 - 0x0000)
struct FirebaseQuery_OrderByKey final
{
public:
	class UFirebaseQuery*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_OrderByKey) == 0x000008, "Wrong alignment on FirebaseQuery_OrderByKey");
static_assert(sizeof(FirebaseQuery_OrderByKey) == 0x000008, "Wrong size on FirebaseQuery_OrderByKey");
static_assert(offsetof(FirebaseQuery_OrderByKey, ReturnValue) == 0x000000, "Member 'FirebaseQuery_OrderByKey::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.OrderByPriority
// 0x0008 (0x0008 - 0x0000)
struct FirebaseQuery_OrderByPriority final
{
public:
	class UFirebaseQuery*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_OrderByPriority) == 0x000008, "Wrong alignment on FirebaseQuery_OrderByPriority");
static_assert(sizeof(FirebaseQuery_OrderByPriority) == 0x000008, "Wrong size on FirebaseQuery_OrderByPriority");
static_assert(offsetof(FirebaseQuery_OrderByPriority, ReturnValue) == 0x000000, "Member 'FirebaseQuery_OrderByPriority::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.OrderByValue
// 0x0008 (0x0008 - 0x0000)
struct FirebaseQuery_OrderByValue final
{
public:
	class UFirebaseQuery*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_OrderByValue) == 0x000008, "Wrong alignment on FirebaseQuery_OrderByValue");
static_assert(sizeof(FirebaseQuery_OrderByValue) == 0x000008, "Wrong size on FirebaseQuery_OrderByValue");
static_assert(offsetof(FirebaseQuery_OrderByValue, ReturnValue) == 0x000000, "Member 'FirebaseQuery_OrderByValue::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.RemoveChildListener
// 0x0008 (0x0008 - 0x0000)
struct FirebaseQuery_RemoveChildListener final
{
public:
	class UFirebaseChildListener*                 Listener;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_RemoveChildListener) == 0x000008, "Wrong alignment on FirebaseQuery_RemoveChildListener");
static_assert(sizeof(FirebaseQuery_RemoveChildListener) == 0x000008, "Wrong size on FirebaseQuery_RemoveChildListener");
static_assert(offsetof(FirebaseQuery_RemoveChildListener, Listener) == 0x000000, "Member 'FirebaseQuery_RemoveChildListener::Listener' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.RemoveValueListener
// 0x0008 (0x0008 - 0x0000)
struct FirebaseQuery_RemoveValueListener final
{
public:
	class UFirebaseValueListener*                 Listner;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_RemoveValueListener) == 0x000008, "Wrong alignment on FirebaseQuery_RemoveValueListener");
static_assert(sizeof(FirebaseQuery_RemoveValueListener) == 0x000008, "Wrong size on FirebaseQuery_RemoveValueListener");
static_assert(offsetof(FirebaseQuery_RemoveValueListener, Listner) == 0x000000, "Member 'FirebaseQuery_RemoveValueListener::Listner' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.SetKeepSynchronized
// 0x0001 (0x0001 - 0x0000)
struct FirebaseQuery_SetKeepSynchronized final
{
public:
	bool                                          Keep_sync;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_SetKeepSynchronized) == 0x000001, "Wrong alignment on FirebaseQuery_SetKeepSynchronized");
static_assert(sizeof(FirebaseQuery_SetKeepSynchronized) == 0x000001, "Wrong size on FirebaseQuery_SetKeepSynchronized");
static_assert(offsetof(FirebaseQuery_SetKeepSynchronized, Keep_sync) == 0x000000, "Member 'FirebaseQuery_SetKeepSynchronized::Keep_sync' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.StartAt
// 0x0010 (0x0010 - 0x0000)
struct FirebaseQuery_StartAt final
{
public:
	class UFirebaseVariant*                       OrderValue;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseQuery*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_StartAt) == 0x000008, "Wrong alignment on FirebaseQuery_StartAt");
static_assert(sizeof(FirebaseQuery_StartAt) == 0x000010, "Wrong size on FirebaseQuery_StartAt");
static_assert(offsetof(FirebaseQuery_StartAt, OrderValue) == 0x000000, "Member 'FirebaseQuery_StartAt::OrderValue' has a wrong offset!");
static_assert(offsetof(FirebaseQuery_StartAt, ReturnValue) == 0x000008, "Member 'FirebaseQuery_StartAt::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseQuery.StartWithKeyAt
// 0x0020 (0x0020 - 0x0000)
struct FirebaseQuery_StartWithKeyAt final
{
public:
	class UFirebaseVariant*                       OrderValue;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseQuery*                         ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseQuery_StartWithKeyAt) == 0x000008, "Wrong alignment on FirebaseQuery_StartWithKeyAt");
static_assert(sizeof(FirebaseQuery_StartWithKeyAt) == 0x000020, "Wrong size on FirebaseQuery_StartWithKeyAt");
static_assert(offsetof(FirebaseQuery_StartWithKeyAt, OrderValue) == 0x000000, "Member 'FirebaseQuery_StartWithKeyAt::OrderValue' has a wrong offset!");
static_assert(offsetof(FirebaseQuery_StartWithKeyAt, Key) == 0x000008, "Member 'FirebaseQuery_StartWithKeyAt::Key' has a wrong offset!");
static_assert(offsetof(FirebaseQuery_StartWithKeyAt, ReturnValue) == 0x000018, "Member 'FirebaseQuery_StartWithKeyAt::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseDatabaseRef.GetRootDatabaseRef
// 0x0008 (0x0008 - 0x0000)
struct FirebaseDatabaseRef_GetRootDatabaseRef final
{
public:
	class UFirebaseDatabaseRef*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseDatabaseRef_GetRootDatabaseRef) == 0x000008, "Wrong alignment on FirebaseDatabaseRef_GetRootDatabaseRef");
static_assert(sizeof(FirebaseDatabaseRef_GetRootDatabaseRef) == 0x000008, "Wrong size on FirebaseDatabaseRef_GetRootDatabaseRef");
static_assert(offsetof(FirebaseDatabaseRef_GetRootDatabaseRef, ReturnValue) == 0x000000, "Member 'FirebaseDatabaseRef_GetRootDatabaseRef::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseDatabaseRef.GetRootDatabaseRefFromUrl
// 0x0018 (0x0018 - 0x0000)
struct FirebaseDatabaseRef_GetRootDatabaseRefFromUrl final
{
public:
	class FString                                 URL_0;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseDatabaseRef*                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseDatabaseRef_GetRootDatabaseRefFromUrl) == 0x000008, "Wrong alignment on FirebaseDatabaseRef_GetRootDatabaseRefFromUrl");
static_assert(sizeof(FirebaseDatabaseRef_GetRootDatabaseRefFromUrl) == 0x000018, "Wrong size on FirebaseDatabaseRef_GetRootDatabaseRefFromUrl");
static_assert(offsetof(FirebaseDatabaseRef_GetRootDatabaseRefFromUrl, URL_0) == 0x000000, "Member 'FirebaseDatabaseRef_GetRootDatabaseRefFromUrl::URL_0' has a wrong offset!");
static_assert(offsetof(FirebaseDatabaseRef_GetRootDatabaseRefFromUrl, ReturnValue) == 0x000010, "Member 'FirebaseDatabaseRef_GetRootDatabaseRefFromUrl::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseDatabaseRef.Child
// 0x0018 (0x0018 - 0x0000)
struct FirebaseDatabaseRef_Child final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseDatabaseRef*                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseDatabaseRef_Child) == 0x000008, "Wrong alignment on FirebaseDatabaseRef_Child");
static_assert(sizeof(FirebaseDatabaseRef_Child) == 0x000018, "Wrong size on FirebaseDatabaseRef_Child");
static_assert(offsetof(FirebaseDatabaseRef_Child, Path) == 0x000000, "Member 'FirebaseDatabaseRef_Child::Path' has a wrong offset!");
static_assert(offsetof(FirebaseDatabaseRef_Child, ReturnValue) == 0x000010, "Member 'FirebaseDatabaseRef_Child::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseDatabaseRef.GetParent
// 0x0008 (0x0008 - 0x0000)
struct FirebaseDatabaseRef_GetParent final
{
public:
	class UFirebaseDatabaseRef*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseDatabaseRef_GetParent) == 0x000008, "Wrong alignment on FirebaseDatabaseRef_GetParent");
static_assert(sizeof(FirebaseDatabaseRef_GetParent) == 0x000008, "Wrong size on FirebaseDatabaseRef_GetParent");
static_assert(offsetof(FirebaseDatabaseRef_GetParent, ReturnValue) == 0x000000, "Member 'FirebaseDatabaseRef_GetParent::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseDatabaseRef.GetRoot
// 0x0008 (0x0008 - 0x0000)
struct FirebaseDatabaseRef_GetRoot final
{
public:
	class UFirebaseDatabaseRef*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseDatabaseRef_GetRoot) == 0x000008, "Wrong alignment on FirebaseDatabaseRef_GetRoot");
static_assert(sizeof(FirebaseDatabaseRef_GetRoot) == 0x000008, "Wrong size on FirebaseDatabaseRef_GetRoot");
static_assert(offsetof(FirebaseDatabaseRef_GetRoot, ReturnValue) == 0x000000, "Member 'FirebaseDatabaseRef_GetRoot::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseDatabaseRef.IsDatabaseValid
// 0x0001 (0x0001 - 0x0000)
struct FirebaseDatabaseRef_IsDatabaseValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseDatabaseRef_IsDatabaseValid) == 0x000001, "Wrong alignment on FirebaseDatabaseRef_IsDatabaseValid");
static_assert(sizeof(FirebaseDatabaseRef_IsDatabaseValid) == 0x000001, "Wrong size on FirebaseDatabaseRef_IsDatabaseValid");
static_assert(offsetof(FirebaseDatabaseRef_IsDatabaseValid, ReturnValue) == 0x000000, "Member 'FirebaseDatabaseRef_IsDatabaseValid::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseDatabaseRef.IsRoot
// 0x0001 (0x0001 - 0x0000)
struct FirebaseDatabaseRef_IsRoot final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseDatabaseRef_IsRoot) == 0x000001, "Wrong alignment on FirebaseDatabaseRef_IsRoot");
static_assert(sizeof(FirebaseDatabaseRef_IsRoot) == 0x000001, "Wrong size on FirebaseDatabaseRef_IsRoot");
static_assert(offsetof(FirebaseDatabaseRef_IsRoot, ReturnValue) == 0x000000, "Member 'FirebaseDatabaseRef_IsRoot::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseDatabaseRef.Key
// 0x0010 (0x0010 - 0x0000)
struct FirebaseDatabaseRef_Key final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseDatabaseRef_Key) == 0x000008, "Wrong alignment on FirebaseDatabaseRef_Key");
static_assert(sizeof(FirebaseDatabaseRef_Key) == 0x000010, "Wrong size on FirebaseDatabaseRef_Key");
static_assert(offsetof(FirebaseDatabaseRef_Key, ReturnValue) == 0x000000, "Member 'FirebaseDatabaseRef_Key::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseDatabaseRef.PushChild
// 0x0008 (0x0008 - 0x0000)
struct FirebaseDatabaseRef_PushChild final
{
public:
	class UFirebaseDatabaseRef*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseDatabaseRef_PushChild) == 0x000008, "Wrong alignment on FirebaseDatabaseRef_PushChild");
static_assert(sizeof(FirebaseDatabaseRef_PushChild) == 0x000008, "Wrong size on FirebaseDatabaseRef_PushChild");
static_assert(offsetof(FirebaseDatabaseRef_PushChild, ReturnValue) == 0x000000, "Member 'FirebaseDatabaseRef_PushChild::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseDatabaseRef.RemoveValue
// 0x0008 (0x0008 - 0x0000)
struct FirebaseDatabaseRef_RemoveValue final
{
public:
	class UFirebaseFutureVoid*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseDatabaseRef_RemoveValue) == 0x000008, "Wrong alignment on FirebaseDatabaseRef_RemoveValue");
static_assert(sizeof(FirebaseDatabaseRef_RemoveValue) == 0x000008, "Wrong size on FirebaseDatabaseRef_RemoveValue");
static_assert(offsetof(FirebaseDatabaseRef_RemoveValue, ReturnValue) == 0x000000, "Member 'FirebaseDatabaseRef_RemoveValue::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseDatabaseRef.RemoveValueLastResult
// 0x0008 (0x0008 - 0x0000)
struct FirebaseDatabaseRef_RemoveValueLastResult final
{
public:
	class UFirebaseFutureVoid*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseDatabaseRef_RemoveValueLastResult) == 0x000008, "Wrong alignment on FirebaseDatabaseRef_RemoveValueLastResult");
static_assert(sizeof(FirebaseDatabaseRef_RemoveValueLastResult) == 0x000008, "Wrong size on FirebaseDatabaseRef_RemoveValueLastResult");
static_assert(offsetof(FirebaseDatabaseRef_RemoveValueLastResult, ReturnValue) == 0x000000, "Member 'FirebaseDatabaseRef_RemoveValueLastResult::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseDatabaseRef.SetPriority
// 0x0010 (0x0010 - 0x0000)
struct FirebaseDatabaseRef_SetPriority final
{
public:
	class UFirebaseVariant*                       Variant;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseFutureVoid*                    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseDatabaseRef_SetPriority) == 0x000008, "Wrong alignment on FirebaseDatabaseRef_SetPriority");
static_assert(sizeof(FirebaseDatabaseRef_SetPriority) == 0x000010, "Wrong size on FirebaseDatabaseRef_SetPriority");
static_assert(offsetof(FirebaseDatabaseRef_SetPriority, Variant) == 0x000000, "Member 'FirebaseDatabaseRef_SetPriority::Variant' has a wrong offset!");
static_assert(offsetof(FirebaseDatabaseRef_SetPriority, ReturnValue) == 0x000008, "Member 'FirebaseDatabaseRef_SetPriority::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseDatabaseRef.SetPriorityLastResult
// 0x0008 (0x0008 - 0x0000)
struct FirebaseDatabaseRef_SetPriorityLastResult final
{
public:
	class UFirebaseFutureVoid*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseDatabaseRef_SetPriorityLastResult) == 0x000008, "Wrong alignment on FirebaseDatabaseRef_SetPriorityLastResult");
static_assert(sizeof(FirebaseDatabaseRef_SetPriorityLastResult) == 0x000008, "Wrong size on FirebaseDatabaseRef_SetPriorityLastResult");
static_assert(offsetof(FirebaseDatabaseRef_SetPriorityLastResult, ReturnValue) == 0x000000, "Member 'FirebaseDatabaseRef_SetPriorityLastResult::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseDatabaseRef.SetValue
// 0x0010 (0x0010 - 0x0000)
struct FirebaseDatabaseRef_SetValue final
{
public:
	class UFirebaseVariant*                       Variant;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseFutureVoid*                    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseDatabaseRef_SetValue) == 0x000008, "Wrong alignment on FirebaseDatabaseRef_SetValue");
static_assert(sizeof(FirebaseDatabaseRef_SetValue) == 0x000010, "Wrong size on FirebaseDatabaseRef_SetValue");
static_assert(offsetof(FirebaseDatabaseRef_SetValue, Variant) == 0x000000, "Member 'FirebaseDatabaseRef_SetValue::Variant' has a wrong offset!");
static_assert(offsetof(FirebaseDatabaseRef_SetValue, ReturnValue) == 0x000008, "Member 'FirebaseDatabaseRef_SetValue::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseDatabaseRef.SetValueAndPriority
// 0x0018 (0x0018 - 0x0000)
struct FirebaseDatabaseRef_SetValueAndPriority final
{
public:
	class UFirebaseVariant*                       Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseVariant*                       Priority;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFirebaseFutureVoid*                    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FirebaseDatabaseRef_SetValueAndPriority) == 0x000008, "Wrong alignment on FirebaseDatabaseRef_SetValueAndPriority");
static_assert(sizeof(FirebaseDatabaseRef_SetValueAndPriority) == 0x000018, "Wrong size on FirebaseDatabaseRef_SetValueAndPriority");
static_assert(offsetof(FirebaseDatabaseRef_SetValueAndPriority, Value) == 0x000000, "Member 'FirebaseDatabaseRef_SetValueAndPriority::Value' has a wrong offset!");
static_assert(offsetof(FirebaseDatabaseRef_SetValueAndPriority, Priority) == 0x000008, "Member 'FirebaseDatabaseRef_SetValueAndPriority::Priority' has a wrong offset!");
static_assert(offsetof(FirebaseDatabaseRef_SetValueAndPriority, ReturnValue) == 0x000010, "Member 'FirebaseDatabaseRef_SetValueAndPriority::ReturnValue' has a wrong offset!");

// Function EasyFirebase.FirebaseDatabaseRef.SetValueAndPriorityLastResult
// 0x0008 (0x0008 - 0x0000)
struct FirebaseDatabaseRef_SetValueAndPriorityLastResult final
{
public:
