#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MirMobile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MirMobile_structs.hpp"
#include "SlateCore_structs.hpp"
#include "WNGamePlugin_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MirMobile.CutsceneActor.TestSetSkeletalMesh
// 0x0020 (0x0020 - 0x0000)
struct CutsceneActor_TestSetSkeletalMesh final
{
public:
	class FString                                 MeshPath;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AnimClassName;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CutsceneActor_TestSetSkeletalMesh) == 0x000008, "Wrong alignment on CutsceneActor_TestSetSkeletalMesh");
static_assert(sizeof(CutsceneActor_TestSetSkeletalMesh) == 0x000020, "Wrong size on CutsceneActor_TestSetSkeletalMesh");
static_assert(offsetof(CutsceneActor_TestSetSkeletalMesh, MeshPath) == 0x000000, "Member 'CutsceneActor_TestSetSkeletalMesh::MeshPath' has a wrong offset!");
static_assert(offsetof(CutsceneActor_TestSetSkeletalMesh, AnimClassName) == 0x000010, "Member 'CutsceneActor_TestSetSkeletalMesh::AnimClassName' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.AddBuffToChar
// 0x0010 (0x0010 - 0x0000)
struct MM_AIControllerBase_AddBuffToChar final
{
public:
	class AMM_CharacterPawnBase*                  PCharBase;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NBuffTID;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_AddBuffToChar) == 0x000008, "Wrong alignment on MM_AIControllerBase_AddBuffToChar");
static_assert(sizeof(MM_AIControllerBase_AddBuffToChar) == 0x000010, "Wrong size on MM_AIControllerBase_AddBuffToChar");
static_assert(offsetof(MM_AIControllerBase_AddBuffToChar, PCharBase) == 0x000000, "Member 'MM_AIControllerBase_AddBuffToChar::PCharBase' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_AddBuffToChar, NBuffTID) == 0x000008, "Member 'MM_AIControllerBase_AddBuffToChar::NBuffTID' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_AddBuffToChar, ReturnValue) == 0x00000C, "Member 'MM_AIControllerBase_AddBuffToChar::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.AttackTarget
// 0x0008 (0x0008 - 0x0000)
struct MM_AIControllerBase_AttackTarget final
{
public:
	int32                                         NAttackTID;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_AttackTarget) == 0x000004, "Wrong alignment on MM_AIControllerBase_AttackTarget");
static_assert(sizeof(MM_AIControllerBase_AttackTarget) == 0x000008, "Wrong size on MM_AIControllerBase_AttackTarget");
static_assert(offsetof(MM_AIControllerBase_AttackTarget, NAttackTID) == 0x000000, "Member 'MM_AIControllerBase_AttackTarget::NAttackTID' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_AttackTarget, ReturnValue) == 0x000004, "Member 'MM_AIControllerBase_AttackTarget::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.CompareDistance
// 0x0018 (0x0018 - 0x0000)
struct MM_AIControllerBase_CompareDistance final
{
public:
	const class AMM_CharacterPawnBase*            PCharA;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AMM_CharacterPawnBase*            PCharB;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_CompareDistance) == 0x000008, "Wrong alignment on MM_AIControllerBase_CompareDistance");
static_assert(sizeof(MM_AIControllerBase_CompareDistance) == 0x000018, "Wrong size on MM_AIControllerBase_CompareDistance");
static_assert(offsetof(MM_AIControllerBase_CompareDistance, PCharA) == 0x000000, "Member 'MM_AIControllerBase_CompareDistance::PCharA' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_CompareDistance, PCharB) == 0x000008, "Member 'MM_AIControllerBase_CompareDistance::PCharB' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_CompareDistance, ReturnValue) == 0x000010, "Member 'MM_AIControllerBase_CompareDistance::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.DelBuffFromChar
// 0x0010 (0x0010 - 0x0000)
struct MM_AIControllerBase_DelBuffFromChar final
{
public:
	class AMM_CharacterPawnBase*                  PCharBase;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NBuffTID;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_DelBuffFromChar) == 0x000008, "Wrong alignment on MM_AIControllerBase_DelBuffFromChar");
static_assert(sizeof(MM_AIControllerBase_DelBuffFromChar) == 0x000010, "Wrong size on MM_AIControllerBase_DelBuffFromChar");
static_assert(offsetof(MM_AIControllerBase_DelBuffFromChar, PCharBase) == 0x000000, "Member 'MM_AIControllerBase_DelBuffFromChar::PCharBase' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_DelBuffFromChar, NBuffTID) == 0x000008, "Member 'MM_AIControllerBase_DelBuffFromChar::NBuffTID' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_DelBuffFromChar, ReturnValue) == 0x00000C, "Member 'MM_AIControllerBase_DelBuffFromChar::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.GenTotem
// 0x0020 (0x0020 - 0x0000)
struct MM_AIControllerBase_GenTotem final
{
public:
	class AMM_CharacterPawnBase*                  PCharBase;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NTotemID;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Loc;                                               // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_GenTotem) == 0x000008, "Wrong alignment on MM_AIControllerBase_GenTotem");
static_assert(sizeof(MM_AIControllerBase_GenTotem) == 0x000020, "Wrong size on MM_AIControllerBase_GenTotem");
static_assert(offsetof(MM_AIControllerBase_GenTotem, PCharBase) == 0x000000, "Member 'MM_AIControllerBase_GenTotem::PCharBase' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_GenTotem, NTotemID) == 0x000008, "Member 'MM_AIControllerBase_GenTotem::NTotemID' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_GenTotem, Loc) == 0x00000C, "Member 'MM_AIControllerBase_GenTotem::Loc' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_GenTotem, ReturnValue) == 0x000018, "Member 'MM_AIControllerBase_GenTotem::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.GetAttackID
// 0x0008 (0x0008 - 0x0000)
struct MM_AIControllerBase_GetAttackID final
{
public:
	bool                                          bLongAttack;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MM_AIControllerBase_GetAttackID) == 0x000004, "Wrong alignment on MM_AIControllerBase_GetAttackID");
static_assert(sizeof(MM_AIControllerBase_GetAttackID) == 0x000008, "Wrong size on MM_AIControllerBase_GetAttackID");
static_assert(offsetof(MM_AIControllerBase_GetAttackID, bLongAttack) == 0x000000, "Member 'MM_AIControllerBase_GetAttackID::bLongAttack' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_GetAttackID, ReturnValue) == 0x000004, "Member 'MM_AIControllerBase_GetAttackID::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.GetDirectionFromMe
// 0x0010 (0x0010 - 0x0000)
struct MM_AIControllerBase_GetDirectionFromMe final
{
public:
	const class AMM_CharacterPawnBase*            PChar;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	E_CARDINALPOINTS                              ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_GetDirectionFromMe) == 0x000008, "Wrong alignment on MM_AIControllerBase_GetDirectionFromMe");
static_assert(sizeof(MM_AIControllerBase_GetDirectionFromMe) == 0x000010, "Wrong size on MM_AIControllerBase_GetDirectionFromMe");
static_assert(offsetof(MM_AIControllerBase_GetDirectionFromMe, PChar) == 0x000000, "Member 'MM_AIControllerBase_GetDirectionFromMe::PChar' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_GetDirectionFromMe, Angle) == 0x000008, "Member 'MM_AIControllerBase_GetDirectionFromMe::Angle' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_GetDirectionFromMe, ReturnValue) == 0x00000C, "Member 'MM_AIControllerBase_GetDirectionFromMe::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.HaveCCType
// 0x0002 (0x0002 - 0x0000)
struct MM_AIControllerBase_HaveCCType final
{
public:
	ECROWD_CONTROL_TYPE                           ECCType;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MM_AIControllerBase_HaveCCType) == 0x000001, "Wrong alignment on MM_AIControllerBase_HaveCCType");
static_assert(sizeof(MM_AIControllerBase_HaveCCType) == 0x000002, "Wrong size on MM_AIControllerBase_HaveCCType");
static_assert(offsetof(MM_AIControllerBase_HaveCCType, ECCType) == 0x000000, "Member 'MM_AIControllerBase_HaveCCType::ECCType' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_HaveCCType, ReturnValue) == 0x000001, "Member 'MM_AIControllerBase_HaveCCType::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.HealTarget
// 0x0008 (0x0008 - 0x0000)
struct MM_AIControllerBase_HealTarget final
{
public:
	int32                                         NHealValue;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_HealTarget) == 0x000004, "Wrong alignment on MM_AIControllerBase_HealTarget");
static_assert(sizeof(MM_AIControllerBase_HealTarget) == 0x000008, "Wrong size on MM_AIControllerBase_HealTarget");
static_assert(offsetof(MM_AIControllerBase_HealTarget, NHealValue) == 0x000000, "Member 'MM_AIControllerBase_HealTarget::NHealValue' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_HealTarget, ReturnValue) == 0x000004, "Member 'MM_AIControllerBase_HealTarget::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.IsCloseToChar
// 0x0010 (0x0010 - 0x0000)
struct MM_AIControllerBase_IsCloseToChar final
{
public:
	const class AMM_CharacterPawnBase*            PChar;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FCheckDist;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_IsCloseToChar) == 0x000008, "Wrong alignment on MM_AIControllerBase_IsCloseToChar");
static_assert(sizeof(MM_AIControllerBase_IsCloseToChar) == 0x000010, "Wrong size on MM_AIControllerBase_IsCloseToChar");
static_assert(offsetof(MM_AIControllerBase_IsCloseToChar, PChar) == 0x000000, "Member 'MM_AIControllerBase_IsCloseToChar::PChar' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_IsCloseToChar, FCheckDist) == 0x000008, "Member 'MM_AIControllerBase_IsCloseToChar::FCheckDist' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_IsCloseToChar, ReturnValue) == 0x00000C, "Member 'MM_AIControllerBase_IsCloseToChar::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.IsCloseToPos
// 0x0014 (0x0014 - 0x0000)
struct MM_AIControllerBase_IsCloseToPos final
{
public:
	struct FVector                                VPos;                                              // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FCheckDist;                                        // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_IsCloseToPos) == 0x000004, "Wrong alignment on MM_AIControllerBase_IsCloseToPos");
static_assert(sizeof(MM_AIControllerBase_IsCloseToPos) == 0x000014, "Wrong size on MM_AIControllerBase_IsCloseToPos");
static_assert(offsetof(MM_AIControllerBase_IsCloseToPos, VPos) == 0x000000, "Member 'MM_AIControllerBase_IsCloseToPos::VPos' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_IsCloseToPos, FCheckDist) == 0x00000C, "Member 'MM_AIControllerBase_IsCloseToPos::FCheckDist' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_IsCloseToPos, ReturnValue) == 0x000010, "Member 'MM_AIControllerBase_IsCloseToPos::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.IsDead
// 0x0010 (0x0010 - 0x0000)
struct MM_AIControllerBase_IsDead final
{
public:
	class AMM_CharacterPawnBase*                  PCharBase;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_IsDead) == 0x000008, "Wrong alignment on MM_AIControllerBase_IsDead");
static_assert(sizeof(MM_AIControllerBase_IsDead) == 0x000010, "Wrong size on MM_AIControllerBase_IsDead");
static_assert(offsetof(MM_AIControllerBase_IsDead, PCharBase) == 0x000000, "Member 'MM_AIControllerBase_IsDead::PCharBase' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_IsDead, ReturnValue) == 0x000008, "Member 'MM_AIControllerBase_IsDead::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.KillMonster
// 0x0008 (0x0008 - 0x0000)
struct MM_AIControllerBase_KillMonster final
{
public:
	int32                                         NMonTID;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_KillMonster) == 0x000004, "Wrong alignment on MM_AIControllerBase_KillMonster");
static_assert(sizeof(MM_AIControllerBase_KillMonster) == 0x000008, "Wrong size on MM_AIControllerBase_KillMonster");
static_assert(offsetof(MM_AIControllerBase_KillMonster, NMonTID) == 0x000000, "Member 'MM_AIControllerBase_KillMonster::NMonTID' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_KillMonster, ReturnValue) == 0x000004, "Member 'MM_AIControllerBase_KillMonster::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.KillTotem
// 0x0008 (0x0008 - 0x0000)
struct MM_AIControllerBase_KillTotem final
{
public:
	int32                                         NTotemTID;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_KillTotem) == 0x000004, "Wrong alignment on MM_AIControllerBase_KillTotem");
static_assert(sizeof(MM_AIControllerBase_KillTotem) == 0x000008, "Wrong size on MM_AIControllerBase_KillTotem");
static_assert(offsetof(MM_AIControllerBase_KillTotem, NTotemTID) == 0x000000, "Member 'MM_AIControllerBase_KillTotem::NTotemTID' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_KillTotem, ReturnValue) == 0x000004, "Member 'MM_AIControllerBase_KillTotem::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.MoveToDest
// 0x0010 (0x0010 - 0x0000)
struct MM_AIControllerBase_MoveToDest final
{
public:
	struct FVector                                VDestPos;                                          // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_MoveToDest) == 0x000004, "Wrong alignment on MM_AIControllerBase_MoveToDest");
static_assert(sizeof(MM_AIControllerBase_MoveToDest) == 0x000010, "Wrong size on MM_AIControllerBase_MoveToDest");
static_assert(offsetof(MM_AIControllerBase_MoveToDest, VDestPos) == 0x000000, "Member 'MM_AIControllerBase_MoveToDest::VDestPos' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_MoveToDest, ReturnValue) == 0x00000C, "Member 'MM_AIControllerBase_MoveToDest::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.NoticeMsg
// 0x0008 (0x0008 - 0x0000)
struct MM_AIControllerBase_NoticeMsg final
{
public:
	int32                                         MessageID;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	E_NOTICE_TARGET                               EType;                                             // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_NoticeMsg) == 0x000004, "Wrong alignment on MM_AIControllerBase_NoticeMsg");
static_assert(sizeof(MM_AIControllerBase_NoticeMsg) == 0x000008, "Wrong size on MM_AIControllerBase_NoticeMsg");
static_assert(offsetof(MM_AIControllerBase_NoticeMsg, MessageID) == 0x000000, "Member 'MM_AIControllerBase_NoticeMsg::MessageID' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_NoticeMsg, EType) == 0x000004, "Member 'MM_AIControllerBase_NoticeMsg::EType' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_NoticeMsg, ReturnValue) == 0x000005, "Member 'MM_AIControllerBase_NoticeMsg::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.Patrol
// 0x0001 (0x0001 - 0x0000)
struct MM_AIControllerBase_Patrol final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MM_AIControllerBase_Patrol) == 0x000001, "Wrong alignment on MM_AIControllerBase_Patrol");
static_assert(sizeof(MM_AIControllerBase_Patrol) == 0x000001, "Wrong size on MM_AIControllerBase_Patrol");
static_assert(offsetof(MM_AIControllerBase_Patrol, ReturnValue) == 0x000000, "Member 'MM_AIControllerBase_Patrol::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.PlayAni
// 0x0008 (0x0008 - 0x0000)
struct MM_AIControllerBase_PlayAni final
{
public:
	int32                                         NEmotionID;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_PlayAni) == 0x000004, "Wrong alignment on MM_AIControllerBase_PlayAni");
static_assert(sizeof(MM_AIControllerBase_PlayAni) == 0x000008, "Wrong size on MM_AIControllerBase_PlayAni");
static_assert(offsetof(MM_AIControllerBase_PlayAni, NEmotionID) == 0x000000, "Member 'MM_AIControllerBase_PlayAni::NEmotionID' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_PlayAni, ReturnValue) == 0x000004, "Member 'MM_AIControllerBase_PlayAni::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.RemoveEffect
// 0x000C (0x000C - 0x0000)
struct MM_AIControllerBase_RemoveEffect final
{
public:
	class FName                                   ParticleName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_RemoveEffect) == 0x000004, "Wrong alignment on MM_AIControllerBase_RemoveEffect");
static_assert(sizeof(MM_AIControllerBase_RemoveEffect) == 0x00000C, "Wrong size on MM_AIControllerBase_RemoveEffect");
static_assert(offsetof(MM_AIControllerBase_RemoveEffect, ParticleName) == 0x000000, "Member 'MM_AIControllerBase_RemoveEffect::ParticleName' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_RemoveEffect, ReturnValue) == 0x000008, "Member 'MM_AIControllerBase_RemoveEffect::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.RunAway
// 0x0018 (0x0018 - 0x0000)
struct MM_AIControllerBase_RunAway final
{
public:
	class AMM_CharacterPawnBase*                  PTargetChar;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FDist;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_RunAway) == 0x000008, "Wrong alignment on MM_AIControllerBase_RunAway");
static_assert(sizeof(MM_AIControllerBase_RunAway) == 0x000018, "Wrong size on MM_AIControllerBase_RunAway");
static_assert(offsetof(MM_AIControllerBase_RunAway, PTargetChar) == 0x000000, "Member 'MM_AIControllerBase_RunAway::PTargetChar' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_RunAway, FDist) == 0x000008, "Member 'MM_AIControllerBase_RunAway::FDist' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_RunAway, Angle) == 0x00000C, "Member 'MM_AIControllerBase_RunAway::Angle' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_RunAway, ReturnValue) == 0x000010, "Member 'MM_AIControllerBase_RunAway::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.RunCC
// 0x0010 (0x0010 - 0x0000)
struct MM_AIControllerBase_RunCC final
{
public:
	class AMM_CharacterPawnBase*                  PTargetChar;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_RunCC) == 0x000008, "Wrong alignment on MM_AIControllerBase_RunCC");
static_assert(sizeof(MM_AIControllerBase_RunCC) == 0x000010, "Wrong size on MM_AIControllerBase_RunCC");
static_assert(offsetof(MM_AIControllerBase_RunCC, PTargetChar) == 0x000000, "Member 'MM_AIControllerBase_RunCC::PTargetChar' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_RunCC, ReturnValue) == 0x000008, "Member 'MM_AIControllerBase_RunCC::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.SearchCharacter
// 0x0010 (0x0010 - 0x0000)
struct MM_AIControllerBase_SearchCharacter final
{
public:
	ECharacterType                                ECharType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETARGET_TYPE                                  ETargetType;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDISTANCE_TYPE                                EDistType;                                         // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AMM_CharacterPawnBase*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MM_AIControllerBase_SearchCharacter) == 0x000008, "Wrong alignment on MM_AIControllerBase_SearchCharacter");
static_assert(sizeof(MM_AIControllerBase_SearchCharacter) == 0x000010, "Wrong size on MM_AIControllerBase_SearchCharacter");
static_assert(offsetof(MM_AIControllerBase_SearchCharacter, ECharType) == 0x000000, "Member 'MM_AIControllerBase_SearchCharacter::ECharType' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_SearchCharacter, ETargetType) == 0x000001, "Member 'MM_AIControllerBase_SearchCharacter::ETargetType' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_SearchCharacter, EDistType) == 0x000002, "Member 'MM_AIControllerBase_SearchCharacter::EDistType' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_SearchCharacter, ReturnValue) == 0x000008, "Member 'MM_AIControllerBase_SearchCharacter::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.SearchTargets
// 0x0001 (0x0001 - 0x0000)
struct MM_AIControllerBase_SearchTargets final
{
public:
	bool                                          bAggressive;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MM_AIControllerBase_SearchTargets) == 0x000001, "Wrong alignment on MM_AIControllerBase_SearchTargets");
static_assert(sizeof(MM_AIControllerBase_SearchTargets) == 0x000001, "Wrong size on MM_AIControllerBase_SearchTargets");
static_assert(offsetof(MM_AIControllerBase_SearchTargets, bAggressive) == 0x000000, "Member 'MM_AIControllerBase_SearchTargets::bAggressive' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.SetEnemyTarget
// 0x0008 (0x0008 - 0x0000)
struct MM_AIControllerBase_SetEnemyTarget final
{
public:
	class AMM_CharacterPawnBase*                  PCharBase;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MM_AIControllerBase_SetEnemyTarget) == 0x000008, "Wrong alignment on MM_AIControllerBase_SetEnemyTarget");
static_assert(sizeof(MM_AIControllerBase_SetEnemyTarget) == 0x000008, "Wrong size on MM_AIControllerBase_SetEnemyTarget");
static_assert(offsetof(MM_AIControllerBase_SetEnemyTarget, PCharBase) == 0x000000, "Member 'MM_AIControllerBase_SetEnemyTarget::PCharBase' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.SetTarget
// 0x0008 (0x0008 - 0x0000)
struct MM_AIControllerBase_SetTarget final
{
public:
	class AMM_CharacterPawnBase*                  PCharBase;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MM_AIControllerBase_SetTarget) == 0x000008, "Wrong alignment on MM_AIControllerBase_SetTarget");
static_assert(sizeof(MM_AIControllerBase_SetTarget) == 0x000008, "Wrong size on MM_AIControllerBase_SetTarget");
static_assert(offsetof(MM_AIControllerBase_SetTarget, PCharBase) == 0x000000, "Member 'MM_AIControllerBase_SetTarget::PCharBase' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.SpawnEffect
// 0x0014 (0x0014 - 0x0000)
struct MM_AIControllerBase_SpawnEffect final
{
public:
	class FName                                   ParticleName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_SpawnEffect) == 0x000004, "Wrong alignment on MM_AIControllerBase_SpawnEffect");
static_assert(sizeof(MM_AIControllerBase_SpawnEffect) == 0x000014, "Wrong size on MM_AIControllerBase_SpawnEffect");
static_assert(offsetof(MM_AIControllerBase_SpawnEffect, ParticleName) == 0x000000, "Member 'MM_AIControllerBase_SpawnEffect::ParticleName' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_SpawnEffect, BoneName) == 0x000008, "Member 'MM_AIControllerBase_SpawnEffect::BoneName' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_SpawnEffect, ReturnValue) == 0x000010, "Member 'MM_AIControllerBase_SpawnEffect::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.StopMoving
// 0x0001 (0x0001 - 0x0000)
struct MM_AIControllerBase_StopMoving final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MM_AIControllerBase_StopMoving) == 0x000001, "Wrong alignment on MM_AIControllerBase_StopMoving");
static_assert(sizeof(MM_AIControllerBase_StopMoving) == 0x000001, "Wrong size on MM_AIControllerBase_StopMoving");
static_assert(offsetof(MM_AIControllerBase_StopMoving, ReturnValue) == 0x000000, "Member 'MM_AIControllerBase_StopMoving::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.Suicide
// 0x0002 (0x0002 - 0x0000)
struct MM_AIControllerBase_Suicide final
{
public:
	bool                                          bDyingAni;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MM_AIControllerBase_Suicide) == 0x000001, "Wrong alignment on MM_AIControllerBase_Suicide");
static_assert(sizeof(MM_AIControllerBase_Suicide) == 0x000002, "Wrong size on MM_AIControllerBase_Suicide");
static_assert(offsetof(MM_AIControllerBase_Suicide, bDyingAni) == 0x000000, "Member 'MM_AIControllerBase_Suicide::bDyingAni' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_Suicide, ReturnValue) == 0x000001, "Member 'MM_AIControllerBase_Suicide::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.SummonMonster
// 0x0020 (0x0020 - 0x0000)
struct MM_AIControllerBase_SummonMonster final
{
public:
	int32                                         NMonTID;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VLoc;                                              // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RangeMax;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RangeMin;                                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Num;                                               // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_SummonMonster) == 0x000004, "Wrong alignment on MM_AIControllerBase_SummonMonster");
static_assert(sizeof(MM_AIControllerBase_SummonMonster) == 0x000020, "Wrong size on MM_AIControllerBase_SummonMonster");
static_assert(offsetof(MM_AIControllerBase_SummonMonster, NMonTID) == 0x000000, "Member 'MM_AIControllerBase_SummonMonster::NMonTID' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_SummonMonster, VLoc) == 0x000004, "Member 'MM_AIControllerBase_SummonMonster::VLoc' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_SummonMonster, RangeMax) == 0x000010, "Member 'MM_AIControllerBase_SummonMonster::RangeMax' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_SummonMonster, RangeMin) == 0x000014, "Member 'MM_AIControllerBase_SummonMonster::RangeMin' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_SummonMonster, Num) == 0x000018, "Member 'MM_AIControllerBase_SummonMonster::Num' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_SummonMonster, ReturnValue) == 0x00001C, "Member 'MM_AIControllerBase_SummonMonster::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.ToggleCharShow
// 0x0010 (0x0010 - 0x0000)
struct MM_AIControllerBase_ToggleCharShow final
{
public:
	class AMM_CharacterPawnBase*                  PCharBase;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShow;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_ToggleCharShow) == 0x000008, "Wrong alignment on MM_AIControllerBase_ToggleCharShow");
static_assert(sizeof(MM_AIControllerBase_ToggleCharShow) == 0x000010, "Wrong size on MM_AIControllerBase_ToggleCharShow");
static_assert(offsetof(MM_AIControllerBase_ToggleCharShow, PCharBase) == 0x000000, "Member 'MM_AIControllerBase_ToggleCharShow::PCharBase' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_ToggleCharShow, bShow) == 0x000008, "Member 'MM_AIControllerBase_ToggleCharShow::bShow' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_ToggleCharShow, ReturnValue) == 0x000009, "Member 'MM_AIControllerBase_ToggleCharShow::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.TraceDirTarget
// 0x0018 (0x0018 - 0x0000)
struct MM_AIControllerBase_TraceDirTarget final
{
public:
	class AMM_CharacterPawnBase*                  PTargetChar;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_TraceDirTarget) == 0x000008, "Wrong alignment on MM_AIControllerBase_TraceDirTarget");
static_assert(sizeof(MM_AIControllerBase_TraceDirTarget) == 0x000018, "Wrong size on MM_AIControllerBase_TraceDirTarget");
static_assert(offsetof(MM_AIControllerBase_TraceDirTarget, PTargetChar) == 0x000000, "Member 'MM_AIControllerBase_TraceDirTarget::PTargetChar' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_TraceDirTarget, Distance) == 0x000008, "Member 'MM_AIControllerBase_TraceDirTarget::Distance' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_TraceDirTarget, Angle) == 0x00000C, "Member 'MM_AIControllerBase_TraceDirTarget::Angle' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_TraceDirTarget, ReturnValue) == 0x000010, "Member 'MM_AIControllerBase_TraceDirTarget::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.TraceTarget
// 0x0010 (0x0010 - 0x0000)
struct MM_AIControllerBase_TraceTarget final
{
public:
	class AMM_CharacterPawnBase*                  PTargetChar;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_TraceTarget) == 0x000008, "Wrong alignment on MM_AIControllerBase_TraceTarget");
static_assert(sizeof(MM_AIControllerBase_TraceTarget) == 0x000010, "Wrong size on MM_AIControllerBase_TraceTarget");
static_assert(offsetof(MM_AIControllerBase_TraceTarget, PTargetChar) == 0x000000, "Member 'MM_AIControllerBase_TraceTarget::PTargetChar' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_TraceTarget, ReturnValue) == 0x000008, "Member 'MM_AIControllerBase_TraceTarget::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.WarpToChar
// 0x0010 (0x0010 - 0x0000)
struct MM_AIControllerBase_WarpToChar final
{
public:
	class AMM_CharacterPawnBase*                  PCharBase;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_WarpToChar) == 0x000008, "Wrong alignment on MM_AIControllerBase_WarpToChar");
static_assert(sizeof(MM_AIControllerBase_WarpToChar) == 0x000010, "Wrong size on MM_AIControllerBase_WarpToChar");
static_assert(offsetof(MM_AIControllerBase_WarpToChar, PCharBase) == 0x000000, "Member 'MM_AIControllerBase_WarpToChar::PCharBase' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_WarpToChar, ReturnValue) == 0x000008, "Member 'MM_AIControllerBase_WarpToChar::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AIControllerBase.WarpToLocation
// 0x0010 (0x0010 - 0x0000)
struct MM_AIControllerBase_WarpToLocation final
{
public:
	struct FVector                                VPos;                                              // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AIControllerBase_WarpToLocation) == 0x000004, "Wrong alignment on MM_AIControllerBase_WarpToLocation");
static_assert(sizeof(MM_AIControllerBase_WarpToLocation) == 0x000010, "Wrong size on MM_AIControllerBase_WarpToLocation");
static_assert(offsetof(MM_AIControllerBase_WarpToLocation, VPos) == 0x000000, "Member 'MM_AIControllerBase_WarpToLocation::VPos' has a wrong offset!");
static_assert(offsetof(MM_AIControllerBase_WarpToLocation, ReturnValue) == 0x00000C, "Member 'MM_AIControllerBase_WarpToLocation::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AutoBehaviorAIController.CanSkillByDeadPartyMember
// 0x000C (0x000C - 0x0000)
struct MM_AutoBehaviorAIController_CanSkillByDeadPartyMember final
{
public:
	int32                                         SkillId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AutoBehaviorAIController_CanSkillByDeadPartyMember) == 0x000004, "Wrong alignment on MM_AutoBehaviorAIController_CanSkillByDeadPartyMember");
static_assert(sizeof(MM_AutoBehaviorAIController_CanSkillByDeadPartyMember) == 0x00000C, "Wrong size on MM_AutoBehaviorAIController_CanSkillByDeadPartyMember");
static_assert(offsetof(MM_AutoBehaviorAIController_CanSkillByDeadPartyMember, SkillId) == 0x000000, "Member 'MM_AutoBehaviorAIController_CanSkillByDeadPartyMember::SkillId' has a wrong offset!");
static_assert(offsetof(MM_AutoBehaviorAIController_CanSkillByDeadPartyMember, Distance) == 0x000004, "Member 'MM_AutoBehaviorAIController_CanSkillByDeadPartyMember::Distance' has a wrong offset!");
static_assert(offsetof(MM_AutoBehaviorAIController_CanSkillByDeadPartyMember, ReturnValue) == 0x000008, "Member 'MM_AutoBehaviorAIController_CanSkillByDeadPartyMember::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AutoBehaviorAIController.CanSkillByRate
// 0x000C (0x000C - 0x0000)
struct MM_AutoBehaviorAIController_CanSkillByRate final
{
public:
	int32                                         SkillId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rate;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AutoBehaviorAIController_CanSkillByRate) == 0x000004, "Wrong alignment on MM_AutoBehaviorAIController_CanSkillByRate");
static_assert(sizeof(MM_AutoBehaviorAIController_CanSkillByRate) == 0x00000C, "Wrong size on MM_AutoBehaviorAIController_CanSkillByRate");
static_assert(offsetof(MM_AutoBehaviorAIController_CanSkillByRate, SkillId) == 0x000000, "Member 'MM_AutoBehaviorAIController_CanSkillByRate::SkillId' has a wrong offset!");
static_assert(offsetof(MM_AutoBehaviorAIController_CanSkillByRate, Rate) == 0x000004, "Member 'MM_AutoBehaviorAIController_CanSkillByRate::Rate' has a wrong offset!");
static_assert(offsetof(MM_AutoBehaviorAIController_CanSkillByRate, ReturnValue) == 0x000008, "Member 'MM_AutoBehaviorAIController_CanSkillByRate::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AutoBehaviorAIController.CanSkillByRateLessHP
// 0x0010 (0x0010 - 0x0000)
struct MM_AutoBehaviorAIController_CanSkillByRateLessHP final
{
public:
	int32                                         SkillId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HpPercent;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rate;                                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AutoBehaviorAIController_CanSkillByRateLessHP) == 0x000004, "Wrong alignment on MM_AutoBehaviorAIController_CanSkillByRateLessHP");
static_assert(sizeof(MM_AutoBehaviorAIController_CanSkillByRateLessHP) == 0x000010, "Wrong size on MM_AutoBehaviorAIController_CanSkillByRateLessHP");
static_assert(offsetof(MM_AutoBehaviorAIController_CanSkillByRateLessHP, SkillId) == 0x000000, "Member 'MM_AutoBehaviorAIController_CanSkillByRateLessHP::SkillId' has a wrong offset!");
static_assert(offsetof(MM_AutoBehaviorAIController_CanSkillByRateLessHP, HpPercent) == 0x000004, "Member 'MM_AutoBehaviorAIController_CanSkillByRateLessHP::HpPercent' has a wrong offset!");
static_assert(offsetof(MM_AutoBehaviorAIController_CanSkillByRateLessHP, Rate) == 0x000008, "Member 'MM_AutoBehaviorAIController_CanSkillByRateLessHP::Rate' has a wrong offset!");
static_assert(offsetof(MM_AutoBehaviorAIController_CanSkillByRateLessHP, ReturnValue) == 0x00000C, "Member 'MM_AutoBehaviorAIController_CanSkillByRateLessHP::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AutoBehaviorAIController.CanSkillByRateNoBuff
// 0x0010 (0x0010 - 0x0000)
struct MM_AutoBehaviorAIController_CanSkillByRateNoBuff final
{
public:
	int32                                         SkillId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BuffId;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rate;                                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MM_AutoBehaviorAIController_CanSkillByRateNoBuff) == 0x000004, "Wrong alignment on MM_AutoBehaviorAIController_CanSkillByRateNoBuff");
static_assert(sizeof(MM_AutoBehaviorAIController_CanSkillByRateNoBuff) == 0x000010, "Wrong size on MM_AutoBehaviorAIController_CanSkillByRateNoBuff");
static_assert(offsetof(MM_AutoBehaviorAIController_CanSkillByRateNoBuff, SkillId) == 0x000000, "Member 'MM_AutoBehaviorAIController_CanSkillByRateNoBuff::SkillId' has a wrong offset!");
static_assert(offsetof(MM_AutoBehaviorAIController_CanSkillByRateNoBuff, BuffId) == 0x000004, "Member 'MM_AutoBehaviorAIController_CanSkillByRateNoBuff::BuffId' has a wrong offset!");
static_assert(offsetof(MM_AutoBehaviorAIController_CanSkillByRateNoBuff, Rate) == 0x000008, "Member 'MM_AutoBehaviorAIController_CanSkillByRateNoBuff::Rate' has a wrong offset!");
static_assert(offsetof(MM_AutoBehaviorAIController_CanSkillByRateNoBuff, ReturnValue) == 0x00000C, "Member 'MM_AutoBehaviorAIController_CanSkillByRateNoBuff::ReturnValue' has a wrong offset!");

// Function MirMobile.MM_AutoBehaviorAIController.CanSkillByRateOverHP
// 0x0010 (0x0010 - 0x0000)
struct MM_AutoBehaviorAIController_CanSkillByRateOverHP final
{
public:
	int32                                         SkillId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
