#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_GameInstance_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MirMobile_structs.hpp"


namespace SDK::Params
{

// Function MM_GameInstance_BP.MM_GameInstance_BP_C.CalculateAttackDamage
// 0x0028 (0x0028 - 0x0000)
struct MM_GameInstance_BP_C_CalculateAttackDamage final
{
public:
	struct FATTACK_DATA                           ATTACK_DATA;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_________Damage;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM_GameInstance_BP_C_CalculateAttackDamage) == 0x000004, "Wrong alignment on MM_GameInstance_BP_C_CalculateAttackDamage");
static_assert(sizeof(MM_GameInstance_BP_C_CalculateAttackDamage) == 0x000028, "Wrong size on MM_GameInstance_BP_C_CalculateAttackDamage");
static_assert(offsetof(MM_GameInstance_BP_C_CalculateAttackDamage, ATTACK_DATA) == 0x000000, "Member 'MM_GameInstance_BP_C_CalculateAttackDamage::ATTACK_DATA' has a wrong offset!");
static_assert(offsetof(MM_GameInstance_BP_C_CalculateAttackDamage, ReturnValue) == 0x000020, "Member 'MM_GameInstance_BP_C_CalculateAttackDamage::ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_GameInstance_BP_C_CalculateAttackDamage, CallFunc_________Damage) == 0x000024, "Member 'MM_GameInstance_BP_C_CalculateAttackDamage::CallFunc_________Damage' has a wrong offset!");

// Function MM_GameInstance_BP.MM_GameInstance_BP_C.LoadLevelInstance
// 0x0040 (0x0040 - 0x0000)
struct MM_GameInstance_BP_C_LoadLevelInstance final
{
public:
	class FString                                 LevelName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class ULevelStreamingDynamic*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LoadLevelInstance_bOutSuccess;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreamingDynamic*                 CallFunc_LoadLevelInstance_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MM_GameInstance_BP_C_LoadLevelInstance) == 0x000008, "Wrong alignment on MM_GameInstance_BP_C_LoadLevelInstance");
static_assert(sizeof(MM_GameInstance_BP_C_LoadLevelInstance) == 0x000040, "Wrong size on MM_GameInstance_BP_C_LoadLevelInstance");
static_assert(offsetof(MM_GameInstance_BP_C_LoadLevelInstance, LevelName) == 0x000000, "Member 'MM_GameInstance_BP_C_LoadLevelInstance::LevelName' has a wrong offset!");
static_assert(offsetof(MM_GameInstance_BP_C_LoadLevelInstance, ReturnValue) == 0x000010, "Member 'MM_GameInstance_BP_C_LoadLevelInstance::ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_GameInstance_BP_C_LoadLevelInstance, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'MM_GameInstance_BP_C_LoadLevelInstance::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_GameInstance_BP_C_LoadLevelInstance, CallFunc_MakeVector_ReturnValue) == 0x000024, "Member 'MM_GameInstance_BP_C_LoadLevelInstance::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_GameInstance_BP_C_LoadLevelInstance, CallFunc_LoadLevelInstance_bOutSuccess) == 0x000030, "Member 'MM_GameInstance_BP_C_LoadLevelInstance::CallFunc_LoadLevelInstance_bOutSuccess' has a wrong offset!");
static_assert(offsetof(MM_GameInstance_BP_C_LoadLevelInstance, CallFunc_LoadLevelInstance_ReturnValue) == 0x000038, "Member 'MM_GameInstance_BP_C_LoadLevelInstance::CallFunc_LoadLevelInstance_ReturnValue' has a wrong offset!");

}

