#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OneStoreIap

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class OneStoreIap.OneStoreBlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UOneStoreBlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void OneStoreDisconnect();
	static bool OneStorePurchaseVerify(const class FString& PublicKey, const class FString& OriginalPurchaseData, const class FString& SignatureData);
	static void OneStoreShowMessage(const class FString& Title, const class FString& Message);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OneStoreBlueprintFunctionLibrary">();
	}
	static class UOneStoreBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOneStoreBlueprintFunctionLibrary>();
	}
};
static_assert(alignof(UOneStoreBlueprintFunctionLibrary) == 0x000008, "Wrong alignment on UOneStoreBlueprintFunctionLibrary");
static_assert(sizeof(UOneStoreBlueprintFunctionLibrary) == 0x000028, "Wrong size on UOneStoreBlueprintFunctionLibrary");

// Class OneStoreIap.OneStoreIapAcknowledgePurchaseFunction
// 0x0068 (0x0090 - 0x0028)
class UOneStoreIapAcknowledgePurchaseFunction final : public UOnlineBlueprintCallProxyBase
{
public:
	uint8                                         Pad_28[0x68];                                      // 0x0028(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UOneStoreIapAcknowledgePurchaseFunction* OneStoreIapAcknowledgePurchase(class UObject* WorldContextObject, const class FString& PurchaseData, const class FString& DevPayload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OneStoreIapAcknowledgePurchaseFunction">();
	}
	static class UOneStoreIapAcknowledgePurchaseFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOneStoreIapAcknowledgePurchaseFunction>();
	}
};
static_assert(alignof(UOneStoreIapAcknowledgePurchaseFunction) == 0x000008, "Wrong alignment on UOneStoreIapAcknowledgePurchaseFunction");
static_assert(sizeof(UOneStoreIapAcknowledgePurchaseFunction) == 0x000090, "Wrong size on UOneStoreIapAcknowledgePurchaseFunction");

// Class OneStoreIap.OneStoreIapBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UOneStoreIapBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float OneStoreIapSampleFunction(float Param);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OneStoreIapBPLibrary">();
	}
	static class UOneStoreIapBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOneStoreIapBPLibrary>();
	}
};
static_assert(alignof(UOneStoreIapBPLibrary) == 0x000008, "Wrong alignment on UOneStoreIapBPLibrary");
static_assert(sizeof(UOneStoreIapBPLibrary) == 0x000028, "Wrong size on UOneStoreIapBPLibrary");

// Class OneStoreIap.OneStoreIapConsumePurchaseFunction
// 0x0068 (0x0090 - 0x0028)
class UOneStoreIapConsumePurchaseFunction final : public UOnlineBlueprintCallProxyBase
{
public:
	uint8                                         Pad_28[0x68];                                      // 0x0028(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UOneStoreIapConsumePurchaseFunction* OneStoreIapConsumePurchase(class UObject* WorldContextObject, const class FString& PurchaseData, const class FString& DevPayload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OneStoreIapConsumePurchaseFunction">();
	}
	static class UOneStoreIapConsumePurchaseFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOneStoreIapConsumePurchaseFunction>();
	}
};
static_assert(alignof(UOneStoreIapConsumePurchaseFunction) == 0x000008, "Wrong alignment on UOneStoreIapConsumePurchaseFunction");
static_assert(sizeof(UOneStoreIapConsumePurchaseFunction) == 0x000090, "Wrong size on UOneStoreIapConsumePurchaseFunction");

// Class OneStoreIap.OneStoreIapGetPurchaseFunction
// 0x0058 (0x0080 - 0x0028)
class UOneStoreIapGetPurchaseFunction final : public UOnlineBlueprintCallProxyBase
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UOneStoreIapGetPurchaseFunction* OneStoreIapPurchaseInfo(class UObject* WorldContextObject, const class FString& ProductType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OneStoreIapGetPurchaseFunction">();
	}
	static class UOneStoreIapGetPurchaseFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOneStoreIapGetPurchaseFunction>();
	}
};
static_assert(alignof(UOneStoreIapGetPurchaseFunction) == 0x000008, "Wrong alignment on UOneStoreIapGetPurchaseFunction");
static_assert(sizeof(UOneStoreIapGetPurchaseFunction) == 0x000080, "Wrong size on UOneStoreIapGetPurchaseFunction");

// Class OneStoreIap.OneStoreIapGetStoreCodeFunction
// 0x0048 (0x0070 - 0x0028)
class UOneStoreIapGetStoreCodeFunction final : public UOnlineBlueprintCallProxyBase
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UOneStoreIapGetStoreCodeFunction* OneStoreIapGetStoreCode(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OneStoreIapGetStoreCodeFunction">();
	}
	static class UOneStoreIapGetStoreCodeFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOneStoreIapGetStoreCodeFunction>();
	}
};
static_assert(alignof(UOneStoreIapGetStoreCodeFunction) == 0x000008, "Wrong alignment on UOneStoreIapGetStoreCodeFunction");
static_assert(sizeof(UOneStoreIapGetStoreCodeFunction) == 0x000070, "Wrong size on UOneStoreIapGetStoreCodeFunction");

// Class OneStoreIap.OneStoreIapManageRecurringFunction
// 0x0058 (0x0080 - 0x0028)
class UOneStoreIapManageRecurringFunction final : public UOnlineBlueprintCallProxyBase
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UOneStoreIapManageRecurringFunction* OneStoreIapManageRecurring(class UObject* WorldContextObject, const class FString& PurchaseData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OneStoreIapManageRecurringFunction">();
	}
	static class UOneStoreIapManageRecurringFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOneStoreIapManageRecurringFunction>();
	}
};
static_assert(alignof(UOneStoreIapManageRecurringFunction) == 0x000008, "Wrong alignment on UOneStoreIapManageRecurringFunction");
static_assert(sizeof(UOneStoreIapManageRecurringFunction) == 0x000080, "Wrong size on UOneStoreIapManageRecurringFunction");

// Class OneStoreIap.OneStoreIapProductDetailsFunction
// 0x0068 (0x0090 - 0x0028)
class UOneStoreIapProductDetailsFunction final : public UOnlineBlueprintCallProxyBase
{
public:
	uint8                                         Pad_28[0x68];                                      // 0x0028(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UOneStoreIapProductDetailsFunction* OneStoreIapGetProductDetails(class UObject* WorldContextObject, const class FString& ProductType, const TArray<class FString>& ProductList);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OneStoreIapProductDetailsFunction">();
	}
	static class UOneStoreIapProductDetailsFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOneStoreIapProductDetailsFunction>();
	}
};
static_assert(alignof(UOneStoreIapProductDetailsFunction) == 0x000008, "Wrong alignment on UOneStoreIapProductDetailsFunction");
static_assert(sizeof(UOneStoreIapProductDetailsFunction) == 0x000090, "Wrong size on UOneStoreIapProductDetailsFunction");

// Class OneStoreIap.OneStoreIapRequestLoginFunction
// 0x0028 (0x0050 - 0x0028)
class UOneStoreIapRequestLoginFunction final : public UOnlineBlueprintCallProxyBase
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UOneStoreIapRequestLoginFunction* OneStoreIapRequestLogin(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OneStoreIapRequestLoginFunction">();
	}
	static class UOneStoreIapRequestLoginFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOneStoreIapRequestLoginFunction>();
	}
};
static_assert(alignof(UOneStoreIapRequestLoginFunction) == 0x000008, "Wrong alignment on UOneStoreIapRequestLoginFunction");
static_assert(sizeof(UOneStoreIapRequestLoginFunction) == 0x000050, "Wrong size on UOneStoreIapRequestLoginFunction");

// Class OneStoreIap.OneStoreIapRequestPurchaseFunction
// 0x0088 (0x00B0 - 0x0028)
class UOneStoreIapRequestPurchaseFunction final : public UOnlineBlueprintCallProxyBase
{
public:
	uint8                                         Pad_28[0x88];                                      // 0x0028(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UOneStoreIapRequestPurchaseFunction* OneStoreIapRequestPurchase(class UObject* WorldContextObject, const class FString& ProductType, const class FString& ProductId, const class FString& ProductName, const class FString& DevPayload);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OneStoreIapRequestPurchaseFunction">();
	}
	static class UOneStoreIapRequestPurchaseFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOneStoreIapRequestPurchaseFunction>();
	}
};
static_assert(alignof(UOneStoreIapRequestPurchaseFunction) == 0x000008, "Wrong alignment on UOneStoreIapRequestPurchaseFunction");
static_assert(sizeof(UOneStoreIapRequestPurchaseFunction) == 0x0000B0, "Wrong size on UOneStoreIapRequestPurchaseFunction");

// Class OneStoreIap.OneStoreIapRequestUpdateFunction
// 0x0028 (0x0050 - 0x0028)
class UOneStoreIapRequestUpdateFunction final : public UOnlineBlueprintCallProxyBase
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UOneStoreIapRequestUpdateFunction* OneStoreIapRequestUpdate(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OneStoreIapRequestUpdateFunction">();
	}
	static class UOneStoreIapRequestUpdateFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOneStoreIapRequestUpdateFunction>();
	}
};
static_assert(alignof(UOneStoreIapRequestUpdateFunction) == 0x000008, "Wrong alignment on UOneStoreIapRequestUpdateFunction");
static_assert(sizeof(UOneStoreIapRequestUpdateFunction) == 0x000050, "Wrong size on UOneStoreIapRequestUpdateFunction");

}

