#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystemExtendedApple

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class OnlineSubsystemExtendedApple.AppleLogin
// 0x0028 (0x0058 - 0x0030)
class UAppleLogin final : public UBlueprintAsyncActionBase
{
public:
	UMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_             OnFail;                                            // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAppleLogin* AppleLogin();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppleLogin">();
	}
	static class UAppleLogin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppleLogin>();
	}
};
static_assert(alignof(UAppleLogin) == 0x000008, "Wrong alignment on UAppleLogin");
static_assert(sizeof(UAppleLogin) == 0x000058, "Wrong size on UAppleLogin");
static_assert(offsetof(UAppleLogin, OnSuccess) == 0x000030, "Member 'UAppleLogin::OnSuccess' has a wrong offset!");
static_assert(offsetof(UAppleLogin, OnFail) == 0x000040, "Member 'UAppleLogin::OnFail' has a wrong offset!");

// Class OnlineSubsystemExtendedApple.OnlineSubsystemExtendedAppleBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UOnlineSubsystemExtendedAppleBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ChangeActiveWidget(class UCanvasPanel* ActiveWidget);
	static bool CheckIfPlayerLoggedIn();
	static class FString GetAccessToken();
	static bool GetAllCachedAppleUsersInfo(TArray<struct FAppleProfile>* Users);
	static struct FAppleProfile GetCachedAppleUserInfo(const class FString& UserID);
	static class FString GetUserId();
	static class FString GetUsername();
	static void ResetActiveWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineSubsystemExtendedAppleBlueprintLibrary">();
	}
	static class UOnlineSubsystemExtendedAppleBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineSubsystemExtendedAppleBlueprintLibrary>();
	}
};
static_assert(alignof(UOnlineSubsystemExtendedAppleBlueprintLibrary) == 0x000008, "Wrong alignment on UOnlineSubsystemExtendedAppleBlueprintLibrary");
static_assert(sizeof(UOnlineSubsystemExtendedAppleBlueprintLibrary) == 0x000028, "Wrong size on UOnlineSubsystemExtendedAppleBlueprintLibrary");

// Class OnlineSubsystemExtendedApple.OnlineSubsystemExtendedAppleWebBrowser
// 0x0038 (0x0140 - 0x0108)
class UOnlineSubsystemExtendedAppleWebBrowser final : public UWidget
{
public:
	UMulticastInlineDelegateProperty_             OnUrlChanged;                                      // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 InitialURL;                                        // 0x0118(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSupportsTransparency;                             // 0x0128(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_129[0x17];                                     // 0x0129(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EnableIME();
	void LoadURL(const class FString& NewURL);
	void OnUrlChanged__DelegateSignature(const class FText& Text);
	void SetFocusToBrowser();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineSubsystemExtendedAppleWebBrowser">();
	}
	static class UOnlineSubsystemExtendedAppleWebBrowser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineSubsystemExtendedAppleWebBrowser>();
	}
};
static_assert(alignof(UOnlineSubsystemExtendedAppleWebBrowser) == 0x000008, "Wrong alignment on UOnlineSubsystemExtendedAppleWebBrowser");
static_assert(sizeof(UOnlineSubsystemExtendedAppleWebBrowser) == 0x000140, "Wrong size on UOnlineSubsystemExtendedAppleWebBrowser");
static_assert(offsetof(UOnlineSubsystemExtendedAppleWebBrowser, OnUrlChanged) == 0x000108, "Member 'UOnlineSubsystemExtendedAppleWebBrowser::OnUrlChanged' has a wrong offset!");
static_assert(offsetof(UOnlineSubsystemExtendedAppleWebBrowser, InitialURL) == 0x000118, "Member 'UOnlineSubsystemExtendedAppleWebBrowser::InitialURL' has a wrong offset!");
static_assert(offsetof(UOnlineSubsystemExtendedAppleWebBrowser, bSupportsTransparency) == 0x000128, "Member 'UOnlineSubsystemExtendedAppleWebBrowser::bSupportsTransparency' has a wrong offset!");

// Class OnlineSubsystemExtendedApple.OnlineSubsystemExtendedAppleWidget
// 0x0048 (0x0288 - 0x0240)
class UOnlineSubsystemExtendedAppleWidget final : public UUserWidget
{
public:
	class UOnlineSubsystemExtendedAppleWebBrowser* WebBrowser;                                        // 0x0240(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_248[0x30];                                     // 0x0248(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UButton*                                M_Btn_Close;                                       // 0x0278(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EnableCustomStyle(bool bEnable);
	void HandleOnUrlChanged(const class FText& Text);
	void OnClickClose();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineSubsystemExtendedAppleWidget">();
	}
	static class UOnlineSubsystemExtendedAppleWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineSubsystemExtendedAppleWidget>();
	}
};
static_assert(alignof(UOnlineSubsystemExtendedAppleWidget) == 0x000008, "Wrong alignment on UOnlineSubsystemExtendedAppleWidget");
static_assert(sizeof(UOnlineSubsystemExtendedAppleWidget) == 0x000288, "Wrong size on UOnlineSubsystemExtendedAppleWidget");
static_assert(offsetof(UOnlineSubsystemExtendedAppleWidget, WebBrowser) == 0x000240, "Member 'UOnlineSubsystemExtendedAppleWidget::WebBrowser' has a wrong offset!");
static_assert(offsetof(UOnlineSubsystemExtendedAppleWidget, M_Btn_Close) == 0x000278, "Member 'UOnlineSubsystemExtendedAppleWidget::M_Btn_Close' has a wrong offset!");

}

