#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystemExtendedSteam

#include "Basic.hpp"


namespace SDK
{

// Enum OnlineSubsystemExtendedSteam.ESteamRequestMethod
// NumValues: 0x0003
enum class ESteamRequestMethod : uint8
{
	GET                                      = 0,
	POST                                     = 1,
	ESteamRequestMethod_MAX                  = 2,
};

// ScriptStruct OnlineSubsystemExtendedSteam.SteamProfile
// 0x0060 (0x0060 - 0x0000)
struct FSteamProfile final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Email;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FullName;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GivenName;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FamilyName;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProfileURL;                                        // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSteamProfile) == 0x000008, "Wrong alignment on FSteamProfile");
static_assert(sizeof(FSteamProfile) == 0x000060, "Wrong size on FSteamProfile");
static_assert(offsetof(FSteamProfile, ID) == 0x000000, "Member 'FSteamProfile::ID' has a wrong offset!");
static_assert(offsetof(FSteamProfile, Email) == 0x000010, "Member 'FSteamProfile::Email' has a wrong offset!");
static_assert(offsetof(FSteamProfile, FullName) == 0x000020, "Member 'FSteamProfile::FullName' has a wrong offset!");
static_assert(offsetof(FSteamProfile, GivenName) == 0x000030, "Member 'FSteamProfile::GivenName' has a wrong offset!");
static_assert(offsetof(FSteamProfile, FamilyName) == 0x000040, "Member 'FSteamProfile::FamilyName' has a wrong offset!");
static_assert(offsetof(FSteamProfile, ProfileURL) == 0x000050, "Member 'FSteamProfile::ProfileURL' has a wrong offset!");

}

