#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystemExtendedSteam

#include "Basic.hpp"

#include "OnlineSubsystemExtendedSteam_structs.hpp"


namespace SDK::Params
{

// Function OnlineSubsystemExtendedSteam.OnlineSubsystemExtendedSteamBlueprintLibrary.ChangeActiveWidget
// 0x0008 (0x0008 - 0x0000)
struct OnlineSubsystemExtendedSteamBlueprintLibrary_ChangeActiveWidget final
{
public:
	class UCanvasPanel*                           ActiveWidget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedSteamBlueprintLibrary_ChangeActiveWidget) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedSteamBlueprintLibrary_ChangeActiveWidget");
static_assert(sizeof(OnlineSubsystemExtendedSteamBlueprintLibrary_ChangeActiveWidget) == 0x000008, "Wrong size on OnlineSubsystemExtendedSteamBlueprintLibrary_ChangeActiveWidget");
static_assert(offsetof(OnlineSubsystemExtendedSteamBlueprintLibrary_ChangeActiveWidget, ActiveWidget) == 0x000000, "Member 'OnlineSubsystemExtendedSteamBlueprintLibrary_ChangeActiveWidget::ActiveWidget' has a wrong offset!");

// Function OnlineSubsystemExtendedSteam.OnlineSubsystemExtendedSteamBlueprintLibrary.CheckIfPlayerLoggedIn
// 0x0001 (0x0001 - 0x0000)
struct OnlineSubsystemExtendedSteamBlueprintLibrary_CheckIfPlayerLoggedIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedSteamBlueprintLibrary_CheckIfPlayerLoggedIn) == 0x000001, "Wrong alignment on OnlineSubsystemExtendedSteamBlueprintLibrary_CheckIfPlayerLoggedIn");
static_assert(sizeof(OnlineSubsystemExtendedSteamBlueprintLibrary_CheckIfPlayerLoggedIn) == 0x000001, "Wrong size on OnlineSubsystemExtendedSteamBlueprintLibrary_CheckIfPlayerLoggedIn");
static_assert(offsetof(OnlineSubsystemExtendedSteamBlueprintLibrary_CheckIfPlayerLoggedIn, ReturnValue) == 0x000000, "Member 'OnlineSubsystemExtendedSteamBlueprintLibrary_CheckIfPlayerLoggedIn::ReturnValue' has a wrong offset!");

// Function OnlineSubsystemExtendedSteam.OnlineSubsystemExtendedSteamBlueprintLibrary.GetAccessToken
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystemExtendedSteamBlueprintLibrary_GetAccessToken final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedSteamBlueprintLibrary_GetAccessToken) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedSteamBlueprintLibrary_GetAccessToken");
static_assert(sizeof(OnlineSubsystemExtendedSteamBlueprintLibrary_GetAccessToken) == 0x000010, "Wrong size on OnlineSubsystemExtendedSteamBlueprintLibrary_GetAccessToken");
static_assert(offsetof(OnlineSubsystemExtendedSteamBlueprintLibrary_GetAccessToken, ReturnValue) == 0x000000, "Member 'OnlineSubsystemExtendedSteamBlueprintLibrary_GetAccessToken::ReturnValue' has a wrong offset!");

// Function OnlineSubsystemExtendedSteam.OnlineSubsystemExtendedSteamBlueprintLibrary.GetAllCachedSteamUsersInfo
// 0x0018 (0x0018 - 0x0000)
struct OnlineSubsystemExtendedSteamBlueprintLibrary_GetAllCachedSteamUsersInfo final
{
public:
	TArray<struct FSteamProfile>                  Users;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OnlineSubsystemExtendedSteamBlueprintLibrary_GetAllCachedSteamUsersInfo) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedSteamBlueprintLibrary_GetAllCachedSteamUsersInfo");
static_assert(sizeof(OnlineSubsystemExtendedSteamBlueprintLibrary_GetAllCachedSteamUsersInfo) == 0x000018, "Wrong size on OnlineSubsystemExtendedSteamBlueprintLibrary_GetAllCachedSteamUsersInfo");
static_assert(offsetof(OnlineSubsystemExtendedSteamBlueprintLibrary_GetAllCachedSteamUsersInfo, Users) == 0x000000, "Member 'OnlineSubsystemExtendedSteamBlueprintLibrary_GetAllCachedSteamUsersInfo::Users' has a wrong offset!");
static_assert(offsetof(OnlineSubsystemExtendedSteamBlueprintLibrary_GetAllCachedSteamUsersInfo, ReturnValue) == 0x000010, "Member 'OnlineSubsystemExtendedSteamBlueprintLibrary_GetAllCachedSteamUsersInfo::ReturnValue' has a wrong offset!");

// Function OnlineSubsystemExtendedSteam.OnlineSubsystemExtendedSteamBlueprintLibrary.GetCachedSteamUserInfo
// 0x0070 (0x0070 - 0x0000)
struct OnlineSubsystemExtendedSteamBlueprintLibrary_GetCachedSteamUserInfo final
{
public:
	class FString                                 UserID;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSteamProfile                          ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedSteamBlueprintLibrary_GetCachedSteamUserInfo) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedSteamBlueprintLibrary_GetCachedSteamUserInfo");
static_assert(sizeof(OnlineSubsystemExtendedSteamBlueprintLibrary_GetCachedSteamUserInfo) == 0x000070, "Wrong size on OnlineSubsystemExtendedSteamBlueprintLibrary_GetCachedSteamUserInfo");
static_assert(offsetof(OnlineSubsystemExtendedSteamBlueprintLibrary_GetCachedSteamUserInfo, UserID) == 0x000000, "Member 'OnlineSubsystemExtendedSteamBlueprintLibrary_GetCachedSteamUserInfo::UserID' has a wrong offset!");
static_assert(offsetof(OnlineSubsystemExtendedSteamBlueprintLibrary_GetCachedSteamUserInfo, ReturnValue) == 0x000010, "Member 'OnlineSubsystemExtendedSteamBlueprintLibrary_GetCachedSteamUserInfo::ReturnValue' has a wrong offset!");

// Function OnlineSubsystemExtendedSteam.OnlineSubsystemExtendedSteamBlueprintLibrary.GetUserId
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystemExtendedSteamBlueprintLibrary_GetUserId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedSteamBlueprintLibrary_GetUserId) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedSteamBlueprintLibrary_GetUserId");
static_assert(sizeof(OnlineSubsystemExtendedSteamBlueprintLibrary_GetUserId) == 0x000010, "Wrong size on OnlineSubsystemExtendedSteamBlueprintLibrary_GetUserId");
static_assert(offsetof(OnlineSubsystemExtendedSteamBlueprintLibrary_GetUserId, ReturnValue) == 0x000000, "Member 'OnlineSubsystemExtendedSteamBlueprintLibrary_GetUserId::ReturnValue' has a wrong offset!");

// Function OnlineSubsystemExtendedSteam.OnlineSubsystemExtendedSteamBlueprintLibrary.GetUsername
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystemExtendedSteamBlueprintLibrary_GetUsername final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedSteamBlueprintLibrary_GetUsername) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedSteamBlueprintLibrary_GetUsername");
static_assert(sizeof(OnlineSubsystemExtendedSteamBlueprintLibrary_GetUsername) == 0x000010, "Wrong size on OnlineSubsystemExtendedSteamBlueprintLibrary_GetUsername");
static_assert(offsetof(OnlineSubsystemExtendedSteamBlueprintLibrary_GetUsername, ReturnValue) == 0x000000, "Member 'OnlineSubsystemExtendedSteamBlueprintLibrary_GetUsername::ReturnValue' has a wrong offset!");

// Function OnlineSubsystemExtendedSteam.OnlineSubsystemExtendedSteamWebBrowser.LoadURL
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystemExtendedSteamWebBrowser_LoadURL final
{
public:
	class FString                                 NewURL;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedSteamWebBrowser_LoadURL) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedSteamWebBrowser_LoadURL");
static_assert(sizeof(OnlineSubsystemExtendedSteamWebBrowser_LoadURL) == 0x000010, "Wrong size on OnlineSubsystemExtendedSteamWebBrowser_LoadURL");
static_assert(offsetof(OnlineSubsystemExtendedSteamWebBrowser_LoadURL, NewURL) == 0x000000, "Member 'OnlineSubsystemExtendedSteamWebBrowser_LoadURL::NewURL' has a wrong offset!");

// DelegateFunction OnlineSubsystemExtendedSteam.OnlineSubsystemExtendedSteamWebBrowser.OnUrlChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct OnlineSubsystemExtendedSteamWebBrowser_OnUrlChanged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedSteamWebBrowser_OnUrlChanged__DelegateSignature) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedSteamWebBrowser_OnUrlChanged__DelegateSignature");
static_assert(sizeof(OnlineSubsystemExtendedSteamWebBrowser_OnUrlChanged__DelegateSignature) == 0x000018, "Wrong size on OnlineSubsystemExtendedSteamWebBrowser_OnUrlChanged__DelegateSignature");
static_assert(offsetof(OnlineSubsystemExtendedSteamWebBrowser_OnUrlChanged__DelegateSignature, Text) == 0x000000, "Member 'OnlineSubsystemExtendedSteamWebBrowser_OnUrlChanged__DelegateSignature::Text' has a wrong offset!");

// Function OnlineSubsystemExtendedSteam.OnlineSubsystemExtendedSteamWidget.EnableCustomStyle
// 0x0001 (0x0001 - 0x0000)
struct OnlineSubsystemExtendedSteamWidget_EnableCustomStyle final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedSteamWidget_EnableCustomStyle) == 0x000001, "Wrong alignment on OnlineSubsystemExtendedSteamWidget_EnableCustomStyle");
static_assert(sizeof(OnlineSubsystemExtendedSteamWidget_EnableCustomStyle) == 0x000001, "Wrong size on OnlineSubsystemExtendedSteamWidget_EnableCustomStyle");
static_assert(offsetof(OnlineSubsystemExtendedSteamWidget_EnableCustomStyle, bEnable) == 0x000000, "Member 'OnlineSubsystemExtendedSteamWidget_EnableCustomStyle::bEnable' has a wrong offset!");

// Function OnlineSubsystemExtendedSteam.OnlineSubsystemExtendedSteamWidget.HandleOnUrlChanged
// 0x0018 (0x0018 - 0x0000)
struct OnlineSubsystemExtendedSteamWidget_HandleOnUrlChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedSteamWidget_HandleOnUrlChanged) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedSteamWidget_HandleOnUrlChanged");
static_assert(sizeof(OnlineSubsystemExtendedSteamWidget_HandleOnUrlChanged) == 0x000018, "Wrong size on OnlineSubsystemExtendedSteamWidget_HandleOnUrlChanged");
static_assert(offsetof(OnlineSubsystemExtendedSteamWidget_HandleOnUrlChanged, Text) == 0x000000, "Member 'OnlineSubsystemExtendedSteamWidget_HandleOnUrlChanged::Text' has a wrong offset!");

// Function OnlineSubsystemExtendedSteam.SteamLogin.SteamLogin
// 0x0008 (0x0008 - 0x0000)
struct SteamLogin_SteamLogin final
{
public:
	class USteamLogin*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SteamLogin_SteamLogin) == 0x000008, "Wrong alignment on SteamLogin_SteamLogin");
static_assert(sizeof(SteamLogin_SteamLogin) == 0x000008, "Wrong size on SteamLogin_SteamLogin");
static_assert(offsetof(SteamLogin_SteamLogin, ReturnValue) == 0x000000, "Member 'SteamLogin_SteamLogin::ReturnValue' has a wrong offset!");

}

