#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystemExtendedApple

#include "Basic.hpp"

#include "OnlineSubsystemExtendedApple_structs.hpp"


namespace SDK::Params
{

// Function OnlineSubsystemExtendedApple.AppleLogin.AppleLogin
// 0x0008 (0x0008 - 0x0000)
struct AppleLogin_AppleLogin final
{
public:
	class UAppleLogin*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AppleLogin_AppleLogin) == 0x000008, "Wrong alignment on AppleLogin_AppleLogin");
static_assert(sizeof(AppleLogin_AppleLogin) == 0x000008, "Wrong size on AppleLogin_AppleLogin");
static_assert(offsetof(AppleLogin_AppleLogin, ReturnValue) == 0x000000, "Member 'AppleLogin_AppleLogin::ReturnValue' has a wrong offset!");

// Function OnlineSubsystemExtendedApple.OnlineSubsystemExtendedAppleBlueprintLibrary.ChangeActiveWidget
// 0x0008 (0x0008 - 0x0000)
struct OnlineSubsystemExtendedAppleBlueprintLibrary_ChangeActiveWidget final
{
public:
	class UCanvasPanel*                           ActiveWidget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedAppleBlueprintLibrary_ChangeActiveWidget) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedAppleBlueprintLibrary_ChangeActiveWidget");
static_assert(sizeof(OnlineSubsystemExtendedAppleBlueprintLibrary_ChangeActiveWidget) == 0x000008, "Wrong size on OnlineSubsystemExtendedAppleBlueprintLibrary_ChangeActiveWidget");
static_assert(offsetof(OnlineSubsystemExtendedAppleBlueprintLibrary_ChangeActiveWidget, ActiveWidget) == 0x000000, "Member 'OnlineSubsystemExtendedAppleBlueprintLibrary_ChangeActiveWidget::ActiveWidget' has a wrong offset!");

// Function OnlineSubsystemExtendedApple.OnlineSubsystemExtendedAppleBlueprintLibrary.CheckIfPlayerLoggedIn
// 0x0001 (0x0001 - 0x0000)
struct OnlineSubsystemExtendedAppleBlueprintLibrary_CheckIfPlayerLoggedIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedAppleBlueprintLibrary_CheckIfPlayerLoggedIn) == 0x000001, "Wrong alignment on OnlineSubsystemExtendedAppleBlueprintLibrary_CheckIfPlayerLoggedIn");
static_assert(sizeof(OnlineSubsystemExtendedAppleBlueprintLibrary_CheckIfPlayerLoggedIn) == 0x000001, "Wrong size on OnlineSubsystemExtendedAppleBlueprintLibrary_CheckIfPlayerLoggedIn");
static_assert(offsetof(OnlineSubsystemExtendedAppleBlueprintLibrary_CheckIfPlayerLoggedIn, ReturnValue) == 0x000000, "Member 'OnlineSubsystemExtendedAppleBlueprintLibrary_CheckIfPlayerLoggedIn::ReturnValue' has a wrong offset!");

// Function OnlineSubsystemExtendedApple.OnlineSubsystemExtendedAppleBlueprintLibrary.GetAccessToken
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystemExtendedAppleBlueprintLibrary_GetAccessToken final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedAppleBlueprintLibrary_GetAccessToken) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedAppleBlueprintLibrary_GetAccessToken");
static_assert(sizeof(OnlineSubsystemExtendedAppleBlueprintLibrary_GetAccessToken) == 0x000010, "Wrong size on OnlineSubsystemExtendedAppleBlueprintLibrary_GetAccessToken");
static_assert(offsetof(OnlineSubsystemExtendedAppleBlueprintLibrary_GetAccessToken, ReturnValue) == 0x000000, "Member 'OnlineSubsystemExtendedAppleBlueprintLibrary_GetAccessToken::ReturnValue' has a wrong offset!");

// Function OnlineSubsystemExtendedApple.OnlineSubsystemExtendedAppleBlueprintLibrary.GetAllCachedAppleUsersInfo
// 0x0018 (0x0018 - 0x0000)
struct OnlineSubsystemExtendedAppleBlueprintLibrary_GetAllCachedAppleUsersInfo final
{
public:
	TArray<struct FAppleProfile>                  Users;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OnlineSubsystemExtendedAppleBlueprintLibrary_GetAllCachedAppleUsersInfo) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedAppleBlueprintLibrary_GetAllCachedAppleUsersInfo");
static_assert(sizeof(OnlineSubsystemExtendedAppleBlueprintLibrary_GetAllCachedAppleUsersInfo) == 0x000018, "Wrong size on OnlineSubsystemExtendedAppleBlueprintLibrary_GetAllCachedAppleUsersInfo");
static_assert(offsetof(OnlineSubsystemExtendedAppleBlueprintLibrary_GetAllCachedAppleUsersInfo, Users) == 0x000000, "Member 'OnlineSubsystemExtendedAppleBlueprintLibrary_GetAllCachedAppleUsersInfo::Users' has a wrong offset!");
static_assert(offsetof(OnlineSubsystemExtendedAppleBlueprintLibrary_GetAllCachedAppleUsersInfo, ReturnValue) == 0x000010, "Member 'OnlineSubsystemExtendedAppleBlueprintLibrary_GetAllCachedAppleUsersInfo::ReturnValue' has a wrong offset!");

// Function OnlineSubsystemExtendedApple.OnlineSubsystemExtendedAppleBlueprintLibrary.GetCachedAppleUserInfo
// 0x0070 (0x0070 - 0x0000)
struct OnlineSubsystemExtendedAppleBlueprintLibrary_GetCachedAppleUserInfo final
{
public:
	class FString                                 UserID;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAppleProfile                          ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedAppleBlueprintLibrary_GetCachedAppleUserInfo) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedAppleBlueprintLibrary_GetCachedAppleUserInfo");
static_assert(sizeof(OnlineSubsystemExtendedAppleBlueprintLibrary_GetCachedAppleUserInfo) == 0x000070, "Wrong size on OnlineSubsystemExtendedAppleBlueprintLibrary_GetCachedAppleUserInfo");
static_assert(offsetof(OnlineSubsystemExtendedAppleBlueprintLibrary_GetCachedAppleUserInfo, UserID) == 0x000000, "Member 'OnlineSubsystemExtendedAppleBlueprintLibrary_GetCachedAppleUserInfo::UserID' has a wrong offset!");
static_assert(offsetof(OnlineSubsystemExtendedAppleBlueprintLibrary_GetCachedAppleUserInfo, ReturnValue) == 0x000010, "Member 'OnlineSubsystemExtendedAppleBlueprintLibrary_GetCachedAppleUserInfo::ReturnValue' has a wrong offset!");

// Function OnlineSubsystemExtendedApple.OnlineSubsystemExtendedAppleBlueprintLibrary.GetUserId
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystemExtendedAppleBlueprintLibrary_GetUserId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedAppleBlueprintLibrary_GetUserId) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedAppleBlueprintLibrary_GetUserId");
static_assert(sizeof(OnlineSubsystemExtendedAppleBlueprintLibrary_GetUserId) == 0x000010, "Wrong size on OnlineSubsystemExtendedAppleBlueprintLibrary_GetUserId");
static_assert(offsetof(OnlineSubsystemExtendedAppleBlueprintLibrary_GetUserId, ReturnValue) == 0x000000, "Member 'OnlineSubsystemExtendedAppleBlueprintLibrary_GetUserId::ReturnValue' has a wrong offset!");

// Function OnlineSubsystemExtendedApple.OnlineSubsystemExtendedAppleBlueprintLibrary.GetUsername
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystemExtendedAppleBlueprintLibrary_GetUsername final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedAppleBlueprintLibrary_GetUsername) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedAppleBlueprintLibrary_GetUsername");
static_assert(sizeof(OnlineSubsystemExtendedAppleBlueprintLibrary_GetUsername) == 0x000010, "Wrong size on OnlineSubsystemExtendedAppleBlueprintLibrary_GetUsername");
static_assert(offsetof(OnlineSubsystemExtendedAppleBlueprintLibrary_GetUsername, ReturnValue) == 0x000000, "Member 'OnlineSubsystemExtendedAppleBlueprintLibrary_GetUsername::ReturnValue' has a wrong offset!");

// Function OnlineSubsystemExtendedApple.OnlineSubsystemExtendedAppleWebBrowser.LoadURL
// 0x0010 (0x0010 - 0x0000)
struct OnlineSubsystemExtendedAppleWebBrowser_LoadURL final
{
public:
	class FString                                 NewURL;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedAppleWebBrowser_LoadURL) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedAppleWebBrowser_LoadURL");
static_assert(sizeof(OnlineSubsystemExtendedAppleWebBrowser_LoadURL) == 0x000010, "Wrong size on OnlineSubsystemExtendedAppleWebBrowser_LoadURL");
static_assert(offsetof(OnlineSubsystemExtendedAppleWebBrowser_LoadURL, NewURL) == 0x000000, "Member 'OnlineSubsystemExtendedAppleWebBrowser_LoadURL::NewURL' has a wrong offset!");

// DelegateFunction OnlineSubsystemExtendedApple.OnlineSubsystemExtendedAppleWebBrowser.OnUrlChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct OnlineSubsystemExtendedAppleWebBrowser_OnUrlChanged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedAppleWebBrowser_OnUrlChanged__DelegateSignature) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedAppleWebBrowser_OnUrlChanged__DelegateSignature");
static_assert(sizeof(OnlineSubsystemExtendedAppleWebBrowser_OnUrlChanged__DelegateSignature) == 0x000018, "Wrong size on OnlineSubsystemExtendedAppleWebBrowser_OnUrlChanged__DelegateSignature");
static_assert(offsetof(OnlineSubsystemExtendedAppleWebBrowser_OnUrlChanged__DelegateSignature, Text) == 0x000000, "Member 'OnlineSubsystemExtendedAppleWebBrowser_OnUrlChanged__DelegateSignature::Text' has a wrong offset!");

// Function OnlineSubsystemExtendedApple.OnlineSubsystemExtendedAppleWidget.EnableCustomStyle
// 0x0001 (0x0001 - 0x0000)
struct OnlineSubsystemExtendedAppleWidget_EnableCustomStyle final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedAppleWidget_EnableCustomStyle) == 0x000001, "Wrong alignment on OnlineSubsystemExtendedAppleWidget_EnableCustomStyle");
static_assert(sizeof(OnlineSubsystemExtendedAppleWidget_EnableCustomStyle) == 0x000001, "Wrong size on OnlineSubsystemExtendedAppleWidget_EnableCustomStyle");
static_assert(offsetof(OnlineSubsystemExtendedAppleWidget_EnableCustomStyle, bEnable) == 0x000000, "Member 'OnlineSubsystemExtendedAppleWidget_EnableCustomStyle::bEnable' has a wrong offset!");

// Function OnlineSubsystemExtendedApple.OnlineSubsystemExtendedAppleWidget.HandleOnUrlChanged
// 0x0018 (0x0018 - 0x0000)
struct OnlineSubsystemExtendedAppleWidget_HandleOnUrlChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSubsystemExtendedAppleWidget_HandleOnUrlChanged) == 0x000008, "Wrong alignment on OnlineSubsystemExtendedAppleWidget_HandleOnUrlChanged");
static_assert(sizeof(OnlineSubsystemExtendedAppleWidget_HandleOnUrlChanged) == 0x000018, "Wrong size on OnlineSubsystemExtendedAppleWidget_HandleOnUrlChanged");
static_assert(offsetof(OnlineSubsystemExtendedAppleWidget_HandleOnUrlChanged, Text) == 0x000000, "Member 'OnlineSubsystemExtendedAppleWidget_HandleOnUrlChanged::Text' has a wrong offset!");

}

