#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystemExtendedGoogle

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class OnlineSubsystemExtendedGoogle.GoogleLogin
// 0x0028 (0x0058 - 0x0030)
class UGoogleLogin final : public UBlueprintAsyncActionBase
{
public:
	UMulticastInlineDelegateProperty_             OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastInlineDelegateProperty_             OnFail;                                            // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UGoogleLogin* GoogleLogin();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GoogleLogin">();
	}
	static class UGoogleLogin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGoogleLogin>();
	}
};
static_assert(alignof(UGoogleLogin) == 0x000008, "Wrong alignment on UGoogleLogin");
static_assert(sizeof(UGoogleLogin) == 0x000058, "Wrong size on UGoogleLogin");
static_assert(offsetof(UGoogleLogin, OnSuccess) == 0x000030, "Member 'UGoogleLogin::OnSuccess' has a wrong offset!");
static_assert(offsetof(UGoogleLogin, OnFail) == 0x000040, "Member 'UGoogleLogin::OnFail' has a wrong offset!");

// Class OnlineSubsystemExtendedGoogle.OnlineSubsystemExtendedGoogleBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UOnlineSubsystemExtendedGoogleBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ChangeActiveWidget(class UCanvasPanel* ActiveWidget);
	static bool CheckIfPlayerLoggedIn();
	static class FString GetAccessToken();
	static bool GetAllCachedGoogleUsersInfo(TArray<struct FGoogleProfile>* Users);
	static struct FGoogleProfile GetCachedGoogleUserInfo(const class FString& UserID);
	static class FString GetUserId();
	static class FString GetUsername();
	static void ResetActiveWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineSubsystemExtendedGoogleBlueprintLibrary">();
	}
	static class UOnlineSubsystemExtendedGoogleBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineSubsystemExtendedGoogleBlueprintLibrary>();
	}
};
static_assert(alignof(UOnlineSubsystemExtendedGoogleBlueprintLibrary) == 0x000008, "Wrong alignment on UOnlineSubsystemExtendedGoogleBlueprintLibrary");
static_assert(sizeof(UOnlineSubsystemExtendedGoogleBlueprintLibrary) == 0x000028, "Wrong size on UOnlineSubsystemExtendedGoogleBlueprintLibrary");

// Class OnlineSubsystemExtendedGoogle.OnlineSubsystemExtendedGoogleWebBrowser
// 0x0038 (0x0140 - 0x0108)
class UOnlineSubsystemExtendedGoogleWebBrowser final : public UWidget
{
public:
	UMulticastInlineDelegateProperty_             OnUrlChanged;                                      // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 InitialURL;                                        // 0x0118(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSupportsTransparency;                             // 0x0128(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_129[0x17];                                     // 0x0129(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EnableIME();
	void LoadURL(const class FString& NewURL);
	void OnUrlChanged__DelegateSignature(const class FText& Text);
	void SetFocusToBrowser();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineSubsystemExtendedGoogleWebBrowser">();
	}
	static class UOnlineSubsystemExtendedGoogleWebBrowser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineSubsystemExtendedGoogleWebBrowser>();
	}
};
static_assert(alignof(UOnlineSubsystemExtendedGoogleWebBrowser) == 0x000008, "Wrong alignment on UOnlineSubsystemExtendedGoogleWebBrowser");
static_assert(sizeof(UOnlineSubsystemExtendedGoogleWebBrowser) == 0x000140, "Wrong size on UOnlineSubsystemExtendedGoogleWebBrowser");
static_assert(offsetof(UOnlineSubsystemExtendedGoogleWebBrowser, OnUrlChanged) == 0x000108, "Member 'UOnlineSubsystemExtendedGoogleWebBrowser::OnUrlChanged' has a wrong offset!");
static_assert(offsetof(UOnlineSubsystemExtendedGoogleWebBrowser, InitialURL) == 0x000118, "Member 'UOnlineSubsystemExtendedGoogleWebBrowser::InitialURL' has a wrong offset!");
static_assert(offsetof(UOnlineSubsystemExtendedGoogleWebBrowser, bSupportsTransparency) == 0x000128, "Member 'UOnlineSubsystemExtendedGoogleWebBrowser::bSupportsTransparency' has a wrong offset!");

// Class OnlineSubsystemExtendedGoogle.OnlineSubsystemExtendedGoogleWidget
// 0x0038 (0x0278 - 0x0240)
class UOnlineSubsystemExtendedGoogleWidget final : public UUserWidget
{
public:
	class UOnlineSubsystemExtendedGoogleWebBrowser* WebBrowser;                                        // 0x0240(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_248[0x20];                                     // 0x0248(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UButton*                                M_Btn_Close;                                       // 0x0268(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_270[0x8];                                      // 0x0270(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EnableCustomStyle(bool bEnable);
	void HandleOnUrlChanged(const class FText& Text);
	void OnClickClose();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineSubsystemExtendedGoogleWidget">();
	}
	static class UOnlineSubsystemExtendedGoogleWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineSubsystemExtendedGoogleWidget>();
	}
};
static_assert(alignof(UOnlineSubsystemExtendedGoogleWidget) == 0x000008, "Wrong alignment on UOnlineSubsystemExtendedGoogleWidget");
static_assert(sizeof(UOnlineSubsystemExtendedGoogleWidget) == 0x000278, "Wrong size on UOnlineSubsystemExtendedGoogleWidget");
static_assert(offsetof(UOnlineSubsystemExtendedGoogleWidget, WebBrowser) == 0x000240, "Member 'UOnlineSubsystemExtendedGoogleWidget::WebBrowser' has a wrong offset!");
static_assert(offsetof(UOnlineSubsystemExtendedGoogleWidget, M_Btn_Close) == 0x000268, "Member 'UOnlineSubsystemExtendedGoogleWidget::M_Btn_Close' has a wrong offset!");

}

