#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PolygonButton

#include "Basic.hpp"

#include "PolygonButton_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class PolygonButton.PolygonButton
// 0x0020 (0x0448 - 0x0428)
class UPolygonButton final : public UButton
{
public:
	struct FPolygon2D                             NormalizedPolygon;                                 // 0x0428(0x0010)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_438[0x10];                                     // 0x0438(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const TArray<struct FVector2D> GetPolygonVertices();
	void SetPolygonVertices(const TArray<struct FVector2D>& VertexList);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PolygonButton">();
	}
	static class UPolygonButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPolygonButton>();
	}
};
static_assert(alignof(UPolygonButton) == 0x000008, "Wrong alignment on UPolygonButton");
static_assert(sizeof(UPolygonButton) == 0x000448, "Wrong size on UPolygonButton");
static_assert(offsetof(UPolygonButton, NormalizedPolygon) == 0x000428, "Member 'UPolygonButton::NormalizedPolygon' has a wrong offset!");

// Class PolygonButton.PolygonOverlay
// 0x0010 (0x0130 - 0x0120)
class UPolygonOverlay final : public UPanelWidget
{
public:
	uint8                                         Pad_120[0x10];                                     // 0x0120(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UPolygonOverlaySlot* AddChildToOverlay(class UWidget* Content);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PolygonOverlay">();
	}
	static class UPolygonOverlay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPolygonOverlay>();
	}
};
static_assert(alignof(UPolygonOverlay) == 0x000008, "Wrong alignment on UPolygonOverlay");
static_assert(sizeof(UPolygonOverlay) == 0x000130, "Wrong size on UPolygonOverlay");

// Class PolygonButton.PolygonOverlaySlot
// 0x0000 (0x0058 - 0x0058)
class UPolygonOverlaySlot final : public UOverlaySlot
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PolygonOverlaySlot">();
	}
	static class UPolygonOverlaySlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPolygonOverlaySlot>();
	}
};
static_assert(alignof(UPolygonOverlaySlot) == 0x000008, "Wrong alignment on UPolygonOverlaySlot");
static_assert(sizeof(UPolygonOverlaySlot) == 0x000058, "Wrong size on UPolygonOverlaySlot");

}

