#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoundManagerActor_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MirMobile_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SoundManagerActor_BP.SoundManagerActor_BP_C
// 0x0020 (0x0448 - 0x0428)
class ASoundManagerActor_BP_C final : public AMM_SoundManagerActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Dialogue_Audio;                                    // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        BGM_Audio;                                         // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SoundManagerActor_BP(int32 EntryPoint);
	void UserConstructionScript();
	void SetMediaSoundVolume(class UMediaSoundComponent* PMediaSoundComponent, float FVolume);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SoundManagerActor_BP_C">();
	}
	static class ASoundManagerActor_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASoundManagerActor_BP_C>();
	}
};
static_assert(alignof(ASoundManagerActor_BP_C) == 0x000008, "Wrong alignment on ASoundManagerActor_BP_C");
static_assert(sizeof(ASoundManagerActor_BP_C) == 0x000448, "Wrong size on ASoundManagerActor_BP_C");
static_assert(offsetof(ASoundManagerActor_BP_C, UberGraphFrame) == 0x000428, "Member 'ASoundManagerActor_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASoundManagerActor_BP_C, Dialogue_Audio) == 0x000430, "Member 'ASoundManagerActor_BP_C::Dialogue_Audio' has a wrong offset!");
static_assert(offsetof(ASoundManagerActor_BP_C, BGM_Audio) == 0x000438, "Member 'ASoundManagerActor_BP_C::BGM_Audio' has a wrong offset!");
static_assert(offsetof(ASoundManagerActor_BP_C, DefaultSceneRoot) == 0x000440, "Member 'ASoundManagerActor_BP_C::DefaultSceneRoot' has a wrong offset!");

}

