#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoundManagerActor_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function SoundManagerActor_BP.SoundManagerActor_BP_C.ExecuteUbergraph_SoundManagerActor_BP
// 0x0018 (0x0018 - 0x0000)
struct SoundManagerActor_BP_C_ExecuteUbergraph_SoundManagerActor_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaSoundComponent*                   K2Node_Event_pMediaSoundComponent;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_fVolume;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundManagerActor_BP_C_ExecuteUbergraph_SoundManagerActor_BP) == 0x000008, "Wrong alignment on SoundManagerActor_BP_C_ExecuteUbergraph_SoundManagerActor_BP");
static_assert(sizeof(SoundManagerActor_BP_C_ExecuteUbergraph_SoundManagerActor_BP) == 0x000018, "Wrong size on SoundManagerActor_BP_C_ExecuteUbergraph_SoundManagerActor_BP");
static_assert(offsetof(SoundManagerActor_BP_C_ExecuteUbergraph_SoundManagerActor_BP, EntryPoint) == 0x000000, "Member 'SoundManagerActor_BP_C_ExecuteUbergraph_SoundManagerActor_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SoundManagerActor_BP_C_ExecuteUbergraph_SoundManagerActor_BP, K2Node_Event_pMediaSoundComponent) == 0x000008, "Member 'SoundManagerActor_BP_C_ExecuteUbergraph_SoundManagerActor_BP::K2Node_Event_pMediaSoundComponent' has a wrong offset!");
static_assert(offsetof(SoundManagerActor_BP_C_ExecuteUbergraph_SoundManagerActor_BP, K2Node_Event_fVolume) == 0x000010, "Member 'SoundManagerActor_BP_C_ExecuteUbergraph_SoundManagerActor_BP::K2Node_Event_fVolume' has a wrong offset!");

// Function SoundManagerActor_BP.SoundManagerActor_BP_C.SetMediaSoundVolume
// 0x0010 (0x0010 - 0x0000)
struct SoundManagerActor_BP_C_SetMediaSoundVolume final
{
public:
	class UMediaSoundComponent*                   PMediaSoundComponent;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FVolume;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SoundManagerActor_BP_C_SetMediaSoundVolume) == 0x000008, "Wrong alignment on SoundManagerActor_BP_C_SetMediaSoundVolume");
static_assert(sizeof(SoundManagerActor_BP_C_SetMediaSoundVolume) == 0x000010, "Wrong size on SoundManagerActor_BP_C_SetMediaSoundVolume");
static_assert(offsetof(SoundManagerActor_BP_C_SetMediaSoundVolume, PMediaSoundComponent) == 0x000000, "Member 'SoundManagerActor_BP_C_SetMediaSoundVolume::PMediaSoundComponent' has a wrong offset!");
static_assert(offsetof(SoundManagerActor_BP_C_SetMediaSoundVolume, FVolume) == 0x000008, "Member 'SoundManagerActor_BP_C_SetMediaSoundVolume::FVolume' has a wrong offset!");

}

