#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Drag

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "MirMobile_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Drag.UI_Drag_C
// 0x00B0 (0x03D0 - 0x0320)
class UUI_Drag_C final : public UMM_UI_Drag
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Can_Main;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DragImage;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DragSize;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            ____t__;                                           // 0x0340(0x0088)(Edit, BlueprintVisible)
	struct FVector2D                              DragSizeValue;                                     // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_Drag(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Drag_C">();
	}
	static class UUI_Drag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Drag_C>();
	}
};
static_assert(alignof(UUI_Drag_C) == 0x000008, "Wrong alignment on UUI_Drag_C");
static_assert(sizeof(UUI_Drag_C) == 0x0003D0, "Wrong size on UUI_Drag_C");
static_assert(offsetof(UUI_Drag_C, UberGraphFrame) == 0x000320, "Member 'UUI_Drag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Drag_C, Can_Main) == 0x000328, "Member 'UUI_Drag_C::Can_Main' has a wrong offset!");
static_assert(offsetof(UUI_Drag_C, DragImage) == 0x000330, "Member 'UUI_Drag_C::DragImage' has a wrong offset!");
static_assert(offsetof(UUI_Drag_C, DragSize) == 0x000338, "Member 'UUI_Drag_C::DragSize' has a wrong offset!");
static_assert(offsetof(UUI_Drag_C, ____t__) == 0x000340, "Member 'UUI_Drag_C::____t__' has a wrong offset!");
static_assert(offsetof(UUI_Drag_C, DragSizeValue) == 0x0003C8, "Member 'UUI_Drag_C::DragSizeValue' has a wrong offset!");

}

