#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PayStationBrowser

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PayStationBrowser.W_PayStationBrowser_C
// 0x0028 (0x0268 - 0x0240)
class UW_PayStationBrowser_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                btn_close;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UXsollaWebBrowser*                      XsollaWebBrowser_42;                               // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastInlineDelegateProperty_             Broswer_Closed;                                    // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_W_PayStationBrowser(int32 EntryPoint);
	void Construct();
	void BndEvt__Button_171_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__XsollaWebBrowser_42_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature(const class FText& Text);
	void Broswer_Closed__DelegateSignature(bool Payment_Done);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PayStationBrowser_C">();
	}
	static class UW_PayStationBrowser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PayStationBrowser_C>();
	}
};
static_assert(alignof(UW_PayStationBrowser_C) == 0x000008, "Wrong alignment on UW_PayStationBrowser_C");
static_assert(sizeof(UW_PayStationBrowser_C) == 0x000268, "Wrong size on UW_PayStationBrowser_C");
static_assert(offsetof(UW_PayStationBrowser_C, UberGraphFrame) == 0x000240, "Member 'UW_PayStationBrowser_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PayStationBrowser_C, btn_close) == 0x000248, "Member 'UW_PayStationBrowser_C::btn_close' has a wrong offset!");
static_assert(offsetof(UW_PayStationBrowser_C, XsollaWebBrowser_42) == 0x000250, "Member 'UW_PayStationBrowser_C::XsollaWebBrowser_42' has a wrong offset!");
static_assert(offsetof(UW_PayStationBrowser_C, Broswer_Closed) == 0x000258, "Member 'UW_PayStationBrowser_C::Broswer_Closed' has a wrong offset!");

}

