#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_StoreBrowser

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_StoreBrowser.W_StoreBrowser_C.ExecuteUbergraph_W_StoreBrowser
// 0x0050 (0x0050 - 0x0000)
struct W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UXsollaStoreSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPendingPaystationUrl_ReturnValue;      // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0020(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser) == 0x000008, "Wrong alignment on W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser");
static_assert(sizeof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser) == 0x000050, "Wrong size on W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, EntryPoint) == 0x000000, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, CallFunc_GetPendingPaystationUrl_ReturnValue) == 0x000010, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::CallFunc_GetPendingPaystationUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, K2Node_ComponentBoundEvent_Text) == 0x000020, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser, CallFunc_Contains_ReturnValue) == 0x000048, "Member 'W_StoreBrowser_C_ExecuteUbergraph_W_StoreBrowser::CallFunc_Contains_ReturnValue' has a wrong offset!");

// Function W_StoreBrowser.W_StoreBrowser_C.BndEvt__XsollaWebBrowser_42_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_StoreBrowser_C_BndEvt__XsollaWebBrowser_42_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_StoreBrowser_C_BndEvt__XsollaWebBrowser_42_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_StoreBrowser_C_BndEvt__XsollaWebBrowser_42_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature");
static_assert(sizeof(W_StoreBrowser_C_BndEvt__XsollaWebBrowser_42_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature) == 0x000018, "Wrong size on W_StoreBrowser_C_BndEvt__XsollaWebBrowser_42_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature");
static_assert(offsetof(W_StoreBrowser_C_BndEvt__XsollaWebBrowser_42_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature, Text) == 0x000000, "Member 'W_StoreBrowser_C_BndEvt__XsollaWebBrowser_42_K2Node_ComponentBoundEvent_2_OnUrlChanged__DelegateSignature::Text' has a wrong offset!");

// Function W_StoreBrowser.W_StoreBrowser_C.Broswer Closed__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_StoreBrowser_C_Broswer_Closed__DelegateSignature final
{
public:
	bool                                          Payment_Done;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_StoreBrowser_C_Broswer_Closed__DelegateSignature) == 0x000001, "Wrong alignment on W_StoreBrowser_C_Broswer_Closed__DelegateSignature");
static_assert(sizeof(W_StoreBrowser_C_Broswer_Closed__DelegateSignature) == 0x000001, "Wrong size on W_StoreBrowser_C_Broswer_Closed__DelegateSignature");
static_assert(offsetof(W_StoreBrowser_C_Broswer_Closed__DelegateSignature, Payment_Done) == 0x000000, "Member 'W_StoreBrowser_C_Broswer_Closed__DelegateSignature::Payment_Done' has a wrong offset!");

}

