#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WNGamePlugin

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class WNGamePlugin.WNAndroidAdvertising
// 0x0000 (0x0030 - 0x0030)
class UWNAndroidAdvertising final : public UBlueprintAsyncActionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WNAndroidAdvertising">();
	}
	static class UWNAndroidAdvertising* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWNAndroidAdvertising>();
	}
};
static_assert(alignof(UWNAndroidAdvertising) == 0x000008, "Wrong alignment on UWNAndroidAdvertising");
static_assert(sizeof(UWNAndroidAdvertising) == 0x000030, "Wrong size on UWNAndroidAdvertising");

// Class WNGamePlugin.WNAndroidDeviceState
// 0x0010 (0x0040 - 0x0030)
class UWNAndroidDeviceState final : public UBlueprintAsyncActionBase
{
public:
	UMulticastInlineDelegateProperty_             OnChangedAndroidDeviceState;                       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UWNAndroidDeviceState* ConnectListener();
	static void DisConnectListener(class UWNAndroidDeviceState* RemoveListener);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WNAndroidDeviceState">();
	}
	static class UWNAndroidDeviceState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWNAndroidDeviceState>();
	}
};
static_assert(alignof(UWNAndroidDeviceState) == 0x000008, "Wrong alignment on UWNAndroidDeviceState");
static_assert(sizeof(UWNAndroidDeviceState) == 0x000040, "Wrong size on UWNAndroidDeviceState");
static_assert(offsetof(UWNAndroidDeviceState, OnChangedAndroidDeviceState) == 0x000030, "Member 'UWNAndroidDeviceState::OnChangedAndroidDeviceState' has a wrong offset!");

// Class WNGamePlugin.WNAndroidEmulatorDetector
// 0x0000 (0x0030 - 0x0030)
class UWNAndroidEmulatorDetector final : public UBlueprintAsyncActionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WNAndroidEmulatorDetector">();
	}
	static class UWNAndroidEmulatorDetector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWNAndroidEmulatorDetector>();
	}
};
static_assert(alignof(UWNAndroidEmulatorDetector) == 0x000008, "Wrong alignment on UWNAndroidEmulatorDetector");
static_assert(sizeof(UWNAndroidEmulatorDetector) == 0x000030, "Wrong size on UWNAndroidEmulatorDetector");

// Class WNGamePlugin.WNAndroidJNI
// 0x0000 (0x0030 - 0x0030)
class UWNAndroidJNI final : public UBlueprintAsyncActionBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WNAndroidJNI">();
	}
	static class UWNAndroidJNI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWNAndroidJNI>();
	}
};
static_assert(alignof(UWNAndroidJNI) == 0x000008, "Wrong alignment on UWNAndroidJNI");
static_assert(sizeof(UWNAndroidJNI) == 0x000030, "Wrong size on UWNAndroidJNI");

// Class WNGamePlugin.WNGamePluginSettings
// 0x0010 (0x0038 - 0x0028)
class UWNGamePluginSettings final : public UObject
{
public:
	bool                                          bEnableFreeStopHinge;                              // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableGalaxyStore;                                // 0x0029(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableOneStore;                                   // 0x002A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableXsolla;                                     // 0x002B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableSteam;                                      // 0x002C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableHuawei;                                     // 0x002D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableWemix;                                      // 0x002E(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAdMob;                                      // 0x002F(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableXsollaLogin;                                // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableGoogleADID;                                 // 0x0031(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAdjust;                                     // 0x0032(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WNGamePluginSettings">();
	}
	static class UWNGamePluginSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWNGamePluginSettings>();
	}
};
static_assert(alignof(UWNGamePluginSettings) == 0x000008, "Wrong alignment on UWNGamePluginSettings");
static_assert(sizeof(UWNGamePluginSettings) == 0x000038, "Wrong size on UWNGamePluginSettings");
static_assert(offsetof(UWNGamePluginSettings, bEnableFreeStopHinge) == 0x000028, "Member 'UWNGamePluginSettings::bEnableFreeStopHinge' has a wrong offset!");
static_assert(offsetof(UWNGamePluginSettings, bEnableGalaxyStore) == 0x000029, "Member 'UWNGamePluginSettings::bEnableGalaxyStore' has a wrong offset!");
static_assert(offsetof(UWNGamePluginSettings, bEnableOneStore) == 0x00002A, "Member 'UWNGamePluginSettings::bEnableOneStore' has a wrong offset!");
static_assert(offsetof(UWNGamePluginSettings, bEnableXsolla) == 0x00002B, "Member 'UWNGamePluginSettings::bEnableXsolla' has a wrong offset!");
static_assert(offsetof(UWNGamePluginSettings, bEnableSteam) == 0x00002C, "Member 'UWNGamePluginSettings::bEnableSteam' has a wrong offset!");
static_assert(offsetof(UWNGamePluginSettings, bEnableHuawei) == 0x00002D, "Member 'UWNGamePluginSettings::bEnableHuawei' has a wrong offset!");
static_assert(offsetof(UWNGamePluginSettings, bEnableWemix) == 0x00002E, "Member 'UWNGamePluginSettings::bEnableWemix' has a wrong offset!");
static_assert(offsetof(UWNGamePluginSettings, bEnableAdMob) == 0x00002F, "Member 'UWNGamePluginSettings::bEnableAdMob' has a wrong offset!");
static_assert(offsetof(UWNGamePluginSettings, bEnableXsollaLogin) == 0x000030, "Member 'UWNGamePluginSettings::bEnableXsollaLogin' has a wrong offset!");
static_assert(offsetof(UWNGamePluginSettings, bEnableGoogleADID) == 0x000031, "Member 'UWNGamePluginSettings::bEnableGoogleADID' has a wrong offset!");
static_assert(offsetof(UWNGamePluginSettings, bEnableAdjust) == 0x000032, "Member 'UWNGamePluginSettings::bEnableAdjust' has a wrong offset!");

}

