#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WNGamePlugin

#include "Basic.hpp"


namespace SDK::Params
{

// Function WNGamePlugin.WNAndroidDeviceState.ConnectListener
// 0x0008 (0x0008 - 0x0000)
struct WNAndroidDeviceState_ConnectListener final
{
public:
	class UWNAndroidDeviceState*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WNAndroidDeviceState_ConnectListener) == 0x000008, "Wrong alignment on WNAndroidDeviceState_ConnectListener");
static_assert(sizeof(WNAndroidDeviceState_ConnectListener) == 0x000008, "Wrong size on WNAndroidDeviceState_ConnectListener");
static_assert(offsetof(WNAndroidDeviceState_ConnectListener, ReturnValue) == 0x000000, "Member 'WNAndroidDeviceState_ConnectListener::ReturnValue' has a wrong offset!");

// Function WNGamePlugin.WNAndroidDeviceState.DisConnectListener
// 0x0008 (0x0008 - 0x0000)
struct WNAndroidDeviceState_DisConnectListener final
{
public:
	class UWNAndroidDeviceState*                  RemoveListener;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WNAndroidDeviceState_DisConnectListener) == 0x000008, "Wrong alignment on WNAndroidDeviceState_DisConnectListener");
static_assert(sizeof(WNAndroidDeviceState_DisConnectListener) == 0x000008, "Wrong size on WNAndroidDeviceState_DisConnectListener");
static_assert(offsetof(WNAndroidDeviceState_DisConnectListener, RemoveListener) == 0x000000, "Member 'WNAndroidDeviceState_DisConnectListener::RemoveListener' has a wrong offset!");

}

