#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: XsollaPayStation

#include "Basic.hpp"


namespace SDK::Params
{

// Function XsollaPayStation.XsollaPayStationSubsystem.FetchPaymentToken
// 0x0020 (0x0020 - 0x0000)
struct XsollaPayStationSubsystem_FetchPaymentToken final
{
public:
	TDelegate<void(const class FString& PaymentToken)> SuccessCallback;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 StatusCode, int32 ErrorCode, const class FString& ErrorMessage)> ErrorCallback;                                     // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaPayStationSubsystem_FetchPaymentToken) == 0x000004, "Wrong alignment on XsollaPayStationSubsystem_FetchPaymentToken");
static_assert(sizeof(XsollaPayStationSubsystem_FetchPaymentToken) == 0x000020, "Wrong size on XsollaPayStationSubsystem_FetchPaymentToken");
static_assert(offsetof(XsollaPayStationSubsystem_FetchPaymentToken, SuccessCallback) == 0x000000, "Member 'XsollaPayStationSubsystem_FetchPaymentToken::SuccessCallback' has a wrong offset!");
static_assert(offsetof(XsollaPayStationSubsystem_FetchPaymentToken, ErrorCallback) == 0x000010, "Member 'XsollaPayStationSubsystem_FetchPaymentToken::ErrorCallback' has a wrong offset!");

// Function XsollaPayStation.XsollaPayStationSubsystem.LaunchPaymentConsole
// 0x0018 (0x0018 - 0x0000)
struct XsollaPayStationSubsystem_LaunchPaymentConsole final
{
public:
	class FString                                 PaymentToken;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            BrowserWidget;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaPayStationSubsystem_LaunchPaymentConsole) == 0x000008, "Wrong alignment on XsollaPayStationSubsystem_LaunchPaymentConsole");
static_assert(sizeof(XsollaPayStationSubsystem_LaunchPaymentConsole) == 0x000018, "Wrong size on XsollaPayStationSubsystem_LaunchPaymentConsole");
static_assert(offsetof(XsollaPayStationSubsystem_LaunchPaymentConsole, PaymentToken) == 0x000000, "Member 'XsollaPayStationSubsystem_LaunchPaymentConsole::PaymentToken' has a wrong offset!");
static_assert(offsetof(XsollaPayStationSubsystem_LaunchPaymentConsole, BrowserWidget) == 0x000010, "Member 'XsollaPayStationSubsystem_LaunchPaymentConsole::BrowserWidget' has a wrong offset!");

// Function XsollaPayStation.XsollaPayStationSubsystem.GetPendingPaystationUrl
// 0x0010 (0x0010 - 0x0000)
struct XsollaPayStationSubsystem_GetPendingPaystationUrl final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(XsollaPayStationSubsystem_GetPendingPaystationUrl) == 0x000008, "Wrong alignment on XsollaPayStationSubsystem_GetPendingPaystationUrl");
static_assert(sizeof(XsollaPayStationSubsystem_GetPendingPaystationUrl) == 0x000010, "Wrong size on XsollaPayStationSubsystem_GetPendingPaystationUrl");
static_assert(offsetof(XsollaPayStationSubsystem_GetPendingPaystationUrl, ReturnValue) == 0x000000, "Member 'XsollaPayStationSubsystem_GetPendingPaystationUrl::ReturnValue' has a wrong offset!");

}

